[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWalmart Neighborhood Market: m.03zryy | type.object : type | organization.organization : founders, date_founded, child, parent, leadership, companies_acquired | organization.organization_relationship : child, parent | architecture.building_function : buildings | organization.organization_sector : organizations_in_this_sector | business.business_operation : industry | kg.object_profile : prominent_type | symbols.namesake : named_after | business.acquisition : company_acquired | organization.leadership : person\n\n\nquestion:\n\nIn what industry does the organization Walmart Neighborhood Market operate?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.03zryy .\n?c ns:business.business_operation.industry ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Retail, Department store, Variety Stores"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSouth Side Weekly: m.03cds5w | Kurt Vonnegut: m.049gc | people.person : religion, quotations, profession, nationality, education, place_of_birth, gender | education.education : institution, student | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | location.location : events, containedby | influence.influence_node : influenced_by, influenced | type.object : type | book.author : book_editions_published, works_written | media_common.dedicator : dedications | media_common.dedication : work_dedicated | common.topic : notable_types | kg.object_profile : prominent_type | education.educational_institution : school_type, newspaper, colors, students_graduates | film.film_story_contributor : film_story_credits | military.military_person : participated_in_conflicts | organization.organization : spin_offs, date_founded | organization.organization_spin_off : child_company | award.award_nominee : award_nominations | award.award_nomination : nominated_for\n\n\nquestion:\n\nWhere did Kurt Vonnegut attend university, where the institution has a newspaper called the South Side Weekly?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.049gc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.newspaper ns:m.03cds5w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Chicago"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nsan diego, ca: m.071vr | travel.tourist_attraction : near_travel_destination | people.person : profession, nationality, parents, place_of_birth, gender | type.object : type | people.deceased_person : cause_of_death, place_of_death | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | american_football.football_player : position_s | organization.organization : founders | architecture.structure : height_meters | location.location : containedby | travel.travel_destination : tourist_attractions | geography.river : cities | exhibitions.exhibition_venue : exhibitions_at_this_venue | exhibitions.exhibition_run : opened_on | government.politician : government_positions_held\n\n\nquestion:\n\nWhat is there to do in San Diego for fun that is a zoo that opened after 1915?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.071vr ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "San Diego Zoo Safari Park, SeaWorld San Diego"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSeybourn Harris Lynne: m.05p13m1 | people.person : profession, nationality, parents, date_of_birth, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | type.object : type | people.deceased_person : cause_of_death, place_of_death | government.government_position_held : basic_title, legislative_sessions, district_represented | location.location : containedby | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.political_party_tenure : party | music.composer : compositions\n\n\nquestion:\n\nSeybourn Harris Lynne is grad student of what educational institution?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.students_graduates ?k .\n?k ns:education.education.student ns:m.05p13m1 .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Auburn University Historic District, United States of America, Alabama, Auburn"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAbraham Lincoln: m.0gzh | government.governmental_body : members, offices_positions | government.government_position_held : office_holder, office_position_or_title, from, appointed_by, to, governmental_body | people.person : religion, profession, nationality, gender | kg.object_profile : prominent_type | common.topic : notable_types | religion.religion : notable_figures | type.object : type | location.location : people_born_here, contains, containedby | government.government_office_or_title : office_holders | government.politician : government_positions_held | government.us_president : vice_president | organization.organization : founders | base.culturalevent.event : entity_involved | military.military_conflict : commanders | military.military_command : military_commander | government.governmental_jurisdiction : governing_officials | time.event : locations | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | influence.influence_node : influenced_by | base.inaugurations.inauguration : president | people.marriage : spouse\n\n\nquestion:\n\nWhat Vice President held governmental position from March 4, 1861?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0gzh ns:government.us_president.vice_president ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hannibal Hamlin, Andrew Johnson"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGrand Duchy of Tuscany: m.0327fc | people.deceased_person : cause_of_death, date_of_death, place_of_death | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport | people.person : profession, languages, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type | location.location : time_zones, contains, containedby | astronomy.astronomer : astronomical_objects_discovered | government.politician : government_positions_held, party | government.political_party_tenure : party | government.government_position_held : to, from\n\n\nquestion:\n\nWhat celestial body was discovered by person who once lived in the Grand Duchy of Tuscany?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.0327fc .\n?c ns:astronomy.astronomer.astronomical_objects_discovered ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Io, Callisto, Europa, Ganymede"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDianne Feinstein: m.01gqws | government.politician : government_positions_held, party | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | location.location : containedby | government.government_position_held : basic_title, office_holder, legislative_sessions, jurisdiction_of_office | people.person : religion, profession, nationality, ethnicity, date_of_birth, height_meters, place_of_birth, gender | travel.travel_destination : accommodation | government.political_party_tenure : party | government.governmental_body : members | film.film : film_art_direction_by | music.group_member : instruments_played\n\n\nquestion:\n\nIn the location that appointed Dianne Feinstein to governmental position, what hotel should i stay in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.01gqws .\n?c ns:travel.travel_destination.accommodation ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "W San Francisco, Hostelling International, City Center, Palace Hotel, San Francisco, Clift"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBurnin' Tour: m.0fds4p | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | time.event : start_date, locations | people.deceased_person : cause_of_death, place_of_burial | people.person : religion, profession, nationality, spouse_s, height_meters, place_of_birth, gender | location.location : contains, people_born_here | location.country : official_language | government.government_office_category : officeholders | education.educational_institution : school_type | book.book_subject : works | kg.object_profile : prominent_type | film.film_story_contributor : film_story_credits | music.artist : concert_tours | people.marriage : spouse | influence.influence_node : influenced_by | base.culturalevent.event : entity_involved | military.military_conflict : commanders | military.military_command : military_commander\n\n\nquestion:\n\nWhere is the grave of the artist who had the concert tour named Burnin'?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0fds4p .\n?c ns:people.deceased_person.place_of_burial ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bob Marley Mausoleum"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Country: m.01mp | location.location : time_zones, people_born_here, partially_containedby, contains, partially_contains | government.governmental_jurisdiction : governing_officials | location.country : national_anthem, languages_spoken, form_of_government | location.statistical_region : population, cpi_inflation_rate, gdp_real, long_term_unemployment_rate, net_migration | measurement_unit.dated_percentage : rate | government.national_anthem_of_a_country : anthem | government.government_position_held : office_holder | measurement_unit.adjusted_money_value : adjusted_value | measurement_unit.dated_integer : number | type.object : name, type | location.administrative_division : country | common.topic : notable_types\n\n\nquestion:\n\nWhat country that borders the U.S. has the smallest part time employment percentage?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.part_time_employment_percent ?c .\n?c ns:measurement_unit.dated_percentage.rate ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWeston House Academy: m.0_vmqrd | type.object : type | common.topic : notable_types | location.location : time_zones, containedby | sports.sports_team : sport, founded, roster | organization.organization : place_founded, date_founded | education.educational_institution : school_type, students_graduates | kg.object_profile : prominent_type | education.education : student | sports.sports_team_roster : position | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | architecture.structure : opened | user.lindenb.default_domain.scientist : known_for | education.university : number_of_undergraduates | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat invention did the person who went to Weston House Academy make?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0_vmqrd .\n?c ns:user.lindenb.default_domain.scientist.known_for ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Telephone"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHSBC Bank Australia: m.08pj33 | kg.object_profile : prominent_type | type.object : type | location.location : containedby | education.educational_institution : school_type | organization.organization : headquarters, date_founded, founders | sports.sports_team : sport, roster | sports.sports_team_roster : player | common.topic : notable_types | business.business_operation : industry | education.school : nces_school_id\n\n\nquestion:\n\nWhere is the head office of HSBC Bank Australia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.08pj33 .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "8 Canada Square, London"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMichael C. Gould: m.05t07t2 | kg.object_profile : prominent_type | people.person : religion, profession, nationality, parents, height_meters, place_of_birth, gender | type.object : type | fictional_universe.fictional_character : place_of_birth | american_football.football_player : position_s | people.deceased_person : cause_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.politician : government_positions_held, party | music.artist : genre | government.government_position_held : from, to, governmental_body | organization.organization : headquarters | location.mailing_address : citytown | government.political_party_tenure : party\n\n\nquestion:\n\nIn what city was Michael C. Gould's organization established?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.05t07t2 .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colorado Springs"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArabic Language: m.0jzc | Emirate of Ajman: m.01430j | government.governmental_jurisdiction : governing_officials | government.government_position_held : governmental_body | language.human_language : main_country, countries_spoken_in | location.location : contains, containedby | location.country : currency_used, administrative_divisions, calling_code, official_language, iso3166_1_alpha2 | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich nation that has Emirate of Ajman has Arabic as its officially recognized language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jzc ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.official_language ns:m.0jzc .\n?x ns:location.country.administrative_divisions ns:m.01430j .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United Arab Emirates"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNina Dobrev: m.027nwk2 | location.country : official_language, calling_code, second_level_divisions, administrative_divisions | location.location : adjoin_s, time_zones, people_born_here, contains, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : population, gdp_real, long_term_unemployment_rate, foreign_direct_investment_net_inflows, size_of_armed_forces, part_time_employment_percent, net_migration | measurement_unit.dated_integer : number | measurement_unit.adjusted_money_value : adjusted_value | people.person : profession, nationality | measurement_unit.dated_percentage : rate | measurement_unit.dated_money_value : amount | location.adjoining_relationship : adjoins | type.object : type | organization.organization_member : member_of | organization.organization_membership : organization\n\n\nquestion:\n\nAlso Nina Dobrev's nationality, what nation had a net migration number was -106602?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027nwk2 ns:people.person.nationality ?x .\n?x ns:location.statistical_region.net_migration ?c .\n?c ns:measurement_unit.dated_integer.number \"-106602\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBac Lieu Province: m.03qj0v | type.object : type | common.topic : notable_types | location.mailing_address : state_province_region | kg.object_profile : prominent_type | location.location : time_zones, contains, containedby | location.country : administrative_divisions, form_of_government\n\n\nquestion:\n\nThe country that contains Bac Lieu Province has what current government?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03qj0v .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Communist state, Socialist state, Single-party state"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSeven Nation Army: m.07fpnw | tv.tv_program : program_creator, number_of_seasons, number_of_episodes, episode_running_time | type.object : type | film.film : language, release_date_s, written_by, executive_produced_by, music, production_companies, sequel, initial_release_date, country, costume_design_by, starring, genre | sports.sports_team : fight_song, colors | media_common.netflix_title : netflix_genres | book.written_work : author | music.album : release_date | film.film_regional_release_date : release_date | location.location : time_zones, people_born_here | people.person : profession | film.performance : character, actor | common.topic : notable_types | sports.sports_team_roster : player | base.culturalevent.event : entity_involved | book.book : genre\n\n\nquestion:\n\nWhich colors does the team whose fight song is \"Seven Nation Army\" use?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.07fpnw .\n?c ns:sports.sports_team.colors ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Black, Gold, White, Purple"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBen Starret: m.05b57rw | people.person : religion, profession, nationality, ethnicity, date_of_birth, height_meters, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | type.object : type | kg.object_profile : prominent_type | government.politician : government_positions_held | government.government_position_held : basic_title, governmental_body | people.deceased_person : cause_of_death | education.educational_institution : mascot | american_football.football_player : position_s\n\n\nquestion:\n\nWhat is the mascot of the school that has a grad student named Ben Starret?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.students_graduates ?k .\n?k ns:education.education.student ns:m.05b57rw .\n?c ns:education.educational_institution.mascot ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Saint Mary's College of California Gael"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLancelot Andrewes: m.04l59 | Henry VIII of England: m.03p77 | location.location : contains, people_born_here | organization.organization_founder : organizations_founded | kg.object_profile : prominent_type | religion.religion : notable_figures, places_of_worship, is_part_of | people.person : religion | location.country : second_level_divisions | location.statistical_region : gdp_nominal | measurement_unit.dated_money_value : currency | people.deceased_person : date_of_burial | type.object : type\n\n\nquestion:\n\nWhat religion was founded by King Henry VIII and includes Lancelot Andrewes as a key member?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03p77 ns:people.person.religion ?x .\n?x ns:religion.religion.notable_figures ns:m.04l59 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Anglicanism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl XVIII: m.076s5 | media_common.netflix_genre : titles | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, from | people.person : religion, profession, nationality, place_of_birth, gender | type.object : type | military.military_conflict : casualties | military.casualties : lower_estimate | government.political_party : ideology | award.award_nominee : award_nominations | location.location : contains, people_born_here | influence.influence_node : influenced_by | time.event : end_date | common.topic : notable_types | film.film_genre : films_in_this_genre | book.book : genre | book.author : works_written | biology.animal_breed : place_of_origin | government.government_office_or_title : office_holders | kg.object_profile : prominent_type | government.government_office_category : officeholders | symbols.name_source : namesakes | sports.sports_championship_event : runner_up | film.film : language | sports.sports_team : championships\n\n\nquestion:\n\nWhere did the team that won the Superbowl XVIII move from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.076s5 .\n?c ns:user.dylanrocks.national_football_league.nfl_teams_that_have_moved_cities.original_city ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Los Angeles"
    }
]