[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBaghdad: m.01fqm | Persian Language: m.032f6 | language.human_language : countries_spoken_in | location.location : containedby, events, contains, people_born_here | location.country : administrative_divisions, iso_alpha_3, capital, languages_spoken, form_of_government | type.object : type | periodicals.newspaper_circulation_area : newspapers | government.governmental_jurisdiction : government_bodies, government, governing_officials | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | government.government_position_held : basic_title, office_holder | measurement_unit.dated_integer : number | military.military_combatant : casualties | military.casualties : military_conflict | kg.object_profile : prominent_type | organization.organization_founder : organizations_founded | fictional_universe.fictional_setting : fictional_characters_born_here\n\n\nquestion:\n\nWhat country speaks Farsi and has Baghdad as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.032f6 ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.capital ns:m.01fqm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iraq"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIran: m.03shp | location.location : containedby, time_zones, people_born_here, contains, partially_contains | people.person : nationality, gender | architecture.structure : opened, height_meters, construction_started | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to | government.politician : government_positions_held | education.educational_institution : students_graduates | education.education : student | sports.sports_championship_event : runner_up | architecture.building : floors | common.topic : notable_types | periodicals.newspaper_circulation_area : newspapers | sports.pro_athlete : teams, sports_played_professionally | sports.sports_team_roster : team, position | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | government.government_office_or_title : office_holders | government.government_office_category : officeholders | people.deceased_person : date_of_death | film.film : release_date_s, initial_release_date | organization.organization : place_founded | film.film_regional_release_date : release_date | kg.object_profile : prominent_type | sports.pro_sports_played : sport\n\n\nquestion:\n\nWhat country once had CO2 emissions per capita of 2009 metric ton and is a trading partner with Iran?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.03shp ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.03shp ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2009\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Madagascar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nnfl super bowl: m.06x5s | Super Bowl XXXIII: m.076y0 | sports.sports_championship : events | time.recurring_event : instances | type.object : type | time.event : end_date, start_date, instance_of_recurring_event | sports.sports_championship_event : championship, champion | common.topic : notable_types\n\n\nquestion:\n\nWhat was the last Superbowl won by the team who won the XXXIII Superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.076y0 .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.instance_of_recurring_event ns:m.06x5s .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XXXIII"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nShaquille O'Neal: m.012xdf | 2008 NBA Finals: m.0403mzq | sports.sports_team : colors, location, team_mascot, championships, roster | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.sports_team_roster : player, position | type.object : type | award.award_nominee : award_nominations | award.award_nomination : award, nominated_for | film.actor : film | film.performance : film | time.event : start_date | sports.sports_championship_event : championship, champion | common.topic : notable_types | people.person : profession, gender | sports.pro_sports_played : career_start | sports.professional_sports_team : owner_s | music.composer : compositions | music.featured_artist : recordings | basketball.basketball_team : head_coach\n\n\nquestion:\n\nWhat team that Shaq play for that own the 2008 NBA Finals championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.0403mzq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston Celtics"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Noddfa, Treorchy: m.0_gw15p | United Kingdom: m.07ssc | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.statistical_region : population, cpi_inflation_rate, gdp_real, places_imported_from, size_of_armed_forces | measurement_unit.dated_percentage : rate | measurement_unit.adjusted_money_value : adjusted_value | type.object : name, type | measurement_unit.dated_integer : number | location.country : calling_code, languages_spoken | common.topic : notable_types | location.imports_and_exports : imported_from\n\n\nquestion:\n\nWhich countries are a part of the United Kingdom, where the religious organization leadership is in Noddfa, Treorchy?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:religion.religious_leadership_jurisdiction.leader ?c .\n?c ns:religion.religious_organization_leadership.organization ns:m.0_gw15p .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wales"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGod in Islam: m.09kb_2 | people.person : religion, children, profession, nationality, date_of_birth, height_meters, gender | type.object : type | religion.religion : deities, beliefs | government.politician : government_positions_held | government.government_position_held : basic_title, from, to, jurisdiction_of_office | people.deceased_person : cause_of_death, place_of_death | travel.tourist_attraction : near_travel_destination | military.military_person : participated_in_conflicts | common.topic : notable_types\n\n\nquestion:\n\nWho are the gods of the God in Islam belief?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.beliefs ns:m.09kb_2 .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ramdev Pir, God, Allah"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCaribbean: m.0261m | est: m.02hcv8 | time.time_zone : locations_in_this_time_zone | location.location : events, time_zones, people_born_here, contains, containedby\n\n\nquestion:\n\nWhere is the Caribbean located in the Eastern Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0261m ns:location.location.containedby ?x .\n?x ns:location.location.time_zones ns:m.02hcv8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "North America, Americas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\npeoples republic of china: m.0d05w3 | Almazbek Atambayev: m.026fsdk | location.location : events, contains | government.government_office_category : officeholders | government.government_position_held : basic_title, office_holder | people.person : profession | government.governmental_jurisdiction : governing_officials\n\n\nquestion:\n\nWhich country does China border, which is the location that appointed, Almazbek Atambayev to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d05w3 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.026fsdk .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kyrgyzstan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWorld War II: m.081pw | President of the United States: m.060d2 | time.event : includes_event, start_date | government.political_appointer : appointees | government.government_position_held : office_holder, basic_title, office_position_or_title, from, to | film.film_subject : films | government.government_office_or_title : office_holders | people.person : sibling_s, profession, nationality, quotations | government.us_president : presidency_number, vice_president | government.politician : government_positions_held | type.object : type | people.sibling_relationship : sibling\n\n\nquestion:\n\nWho was the President of these United States during WWII?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.081pw ns:time.event.start_date ?start ;\nns:time.event.end_date ?end .\n?x ns:government.politician.government_positions_held  ?y .\n?y ns:government.government_position_held.office_position_or_title ns:m.060d2 ; # President of the United States\nns:government.government_position_held.from  ?from ;\nns:government.government_position_held.to  ?to .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Franklin D. Roosevelt"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBailey: m.0j2h90q | people.person : nationality, profession, height_meters | location.location : contains, people_born_here | sports.sports_championship_event : championship | type.object : type | time.event : end_date | sports.sports_team : team_mascot, championships | location.place_with_neighborhoods : neighborhoods | kg.object_profile : prominent_type | media_common.netflix_genre : titles | location.citytown : postal_codes | sports.sports_team_location : teams | sports.sports_team_owner : teams_owned | film.film_location : featured_in_films | sports.pro_athlete : career_start | architecture.venue : capacity\n\n\nquestion:\n\nWhen was the last time the team with the mascot Bailey win a playoff?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.0j2h90q .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2014 Stanley Cup Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQuarterback: m.06b1q | 2001 AFC Championship Game: m.0_gt_qt | sports.sports_team_roster : from, player, position | time.event : end_date, start_date, locations, instance_of_recurring_event | sports.sports_championship_event : championship, runner_up | location.location : people_born_here | sports.sports_team : championships, roster | music.composition : composer | people.person : profession, nationality, gender | type.object : type | common.topic : notable_types | sports.sports_league_draft_pick : draft | american_football.football_player : passing | american_football.player_passing_statistics : attempts | kg.object_profile : prominent_type | sports.sports_team_owner : teams_owned | film.film : featured_film_locations\n\n\nquestion:\n\nWho were the quarterbacks of the team that won the 2001 AFC Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gt_qt .\n?c ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.position ns:m.06b1q .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Curtis Painter, Randall Cunningham, Tyrod Taylor, Joe Flacco, Trent Dilfer, Scott Mitchell, Chester Stewart"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nComcast Spectacor: m.026dfxf | 2010 Stanley Cup Finals: m.0by0ww1 | sports.sports_team : arena_stadium, founded, location, sport, previously_known_as, championships, roster | sports.sports_team_roster : player, position | type.object : type | organization.organization : date_founded | sports.professional_sports_team : owner_s | sports.sports_team_owner : teams_owned | kg.object_profile : prominent_type | common.topic : notable_types | ice_hockey.hockey_team : coach, captain | basketball.basketball_team : head_coach\n\n\nquestion:\n\nWhat team owned by Comcast Spectacor played in the 2010 Stanley Cup?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0by0ww1 ns:sports.sports_championship_event.champion ?x .\n}\nUNION\n{\nns:m.0by0ww1 ns:sports.sports_championship_event.runner_up ?x .\n}?x ns:sports.professional_sports_team.owner_s ns:m.026dfxf .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Philadelphia Flyers"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGumbo: m.09t292 | organization.organization : headquarters | kg.object_profile : prominent_type | time.event : end_date | location.location : containedby, people_born_here | common.topic : notable_types | award.award_category : date_established | type.object : type | sports.sports_team : team_mascot, sport, roster | location.mailing_address : country | government.government_office_category : officeholders | government.government_position_held : office_holder | american_football.football_team : current_head_coach | award.award_nominee : award_nominations | award.award_nomination : award | american_football.football_player : position_s | people.person : profession, nationality | sports.sports_team_roster : position | film.film_subject : films\n\n\nquestion:\n\nTeam mascot Gumbo is part of the team with which head coach?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.09t292 .\n?c ns:american_football.football_team.current_head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sean Payton"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNijmegen: m.05g2b | location.location : time_zones, contains, containedby | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : opened, height_meters | people.person : nationality | location.country : currency_used | architecture.building : floors | aviation.airport : serves\n\n\nquestion:\n\nWhat currency is used in the country that have airport that serves Nijmegen?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.contains ?k .\n?k ns:aviation.airport.serves ns:m.05g2b .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Euro"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKnossos: m.0ksnn | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.location : containedby, events, people_born_here, contains, partially_contains | location.country : official_language, currency_formerly_used, languages_spoken, administrative_divisions | food.beer_country_region : beers_from_here | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | type.object : type | film.film_location : featured_in_films | biology.breed_origin : breeds_originating_here | film.film_subject : films\n\n\nquestion:\n\nWhat country with CO2 emissions per capita once of 2009 metric ton was where the Palace of Knossos was located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0ksnn ns:location.location.containedby ?x .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2009\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Greece"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCleveland Cavaliers: m.0jm7n | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : draft, school, team | location.location : contains, people_born_here | music.artist : genre, track | basketball.basketball_player : position_s | type.object : type | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.sports_team_roster : position | people.person : religion, profession, nationality, ethnicity, education, spouse_s, height_meters, place_of_birth | sports.sports_team : founded, roster | media_common.netflix_genre : titles | award.award_nominee : award_nominations | award.award_nomination : nominated_for | sports.pro_sports_played : sport | tv.tv_personality : tv_regular_appearances | tv.tv_regular_personal_appearance : from | film.film_subject : films | people.marriage : location_of_ceremony | location.place_with_neighborhoods : neighborhoods | tv.tv_producer : tv_episodes_produced | tv.tv_producer_episode_credit : episode | education.education : institution\n\n\nquestion:\n\nWho did the Cleveland Cavaliers draft that started his pro athlete career the earliest?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jm7n ns:sports.professional_sports_team.draft_picks ?y .\n?y ns:sports.sports_league_draft_pick.player ?x .\n?x ns:sports.pro_athlete.career_start ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "LeBron James"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMajulah Singapura: m.01j77_ | type.object : name, type | common.topic : notable_types | architecture.structure : opened, height_meters | location.location : contains, containedby | people.person : profession, nationality, place_of_birth, gender | government.politician : government_positions_held | government.government_position_held : office_holder, from | government.government_office_or_title : office_holders | language.human_language : main_country, countries_spoken_in | government.government_office_category : officeholders | travel.tourist_attraction : near_travel_destination | location.country : currency_used | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.form_of_government : countries | film.film : language, featured_film_locations\n\n\nquestion:\n\nWhat currency is used by the country whose national anthem is \"Majulah Singapura\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01j77_ .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Singapore dollar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRio de Janeiro: m.01hd4s | type.object : type | kg.object_profile : prominent_type | location.location : time_zones, contains, containedby | common.topic : notable_types | people.person : profession, nationality, place_of_birth, gender | location.country : currency_used, administrative_divisions | architecture.structure : height_meters | government.political_district : representatives | government.government_position_held : office_holder\n\n\nquestion:\n\nRio de Janeiro is part of the country using which type of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hd4s .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brazilian real"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIranian rial: m.034n11 | biology.animal_breed : place_of_origin | people.person : profession, nationality, height_meters, place_of_birth, gender | language.human_language : language_family, main_country, countries_spoken_in | government.form_of_government : countries | finance.currency : countries_used | location.country : currency_used, form_of_government | people.deceased_person : cause_of_death, date_of_death | government.politician : government_positions_held | government.government_position_held : office_holder, jurisdiction_of_office | type.object : type | kg.object_profile : prominent_type | government.government_office_category : officeholders | location.location : contains, containedby | location.administrative_division : country\n\n\nquestion:\n\nWhat form of political system is used in the country with Iranian rial?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.034n11 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Presidential system, Islamic republic, Unitary state, Theocracy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAudi India: m.0ch13r8 | sports.sports_team : founded, roster | type.object : type | location.location : containedby | education.educational_institution : students_graduates | education.education : student | organization.organization : date_founded, parent | common.topic : notable_types | government.political_party : ideology | organization.organization_relationship : parent | government.politician : government_positions_held | people.person : height_meters, nationality | architecture.structure : height_meters | kg.object_profile : prominent_type | american_football.football_team : current_head_coach | sports.sports_team_roster : player\n\n\nquestion:\n\nThe organization Audi India was owned by whom in 2011?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.0ch13r8 .\n?c ns:organization.organization.parent ?y .\n?y ns:organization.organization_relationship.parent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Volkswagen Group"
    }
]