[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl XXX: m.076wz | type.object : type | people.person : employment_history, religion, children, profession, ethnicity, gender | sports.sports_team : championships | time.event : locations | sports.sports_championship_event : championship, runner_up | organization.organization : place_founded, headquarters | common.topic : notable_types | business.employment_tenure : company | book.book : genre | biology.animal_breed : place_of_origin | book.book_subject : works | location.location : people_born_here, contains, containedby | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : basic_title, office_holder | award.award_nominee : award_nominations | kg.object_profile : prominent_type | location.country : second_level_divisions | location.location_symbol_relationship : Kind_of_symbol | government.government_office_category : officeholders | law.invention : inventor | influence.influence_node : influenced | film.film_subject : films\n\n\nquestion:\n\nWho was the coach of the team that won Superbowl XXX in 1996?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.076wz .\n?c ns:american_football.football_team.historical_coaching_staff ?y .\n?y ns:american_football.football_historical_coach_position.coach ?x .\nEXISTS {?y ns:american_football.football_historical_coach_position.from ?sk1 .\nEXISTS {?y ns:american_football.football_historical_coach_position.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barry Switzer"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Bride with White Hair: m.0jkvl5n | mt everest: m.0blbd | location.location : partially_containedby, contains | tv.tv_program : number_of_episodes | tv.tv_location : tv_shows_filmed_here | common.topic : image\n\n\nquestion:\n\nThe TV show The Bride with White Hair was filmed in what country where Mount Everest is found?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0blbd ns:location.location.partially_containedby ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:tv.tv_location.tv_shows_filmed_here ns:m.0jkvl5n .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNijmegen: m.05g2b | European Union: m.0_6t_z8 | location.location : time_zones, area, contains, containedby | kg.object_profile : prominent_type | type.object : type | common.topic : notable_types | aviation.airport : serves | organization.organization : date_founded\n\n\nquestion:\n\nWhat EU country is the location contains an airport that serves Nijmegen?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0_6t_z8 ns:organization.membership_organization.members ?y .\n?y ns:organization.organization_membership.member ?x .\n?x ns:location.location.contains ?c .\n?c ns:aviation.airport.serves ns:m.05g2b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Germany"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNorth American Free Trade Agreement: m.05jj_ | Country: m.01mp | Oaxaca: m.014m1m | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.location : containedby, contains, people_born_here | type.object : name, type | location.statistical_region : co2_emissions_per_capita, gdp_real | location.country : second_level_divisions, administrative_divisions | measurement_unit.adjusted_money_value : adjusted_value | common.topic : notable_types\n\n\nquestion:\n\nWhat country of NAFTA contains Oaxaca?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05jj_ ns:organization.membership_organization.members ?y .\n?y ns:organization.organization_membership.member ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.014m1m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nthe united kingdom of great britain: m.014tss | American Revolutionary War: m.0jnh | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, to, from | time.event : includes_event, start_date, locations, included_in_event | base.culturalevent.event : entity_involved | military.military_conflict : commanders | military.military_command : military_commander, military_conflict | type.object : type | military.military_person : participated_in_conflicts | royalty.kingdom : rulers | people.person : profession, nationality, parents, date_of_birth, gender | film.film_subject : films | government.politician : government_positions_held | common.topic : notable_types | military.military_commander : military_commands\n\n\nquestion:\n\nWhat British General held his governmental position from September 12, 1786 and was in theRevolutionary War?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jnh ns:military.military_conflict.commanders ?y .\n?y ns:military.military_command.military_commander ?x .\n?x ns:people.person.nationality ns:m.014tss .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Charles Cornwallis, 1st Marquess Cornwallis"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLomography Gallery Store Austin: m.0kw1c4v | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, containedby | travel.travel_destination : tourist_attractions | architecture.structure : height_meters | symbols.namesake : named_after\n\n\nquestion:\n\nWhat are places to see near Lomography Gallery in Austin?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.0kw1c4v .\n?c ns:travel.travel_destination.tourist_attractions ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lady Bird Lake, Zilker Park, Lake Austin, Texas State Capitol, William Sidney Porter House, Ann W. Richards Congress Avenue Bridge, Texas Memorial Museum, Harry Ransom Center, Barton Springs Pool, Cathedral of Junk, Lyndon Baines Johnson Library and Museum, Blanton Museum of Art, Bullock Texas State History Museum, Texas Department of Public Safety Historical Museum and Research Center, Lady Bird Johnson Wildflower Center, Austin Aquarium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | s. africa: m.0hzlz | rand: m.01rmbs | location.country : languages_spoken, currency_used, administrative_divisions, form_of_government | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | type.object : name, type | location.location : people_born_here, partially_contains, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | finance.currency : countries_used\n\n\nquestion:\n\nWhat county both borders South Africa and uses the South African rand as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hzlz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.01rmbs .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Swaziland, Zimbabwe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnkara: m.0jyw | kg.object_profile : prominent_type | architecture.building : floors | type.object : type | location.location : time_zones, area, containedby | common.topic : notable_types | location.country : capital, currency_used | government.politician : government_positions_held | government.government_position_held : to | architecture.structure : height_meters\n\n\nquestion:\n\nThe country with the capital of Ankara uses what currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0jyw .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkish lira"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBenny the Bull: m.067z_k | basketball.basketball_team : head_coach | people.person : profession, nationality, ethnicity, spouse_s, place_of_birth | location.citytown : postal_codes | sports.sports_team : team_mascot, championships | sports.sports_championship_event : championship, champion, runner_up | type.object : type | location.location : events, contains, people_born_here | people.marriage : location_of_ceremony | interests.hobby : people_with_this_hobby | location.place_with_neighborhoods : neighborhoods | sports.pro_athlete : teams | basketball.basketball_player : position_s | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder\n\n\nquestion:\n\nTeam Mascot Benny the Bull is part of the team with which coach?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.067z_k .\n?c ns:basketball.basketball_team.head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tom Thibodeau"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPeter Crouch: m.03y5_6 | Bernie Ecclestone: m.0253kx | location.country : second_level_divisions, form_of_government | location.location : contains, people_born_here | book.book_subject : works | type.object : type | sports.professional_sports_team : owner_s | people.person : profession | sports.pro_athlete : teams | sports.sports_team_roster : team\n\n\nquestion:\n\nWhat sports team owned by Bernie Ecclestone has Peter Crouch played for ?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03y5_6 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.0253kx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Queens Park Rangers F.C. in European football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRegion: m.01nt | Margrethe II of Denmark: m.0g2kv | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : basic_title, office_holder | location.location : containedby, contains, people_born_here | travel.tourist_attraction : near_travel_destination | location.country : languages_spoken | type.object : type | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | people.person : place_of_birth | common.topic : notable_types | periodicals.newspaper_circulation_area : newspapers | measurement_unit.dated_metric_ton : number | time.time_zone : locations_in_this_time_zone\n\n\nquestion:\n\nWhere is the location that appointed Margrethe II of Denmark to a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0g2kv .\n?c ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nordic countries, Scandinavia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBundesrealgymnasium Linz: m.01064kcx | type.object : type | organization.organization : date_founded | business.business_operation : industry | sports.sports_team : sport, founded, roster, colors | sports.sports_team_roster : player | common.topic : notable_types | education.educational_institution : school_type | kg.object_profile : prominent_type | location.location : containedby | government.government_office_or_title : office_holders | government.government_position_held : office_holder | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | symbols.namesake : named_after | government.government : government_for\n\n\nquestion:\n\nThe person at education institution Bundesrealgymnasium Linz was the leader of what political party?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.01064kcx .\n?c ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nazi Party, German Workers' Party"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSingapore dollar: m.02f32g | location.country : currency_used, languages_spoken | government.form_of_government : countries | type.object : type | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | common.topic : notable_types | government.politician : government_positions_held | finance.currency : countries_used | architecture.structure : opened, height_meters | location.location : contains, containedby | people.deceased_person : cause_of_death, place_of_death | people.ethnicity : geographic_distribution | architecture.building : floors | film.film : initial_release_date | government.government_office_category : officeholders | government.government_position_held : office_holder | government.government_office_or_title : office_holders | kg.object_profile : prominent_type | language.human_language : main_country\n\n\nquestion:\n\nWhat language is used where the Singapore dollar is used?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.02f32g .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Chinese language, English Language, Tamil"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Bilady, Bilady, Bilady: m.0d9nj_ | people.person : profession, gender | type.object : type | location.location : contains, containedby | common.topic : notable_types | architecture.structure : opened, height_meters | kg.object_profile : prominent_type | time.time_zone : locations_in_this_time_zone | government.government_office_category : officeholders | government.government_position_held : office_holder, office_position_or_title, jurisdiction_of_office | government.politician : government_positions_held | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat countries neighbor the nation whose anthem is called \"Bilady, Bilady, Bilady\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.0d9nj_ .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Israel, Libya, Sudan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEastern European Time Zone: m.03plfd | Country: m.01mp | Egypt: m.02k54 | location.location : partially_contains, adjoin_s, time_zones, people_born_here, contains, containedby | location.country : calling_code, languages_spoken | type.object : name, type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : consumer_price_index, size_of_armed_forces, co2_emissions_per_capita | common.topic : notable_types | location.place_with_neighborhoods : neighborhoods | location.adjoining_relationship : adjoins | kg.object_profile : prominent_type | time.time_zone : locations_in_this_time_zone | measurement_unit.dated_integer : number | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat country bordering Egypt is in the Eastern European Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02k54 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.time_zones ns:m.03plfd .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Libya"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSanto Domingo: m.0fthl | kg.object_profile : prominent_type | location.location : time_zones, area, containedby | common.topic : notable_types | type.object : type | location.country : capital, currency_used | location.capital_of_administrative_division : capital_of | location.administrative_division_capital_relationship : administrative_division | organization.organization : date_founded\n\n\nquestion:\n\nWhat currency is used in the country that the capital is Santo Domingo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0fthl .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Lodge: m.01ghnw | kg.object_profile : prominent_type | travel.tourist_attraction : near_travel_destination | location.location : area, time_zones, partially_containedby, contains, containedby | common.topic : notable_types | type.object : type | architecture.structure : opened\n\n\nquestion:\n\nThe person who once lived in The Lodge Party is what?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.01ghnw .\n?c ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Queensland Labor Party, Australian Labor Party"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBRG Steyr: m.01064jg9 | sports.sports_team : sport, founded, championships, roster | location.location : time_zones, partially_contained_by, containedby | type.object : type | organization.organization : place_founded, date_founded | education.educational_institution : school_type, students_graduates | kg.object_profile : prominent_type | sports.sports_team_roster : position | location.partial_containment_relationship : partially_contained_by | common.topic : notable_types | education.education : student | education.school : highest_grade_taught | government.governmental_body : members | government.government_position_held : basic_title\n\n\nquestion:\n\nWhat politcal party was the famous person educated at BRG Steyr known for being in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.01064jg9 .\n?c ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nazi Party, German Workers' Party"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Bride with White Hair: m.0jkvl5n | Portuguese Language: m.05zjd | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_position_or_title | language.human_language : language_family, countries_spoken_in | location.location : contains | tv.tv_location : tv_shows_filmed_here | location.country : administrative_divisions | tv.tv_program : episode_running_time\n\n\nquestion:\n\nIn what Portuguese speaking country was the TV show The Bride with White Hair filmed?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05zjd ns:language.human_language.countries_spoken_in ?x .\n?x ns:tv.tv_location.tv_shows_filmed_here ns:m.0jkvl5n .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCuckoo Schools: m.0ds3bsd | kg.object_profile : prominent_type | people.person : profession | architecture.structure : opened | location.location : nearby_airports, containedby | type.object : type | organization.organization : date_founded | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | common.topic : notable_types | education.educational_institution : students_graduates, colors | education.education : student | sports.sports_team : team_mascot, venue, roster | sports.sports_team_roster : position | business.asset_ownership : owner | sports.team_venue_relationship : venue\n\n\nquestion:\n\nWhat roles is the most famous alumni of Cuckoo Schools known for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0ds3bsd .\n?c ns:people.person.profession ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Comedian, Composer, Film Producer, Actor, Film director, Film Score Composer, Film Editor, Screenwriter"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Russia: m.01ptxd | government.politician : government_positions_held | government.government_position_held : office_holder, jurisdiction_of_office | location.location : containedby | type.object : type | aviation.airport : serves | common.topic : notable_types | government.government_office_category : officeholders | people.person : profession | architecture.structure : opened | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhich religions are used in the country by the people, that has the National Anthem of Russia as its National Anthem?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01ptxd .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Russian Orthodox Church, Islam"
    }
]