[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGebel Elba: m.026cy73 | architecture.structure : height_meters | common.topic : notable_types | kg.object_profile : prominent_type | location.country : languages_spoken | location.location : area, time_zones, people_born_here, contains, containedby | type.object : type\n\n\nquestion:\n\nWhat language is spoken in the place that partially contains Gebel Elba?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.026cy73 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Siwi Language, Modern Standard Arabic, Egyptian Arabic, Sa'idi Arabic, Arabic, Sudanese Spoken Language, Bedawi Arabic, Nobiin Language, Domari Language, Arabic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSerena Williams: m.015z4j | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | type.object : type | sports.sports_team : championships | american_football.football_player : position_s | location.location : time_zones, containedby | sports.professional_sports_team : owner_s | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | influence.influence_node : influenced | kg.object_profile : prominent_type | government.politician : government_positions_held, party | government.government_position_held : basic_title, office_position_or_title, governmental_body | film.film : genre, music | people.deceased_person : cause_of_death | government.political_party_tenure : party\n\n\nquestion:\n\nWhen did the team owned by Serena Williams win the Super Bowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.015z4j .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl VII, Super Bowl VIII"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKaduna State: m.06xjmb | type.object : type | location.location : events, area, time_zones, contains, containedby | kg.object_profile : prominent_type | government.government_position_held : jurisdiction_of_office | architecture.building : floors | common.topic : notable_types | location.country : official_language, administrative_divisions | architecture.structure : opened, height_meters\n\n\nquestion:\n\nWhat are the four official languages of the country with Kaduna state in it?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.06xjmb .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTour Triangle: m.04q2g52 | people.person : profession, nationality, height_meters, place_of_birth, gender | geography.river : basin_countries | location.location : time_zones, containedby | type.object : type | kg.object_profile : prominent_type | architecture.structure : height_meters | common.topic : notable_types | travel.travel_destination : accommodation | government.politician : government_positions_held, party | government.government_position_held : basic_title, office_position_or_title | government.political_party_tenure : party | people.deceased_person : date_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport\n\n\nquestion:\n\nWhere can one stay at Tour Triangle location?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.04q2g52 .\n?c ns:travel.travel_destination.accommodation ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hôtel de Crillon, Hôtel Ritz Paris"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKingdom of Denmark: m.04_1l2q | location.location : time_zones, people_born_here, contains, containedby | type.object : type | common.topic : notable_types | architecture.structure : opened | kg.object_profile : prominent_type | people.person : date_of_birth\n\n\nquestion:\n\nWhich regions of the world contains some part of the Kingdom of Denmark?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.04_1l2q .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Northern Hemisphere, Americas, Western Hemisphere"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAbraham Lincoln: m.0gzh | President: m.060c4 | government.government_office_or_title : office_holders | government.government_position_held : office_holder, to, from | people.person : quotations | government.political_appointer : appointees\n\n\nquestion:\n\nWhat office position did Abraham Lincoln hold before he was President from March 19, 1790?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nSELECT ?pFrom\nWHERE {\nns:m.0gzh ns:government.politician.government_positions_held ?y . # Abraham Lincoln\n?y ns:government.government_position_held.office_position_or_title ?x ;\nns:government.government_position_held.basic_title ns:m.060c4 ; # President\nns:government.government_position_held.from ?pFrom .\n}\n}\nns:m.0gzh ns:government.politician.government_positions_held ?y . # Abraham Lincoln\n?y ns:government.government_position_held.office_position_or_title ?x ;\nns:government.government_position_held.from ?from .\n\n?c ns:government.government_position_held.from \"1790-03-19\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "United States Representative"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Beijing: m.01914 | Country: m.01mp | location.location : partially_contains, adjoin_s, people_born_here, contains, containedby | location.country : administrative_divisions, calling_code, capital, second_level_divisions, form_of_government | travel.travel_destination : tourist_attractions | kg.object_profile : prominent_type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | organization.organization_member : member_of | organization.organization_membership : organization | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | type.object : name | common.topic : notable_types | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat Asian country sharing landmass border with Russia also calls Beijing its capital city?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.01914 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nchicago, illinois: m.01_d4 | government.politician : government_positions_held | government.government_position_held : basic_title | location.location : area, containedby | type.object : type | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | travel.travel_destination : tourist_attractions | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | architecture.structure : opened, height_meters | music.artist : origin | music.group_member : instruments_played | people.deceased_person : cause_of_death, place_of_death | film.film_story_contributor : film_story_credits | american_football.football_player : position_s\n\n\nquestion:\n\nWhat zoo in Chicago opened after 1868?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Shedd Aquarium, Brookfield Zoo"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAdolf Hitler: m.07_m9_ | St. Mary's Cathedral, Batticaloa: m.0100k8_q | film.film_subject : films | government.political_appointer : appointees | government.government_position_held : basic_title, from, appointed_by, jurisdiction_of_office | religion.religion : deities, places_of_worship, types_of_places_of_worship, notable_figures, texts, beliefs, founding_figures | organization.organization_founder : organizations_founded | people.person : religion, profession, nationality, parents, education, height_meters | education.education : institution | type.object : type | government.politician : government_positions_held, party | people.deceased_person : cause_of_death, place_of_death | common.topic : notable_types | symbols.name_source : namesakes | government.political_party_tenure : to, party | influence.influence_node : influenced_by | base.activism.activist : area_of_activism\n\n\nquestion:\n\nWhat faith did Adolf Hitler practice that has a sacred site at St. Mary's Cathedral, Batticaloa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07_m9_ ns:people.person.religion ?x .\n?x ns:religion.religion.places_of_worship ns:m.0100k8_q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIstanbul: m.09949m | common.topic : notable_types | type.object : type | location.location : time_zones, contains, containedby | location.country : capital | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | architecture.building : floors | architecture.structure : opened | geography.river : mouth | geography.geographical_feature : category\n\n\nquestion:\n\nWhat religion did the Turks follow in the country where the capital is Istanbul?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.09949m .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Christianity, Judaism, Eastern Christianity, Catholicism, Islam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWellington: m.0853g | location.location : time_zones, people_born_here, area, containedby | architecture.structure : opened | common.topic : notable_types | type.object : type | kg.object_profile : prominent_type | location.country : capital\n\n\nquestion:\n\nWhich country does the country whose capital is Wellington import from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0853g .\n?c ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nClay Matthews III: m.04zy7pw | dt: m.084tbc | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | education.educational_institution : mascot, school_type, colors, newspaper, sports_teams, students_graduates | kg.object_profile : prominent_type | people.person : profession, nationality, parents, education, height_meters, gender | education.education : institution, student | type.object : type | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | common.topic : notable_types | organization.organization : date_founded | location.location : time_zones, containedby | award.award_nominee : award_nominations | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | book.newspaper : owner\n\n\nquestion:\n\nWhat educational institution with the Daily Trojan newspaper did Clay Matthews go to college?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04zy7pw ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.newspaper ns:m.084tbc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Southern California"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRobert J. Bentley: m.080fp__ | University of West Alabama: m.07c5fv | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, appointed_by | location.country : administrative_divisions | education.educational_institution : mascot | government.politician : government_positions_held | type.object : type | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value\n\n\nquestion:\n\nWhat State that appointed Robert J. Bentley to governmental position is the location of the University of West Alabama?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07c5fv ns:location.location.containedby ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.080fp__ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Alabama"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nsan diego, ca: m.071vr | location.location : people_born_here, contains, containedby | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : office_holder | location.statistical_region : consumer_price_index, population | measurement_unit.dated_integer : number | architecture.museum : established | location.country : second_level_divisions | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhich museum was opened in 1965 and is located in San Diego California?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.071vr ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:architecture.museum.established \"1965\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Timken Museum of Art"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNorth Carolina Tar Heels football: m.026lg0s | Michael Jordan: m.054c1 | people.person : profession, ethnicity, education, spouse_s, place_of_birth, gender | type.object : type | people.marriage : spouse, location_of_ceremony | location.location : containedby | common.topic : notable_types | sports.sports_team_owner : teams_owned | education.educational_institution : mascot, colors, newspaper, sports_teams, students_graduates | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | education.education : institution, student, major_field_of_study | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : draft, school, team | business.sponsored_recipient : sponsorship | business.sponsorship : sponsored_by | sports.pro_athlete : teams, career_start, career_end | sports.sports_team_roster : team | organization.organization : date_founded | film.film_subject : films | sports.sports_team : sport | american_football.football_team : current_head_coach, division | film.actor : film | film.performance : film\n\n\nquestion:\n\nWhat educational institution with football team named North Carolina Tar Heels, did Michael Jordan attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.054c1 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.026lg0s .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of North Carolina at Chapel Hill"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFugloy: m.0101m919 | Nordic countries: m.0140mf | Country: m.01mp | location.location : contains, people_born_here | location.country : calling_code, second_level_divisions, administrative_divisions | location.statistical_region : co2_emissions_per_capita | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title, legislative_sessions, appointed_by | type.object : name, type | biology.breed_origin : breeds_originating_here | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nFugloy is located in what Nordic country?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0140mf ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.0101m919 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Faroe Islands"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThomas S. Ricketts: m.04jf15w | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.person : religion, children, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.sports_team : championships | people.deceased_person : date_of_death | sports.professional_sports_team : owner_s | american_football.football_player : passing, position_s | american_football.player_passing_statistics : completions | government.politician : government_positions_held, party | government.political_party_tenure : party | government.government_position_held : basic_title, office_position_or_title, jurisdiction_of_office | type.object : type | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhen was the team whose owner is Thomas S. Ricketts last in the world series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.04jf15w .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1908 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1992 Summer Olympics: m.0l6m5 | type.object : type | people.deceased_person : cause_of_death, place_of_death | music.genre : albums | people.person : religion, children, profession, nationality, parents, spouse_s, height_meters, gender | influence.influence_node : influenced_by, influenced | biology.animal_breed : place_of_origin | sports.sports_team : championships | sports.sports_championship_event : champion | government.government_office_category : officeholders | government.government_position_held : office_holder, from | people.marriage : spouse | location.location : nearby_airports, time_zones, people_born_here, contains, containedby | military.military_conflict : commanders | military.military_command : military_combatant | book.book : genre | common.topic : notable_types | time.event : start_date, instance_of_recurring_event, included_in_event | base.culturalevent.event : entity_involved | film.film_subject : films | olympics.olympic_host_city : olympics_hosted | religion.religion : notable_figures | government.governmental_body : members | government.politician : government_positions_held\n\n\nquestion:\n\nWhich airport service the city that hosted the 1992 olympics?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:olympics.olympic_host_city.olympics_hosted ns:m.0l6m5 .\n?c ns:location.location.nearby_airports ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barcelona–El Prat Airport"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPaul VI Catholic High School: m.02q2b51 | type.object : type | kg.object_profile : prominent_type | organization.organization : date_founded, leadership, founders, headquarters | business.business_operation : industry | organization.leadership : person | location.location : containedby | sports.sports_team : sport, founded, colors | people.person : place_of_birth | common.topic : notable_types | basketball.basketball_player : position_s | government.government_office_or_title : office_holders | government.government_position_held : office_holder, from | education.educational_institution : school_type, students_graduates, colors | education.education : student | government.governmental_body : members | government.politician : government_positions_held | people.deceased_person : cause_of_death\n\n\nquestion:\n\nThe person from Paul VI Catholic High School plays for whom?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.02q2b51 .\n?c ns:american_football.football_player.games ?y .\n?y ns:american_football.player_game_statistics.team ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Seattle Seahawks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nbangkok, thailand: m.0fn2g | travel.tourist_attraction : near_travel_destination | common.topic : notable_types | location.location : containedby | people.person : religion, profession, nationality, date_of_birth, place_of_birth | people.deceased_person : cause_of_death | type.object : type | architecture.structure : opened, height_meters | travel.travel_destination : tourist_attractions | media_common.netflix_title : netflix_genres | government.politician : government_positions_held | architecture.building : floors\n\n\nquestion:\n\nWhich zoo opened in 1940 and can be visited on a day outing to Bangkok?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0fn2g ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Safari World"
    }
]