[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAleksandar Vučić: m.03c2h_t | Country: m.01mp | Romania: m.06c1y | location.location : adjoin_s, contains, partially_contains | common.topic : notable_types | government.government_office_category : officeholders | government.government_position_held : office_holder | location.adjoining_relationship : adjoins | people.person : gender | type.object : name, type | government.governmental_jurisdiction : governing_officials | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.country : form_of_government | religion.religious_leadership_jurisdiction : leader | religion.religious_organization_leadership : leader\n\n\nquestion:\n\nWhat country borders Romania and appointed Aleksandar VuÄiÄ to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06c1y ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.03c2h_t .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Serbia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLou Seal: m.03_dwn | location.location : containedby, events, contains, people_born_here | type.object : type | sports.sports_team : team_mascot, arena_stadium | architecture.structure : opened, construction_started | baseball.baseball_player : position_s | people.person : children, profession, nationality, ethnicity, date_of_birth, place_of_birth, gender | periodicals.newspaper_circulation_area : newspapers | kg.object_profile : prominent_type | location.place_with_neighborhoods : neighborhoods | time.event : start_date, locations | sports.professional_sports_team : owner_s | sports.sports_championship_event : championship, champion, runner_up | film.film_subject : films | government.political_district : representatives | government.government_position_held : office_holder | film.film_location : featured_in_films\n\n\nquestion:\n\nThe team with the mascot Lou Seal plays baseball where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.03_dwn .\n?c ns:sports.sports_team.arena_stadium ?x .\n?x ns:architecture.structure.opened ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "AT&T Park"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAustralian external territory: m.02_8yfs | James Francis: m.063_19 | Australian Territory: m.02xhc4k | Australian State: m.02xhc47 | Australia: m.0chghy | government.government_office_category : officeholders | government.government_position_held : basic_title, office_holder | government.politician : government_positions_held | location.location : contains, people_born_here | government.political_appointer : appointees | location.statistical_region : places_imported_from | location.imports_and_exports : imported_from | government.governmental_jurisdiction : governing_officials | government.political_district : representatives | type.object : type | location.country : languages_spoken | organization.organization_founder : organizations_founded | religion.religion : notable_figures\n\n\nquestion:\n\nWhat Australian territory appointed James Francis to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0chghy ns:location.country.administrative_divisions ?x .\n?x ns:common.topic.notable_types ns:m.02xhc47 .  #australian state\n}\nUNION\n{\nns:m.0chghy ns:location.country.administrative_divisions ?x .\n?x ns:common.topic.notable_types ns:m.02_8yfs .  #australian external territory\n}\nUNION\n{\nns:m.0chghy ns:location.country.administrative_divisions ?x .\n?x ns:common.topic.notable_types ns:m.02xhc4k .  #australian territory\n}?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.063_19 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Victoria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nbasque: m.017k6 | CFP franc: m.01qyjx | location.location : events, adjoin_s, people_born_here, contains, partially_contains | government.governmental_jurisdiction : government_bodies, governing_officials | location.country : internet_tld, languages_spoken, currency_used, administrative_divisions | location.adjoining_relationship : adjoins | government.government_position_held : office_holder, appointed_by | military.military_combatant : casualties | military.casualties : military_conflict | media_common.netflix_genre : titles | language.human_language : countries_spoken_in | finance.currency : countries_used | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat European community country use to have a currency named CFP franc?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.017k6 ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.currency_used ns:m.01qyjx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\npeoples republic of china: m.0d05w3 | Lao kip: m.04k4j1 | location.location : adjoin_s, contains | finance.currency : countries_used | location.adjoining_relationship : adjoins | location.country : currency_used, administrative_divisions\n\n\nquestion:\n\nWhat country that uses the Lao Kip currency borders China?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d05w3 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:location.country.currency_used ns:m.04k4j1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Laos"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRooney family: m.03nrwfz | Super bowl: m.01xljv1 | sports.sports_team_owner : teams_owned | time.event : end_date, start_date, locations, instance_of_recurring_event | common.topic : notable_types | sports.sports_team : colors, fight_song, team_mascot, location, venue, championships, roster | sports.sports_team_roster : player, position | american_football.football_team : historical_coaching_staff | american_football.football_historical_coach_position : coach | sports.professional_sports_team : owner_s | people.family : members | sports.sports_championship_event : championship, champion, runner_up | type.object : type | sports.team_venue_relationship : venue\n\n\nquestion:\n\nWhich was the last Super Bowl won by the team owned by the Rooney family?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.03nrwfz .\n?c ns:sports.sports_team.championships ?x .\n?x ns:common.topic.notable_types ns:m.01xljv1 .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XLIII"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWest African CFA franc: m.025sw2q | Niger River: m.05csx | Country: m.01mp | Sahel: m.0l5_l | location.location : containedby, events, people_born_here, partially_containedby, contains, partially_contains | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.country : official_language, currency_used, administrative_divisions | location.statistical_region : major_exports, size_of_armed_forces, co2_emissions_per_capita | type.object : name, type | geography.river : cities | measurement_unit.dated_integer : number | finance.currency : countries_used | location.imports_exports_by_industry : industry | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhat country in the Sahel does the Niger River flow through that uses the West African CFA franc as their currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05csx ns:location.location.partially_containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.partially_contains ns:m.0l5_l .\n?x ns:location.country.currency_used ns:m.025sw2q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mali, Niger"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nharry truman: m.09bg4l | UMKC Kangaroos men's basketball: m.02pkpvh | people.person : religion, quotations, profession, education, height_meters, gender | government.political_appointer : appointees | government.government_position_held : district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to | award.award_nominee : award_nominations | award.award_nomination : award, nominated_for | education.educational_institution : mascot, students_graduates, colors | education.education : institution, student, degree | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | government.us_vice_president : vice_president_number | government.politician : government_positions_held | type.object : type | people.deceased_person : date_of_death, place_of_death | government.us_president : presidency_number | organization.organization : date_founded | location.location : containedby | sports.sports_team : colors | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhich university with men's basketball sports team named UMKC Kangaroos did Harry S. Truman go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09bg4l ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.02pkpvh .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "University of Missouri–Kansas City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nchicago, illinois: m.01_d4 | Central Time Zone: m.02fqwt | location.location : area, time_zones, people_born_here, contains, containedby | travel.travel_destination : tourist_attractions | exhibitions.exhibition_venue : exhibitions_at_this_venue | exhibitions.exhibition_run : opened_on | type.object : type | organization.organization : spun_off_from | organization.organization_spin_off : parent_company\n\n\nquestion:\n\nWhat are some attractions to visit in Downtown Chicago that are situated in the Central Time zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.containedby ns:m.01_d4 .\n?x ns:location.location.time_zones ns:m.02fqwt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Adler Planetarium, Field Museum of Natural History"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBookkeeping: m.01h5g | people.person : spouse_s, gender | people.marriage : spouse | language.language_family : languages | language.human_language : language_family, main_country, countries_spoken_in | type.object : type | kg.object_profile : prominent_type | film.film_genre : films_in_this_genre | time.event : included_in_event | religion.religion : beliefs, holidays | music.genre : albums | media_common.netflix_genre : titles | common.topic : notable_types | book.book_subject : works | location.country : official_language | book.written_work : author | interests.hobby : people_with_this_hobby\n\n\nquestion:\n\nWhat company did people with bookkeeping degree work for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.major_field_of_study ns:m.01h5g .\n?c ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Henry Ford Company, Ford Motor Company, Detroit Dry Dock Co, James F. Flower & Bros, Edison Illuminating Company"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nState Elementary School Menteng 01: m.0280qps | bachelor of arts degree: m.014mlp | type.object : type | government.government_office_category : officeholders | government.government_position_held : office_holder, office_position_or_title, from, jurisdiction_of_office, appointed_by, governmental_body | people.person : religion, profession, nationality, education, place_of_birth | religion.religion : notable_figures | government.politician : government_positions_held, party | government.political_party_tenure : party | education.education : institution, degree | location.location : containedby, people_born_here | common.topic : notable_types | people.deceased_person : place_of_burial | government.governmental_body : members | award.award_category : winners, date_established | award.award_honor : award_winner | kg.object_profile : prominent_type | organization.organization : date_founded | film.film_subject : films | travel.travel_destination : tourist_attractions | government.governmental_jurisdiction : governing_officials | book.book_edition : publication_date | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | book.written_work : date_of_first_publication\n\n\nquestion:\n\nWhich academic institution awarded a bachelor's degree to a person who attended State Elementary School Menteng 01?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0280qps .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?y ns:education.education.degree ns:m.014mlp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Columbia University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDe divina proportione: m.06pqb_7 | common.topic : notable_types | book.written_work : subjects, date_of_first_publication, author | book.book : genre | law.invention : inventor | type.object : type | visual_art.visual_artist : associated_periods_or_movements | book.illustrator : books_illustrated\n\n\nquestion:\n\nWhich style of art was used by the illustrator of the of the De DIvina book a part of?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:book.illustrator.books_illustrated ns:m.06pqb_7 .\n?c ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Pastel Art, High Renaissance"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Internationale: m.01nrft | World War II: m.081pw | base.culturalevent.event : entity_involved | people.person : religion, profession, nationality, gender | influence.influence_node : influenced | time.event : locations, start_date, end_date, includes_event, included_in_event | language.human_language : countries_spoken_in | people.deceased_person : cause_of_death, place_of_death | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, to | type.object : type | military.military_conflict : commanders, casualties | military.casualties : lower_estimate | military.military_person : participated_in_conflicts | book.book_subject : works | government.government_office_category : officeholders | government.form_of_government : countries | common.topic : notable_types | location.location : events | government.politician : government_positions_held | military.military_command : military_combatant, military_commander\n\n\nquestion:\n\nWhat country's national anthem during World War II was The Internationale Leader?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01nrft .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?x ns:military.military_person.participated_in_conflicts ns:m.081pw .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nikita Khrushchev, Leonid Brezhnev"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLand der Berge, Land am Strome: m.019vwj | people.person : religion, profession, nationality, parents, place_of_birth, gender | type.object : type | location.location : partially_containedby, contains, containedby | people.deceased_person : cause_of_death, place_of_death | music.artist : label | government.government_office_or_title : office_holders | government.government_position_held : office_holder, governmental_body | location.country : languages_spoken | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : speech_topic | geography.river : basin_countries | common.topic : notable_types | government.politician : government_positions_held | media_common.netflix_title : netflix_genres | american_football.football_player : position_s\n\n\nquestion:\n\nWhat are the languages used for communication in the nation where the national anthem is Land der Berge, Land am Strome?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.019vwj .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bavarian Language, Bosnian language, Turkish Language, Hungarian, German Language, Slovene language, Serbian language, Croatian language, Austrian German"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHatikvah: m.019_d2 | people.person : religion, profession, nationality, ethnicity, place_of_birth, gender | type.object : type | people.deceased_person : cause_of_death, place_of_death | location.location : partially_containedby, contains, containedby | government.politician : government_positions_held | government.government_position_held : office_holder, jurisdiction_of_office | government.government_office_or_title : office_holders | architecture.structure : opened, height_meters | film.film : country | location.country : official_language | kg.object_profile : prominent_type | common.topic : notable_types | government.governmental_body : members | finance.currency : countries_formerly_used | government.governmental_jurisdiction : governing_officials | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nWhat is the primary languages used in the country with national anthem Hakvah?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.019_d2 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hebrew Language, Arabic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAntai-ji: m.0792rl | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type | religion.religion : places_of_worship, texts | geography.river : mouth\n\n\nquestion:\n\nThe Antai-ji holy book is used at what religious place?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.places_of_worship ns:m.0792rl .\n?c ns:religion.religion.texts ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Pāli Canon, Dhammapada, Mahāyāna sūtras, Vimalakirti Sutra, Tibetan Buddhist canon, Chinese Buddhist canon, Śrīmālādevī Siṃhanāda Sūtra, Mahāvastu, Amitabha Sutra, Āgama, Gangōji Garan Engi, Uṣṇīṣa Vijaya Dhāraṇī Sūtra, Longchen Nyingthig, Nīlakaṇṭha Dhāraṇī"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNurse George: m.09vv08g | Carl Fredricksen: m.0b6mg3l | location.statistical_region : population, size_of_armed_forces | measurement_unit.dated_integer : number | media_common.netflix_genre : titles | people.person : gender | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.location : contains, people_born_here | film.film : starring | film.performance : character, special_performance_type, actor, film | kg.object_profile : prominent_type | film.music_contributor : film | film.film_genre : films_in_this_genre | film.film_character : portrayed_in_films | film.writer : film | film.actor : film | film.film_story_contributor : film_story_credits | organization.organization : founders | book.book_subject : works\n\n\nquestion:\n\nWho portrayed Carl Fredricksen in the movie with another character called Nurse George?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.09vv08g .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0b6mg3l .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ed Asner, Jeremy Leary"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSeven Nation Army: m.07fpnw | award.award_nominated_work : award_nominations | type.object : type | location.location : people_born_here | book.book : genre | film.film : language, produced_by, release_date_s, film_set_decoration_by, edited_by, featured_film_locations, production_companies, country, genre, starring | sports.sports_team : fight_song, arena_stadium | film.performance : actor | sports.sports_league_draft_pick : player | film.film_regional_release_date : release_date | book.written_work : subjects, date_of_first_publication, copyright_date | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : height_meters | tv.tv_program : regular_cast, air_date_of_first_episode | tv.regular_tv_appearance : character | american_football.football_player : position_s | media_common.netflix_title : netflix_genres | people.person : profession\n\n\nquestion:\n\nWhere does the team whose fight song is \"Seven Nation Army\" play?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.07fpnw .\n?c ns:sports.sports_team.arena_stadium ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "M&T Bank Stadium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnwar Sadat: m.0d58h | people.person : religion, profession, nationality, parents, date_of_birth, height_meters, place_of_birth, gender | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.politician : government_positions_held | type.object : type | government.government_position_held : governmental_body, office_position_or_title, to, jurisdiction_of_office | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | common.topic : notable_types | kg.object_profile : prominent_type | music.group_member : membership | music.group_membership : role | music.artist : genre | location.country : currency_used\n\n\nquestion:\n\nThe location that appointed Anwar Sadat to govermental position uses what kind of money?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0d58h .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Egyptian pound"
    }
]