[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWarpaint: m.0gwvc_ | location.location : time_zones, people_born_here, contains, containedby | type.object : type | sports.sports_championship_event : champion, runner_up | organization.organization : leadership, founders | organization.leadership : person, role | common.topic : notable_types | location.place_with_neighborhoods : neighborhoods | people.person : date_of_birth, profession, nationality, gender | sports.sports_team : team_mascot, colors, roster, location | time.event : end_date | kg.object_profile : prominent_type | travel.travel_destination : tourist_attractions | symbols.name_source : namesakes | sports.sports_team_roster : player, position | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : career_end | american_football.football_player : position_s | film.film_subject : films | sports.sports_team_owner : teams_owned\n\n\nquestion:\n\nFrom what City is the team with a mascot named Warpaint?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.0gwvc_ .\n?c ns:sports.sports_team.location ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kansas City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDržavna himna Bosne i Hercegovine: m.01l87x | kg.object_profile : prominent_type | government.form_of_government : countries | type.object : type | common.topic : notable_types | location.location : area, time_zones, people_born_here, partially_containedby, contains, containedby | people.person : date_of_birth, nationality, place_of_birth, gender | location.country : languages_spoken | government.government_office_category : officeholders | government.government_position_held : office_holder, from | architecture.structure : opened | government.politician : government_positions_held | geography.river : mouth\n\n\nquestion:\n\nThe nation whose national anthem is Drzavna himna Bosne i Hercegovine uses which languages for communication?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01l87x .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Serbo-Croatian Language, Serbian language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSydney: m.06y57 | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | location.location : contains, containedby | people.deceased_person : cause_of_death, place_of_death | type.object : type | government.politician : government_positions_held | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, to, jurisdiction_of_office | travel.travel_destination : tourist_attractions | military.military_person : participated_in_conflicts\n\n\nquestion:\n\nWhat is a place to travel around Sydney and a zoo that opened after 1972?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06y57 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wild Life Sydney"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGeorges Pompidou: m.01lbpj | Country: m.01mp | Spain: m.06mkj | location.location : events, contains, people_born_here | government.government_office_category : officeholders | government.government_position_held : basic_title, office_holder, appointed_by | government.governmental_jurisdiction : governing_officials | type.object : name | common.topic : notable_types | people.person : religion | location.country : languages_spoken\n\n\nquestion:\n\nThe location that appointed Georges Pompidou to govermental position and is in what country that surrounds Spain?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mkj ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.01lbpj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrabançonne: m.098tx | location.location : time_zones, contains, containedby | type.object : type | people.person : religion, profession, nationality, parents, date_of_birth, place_of_birth, gender | people.deceased_person : cause_of_death, place_of_death | military.military_conflict : force_strengths | military.force_strength : force_size | common.topic : notable_types | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.form_of_government : countries | government.politician : government_positions_held | government.government_position_held : office_holder, office_position_or_title, jurisdiction_of_office | government.government_office_category : officeholders | geography.river : cities | location.country : capital | time.event : included_in_event | geography.mountain : elevation | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhich city is located in the country whose national anthem is Brabanconne?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.098tx .\n?c ns:location.country.capital ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brussels"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMasjid Hamza, Valley Stream: m.0pc5qwj | location.location : time_zones, area, contains, containedby | religion.religion : deities, types_of_places_of_worship | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | architecture.structure : opened | location.country : form_of_government\n\n\nquestion:\n\nThe people from Masjid Hamza, Valley Stream places of worship pray to whom?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.types_of_places_of_worship ns:m.0pc5qwj .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ramdev Pir, God, Allah"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJohn Mara: m.094w0s | Tom Landry: m.019_p3 | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.person : parents | sports.professional_sports_team : owner_s | location.statistical_region : cpi_inflation_rate, co2_emissions_per_capita, gdp_real | location.country : second_level_divisions | measurement_unit.adjusted_money_value : adjusted_value | sports.sports_team : colors | american_football.football_player : position_s | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nWhat team owned by New York Giants did Tom Landry play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.019_p3 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.094w0s .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York Giants"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSt. Mary's Cathedral, Batticaloa: m.0100k8_q | Madonna: m.01vs_v8 | type.object : type | film.actor : film | film.performance : character, film | religion.religion : places_of_worship, types_of_places_of_worship, notable_figures, organizations, texts, beliefs, founding_figures | people.person : religion, quotations, profession, place_of_birth, gender | music.artist : genre, label, origin, concert_tours | award.award_nominee : award_nominations | award.award_nomination : nominated_for | common.topic : notable_types | kg.object_profile : prominent_type | music.composer : compositions | music.group_member : instruments_played | music.featured_artist : recordings | influence.influence_node : influenced | film.writer : film | film.film_subject : films\n\n\nquestion:\n\nWhat religion practiced by Madonna has a place of worship named St. Mary's Cathedral, Batticaloa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01vs_v8 ns:people.person.religion ?x .\n?x ns:religion.religion.places_of_worship ns:m.0100k8_q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTahiti: m.0hb6g | CFP franc: m.01qyjx | geography.island : island_group, body_of_water | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | measurement_unit.dated_percentage : rate | location.location : containedby | location.country : currency_formerly_used, currency_used, administrative_divisions, official_language, capital | kg.object_profile : prominent_type | location.statistical_region : co2_emissions_per_capita | finance.currency : countries_used | geography.geographical_feature : category | food.beer_country_region : beers_from_here\n\n\nquestion:\n\nWhat region uses the CFP franc as currency and inlcudes Tahiti Bora Bora as a location?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hb6g ns:location.location.containedby ?x .\n?x ns:location.country.currency_used ns:m.01qyjx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "French Polynesia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCharles D. Denson: m.03wv1t1 | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | government.politician : government_positions_held | type.object : type | organization.organization : headquarters | government.government_position_held : basic_title, to, jurisdiction_of_office | military.military_person : participated_in_conflicts | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : cause_of_death, date_of_death, place_of_death | kg.object_profile : prominent_type | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhat country is the headquarters of the organization led by Charles D. Denson?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.03wv1t1 .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.country ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United States of America"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1960 Summer Olympics: m.0lbd9 | Airport: m.01xpjyz | location.location : nearby_airports, events, time_zones, people_born_here, contains, containedby | influence.influence_node : peers | influence.peer_relationship : peers | common.topic : notable_types | government.political_district : representatives | government.government_position_held : office_holder, from | location.statistical_region : co2_emissions_per_capita, gdp_real | measurement_unit.adjusted_money_value : adjusted_value | time.event : instance_of_recurring_event | type.object : type | aviation.airline : airports_served | aviation.airline_airport_presence : cities_served | government.governmental_jurisdiction : governing_officials | olympics.olympic_host_city : olympics_hosted | aviation.airport : hub_for | government.political_appointer : appointees\n\n\nquestion:\n\nWhich airport serves the city that hosted the 1960 Summer Olympics?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:olympics.olympic_host_city.olympics_hosted ns:m.0lbd9 .\n?c ns:travel.travel_destination.how_to_get_here ?y .\n?y ns:travel.transportation.transport_terminus ?x .\n?x ns:common.topic.notable_types ns:m.01xpjyz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leonardo da Vinci–Fiumicino Airport, Ciampino–G. B. Pastine International Airport"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDodoma: m.0fnbn | s. africa: m.0hzlz | location.location : people_born_here, adjoin_s, containedby | location.country : iso_alpha_3, capital, languages_spoken | type.object : type | common.topic : notable_types | people.person : profession, nationality, place_of_birth, gender | location.adjoining_relationship : adjoins | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita, places_exported_to | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, jurisdiction_of_office | kg.object_profile : prominent_type | measurement_unit.dated_metric_ton : number | location.imports_and_exports : exported_to | government.politician : government_positions_held\n\n\nquestion:\n\nWhat does South Africa Trade with that has Dodoma as it's capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0hzlz ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.0hzlz ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.country.capital ns:m.0fnbn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tanzania"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1342 Lexington Avenue: m.0ghw4jy | type.object : type | location.location : time_zones, contains, containedby | visual_art.visual_artist : associated_periods_or_movements | common.topic : notable_types | kg.object_profile : prominent_type | organization.organization : date_founded | architecture.structure : height_meters | government.political_district : representatives | government.government_position_held : office_holder\n\n\nquestion:\n\nWhat type of art was created by the person who once resided at 1342 Lexington Avenue?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.0ghw4jy .\n?c ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Modern art, Pop art"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNigerian naira: m.018cg3 | location.country : currency_used, form_of_government | location.location : time_zones, area, containedby | type.object : type | film.film_location : featured_in_films | government.government_office_category : officeholders | government.government_position_held : office_holder, office_position_or_title | people.person : profession, nationality, height_meters, place_of_birth, gender | government.politician : government_positions_held | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat is the type of government where the Nigerian naira is used?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.018cg3 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Federal republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGrinch: m.025s4pv | Ron Howard: m.0g2lq | film.film : produced_by, language, runtime, release_date_s, story_by, edited_by, music, film_casting_director, costume_design_by, country, genre, directed_by | film.film_regional_release_date : film_release_distribution_medium, release_date | film.producer : film | film.actor : dubbing_performances, film | film.performance : character, actor, film | film.film_cut : runtime | film.director : film | people.person : profession, nationality | fictional_universe.fictional_character : character_created_by, gender | media_common.netflix_title : netflix_genres | type.object : type | film.film_character : portrayed_in_films | film.dubbing_performance : character | film.writer : film\n\n\nquestion:\n\nWhat filmed with a character named the Grinch did Ron Howard direct?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0g2lq ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.directed_by ns:m.0g2lq .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.025s4pv .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dr. Seuss' How the Grinch Stole Christmas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJeff Hornacek: m.03bmvc | Steve Nash: m.01yqrk | sports.pro_athlete : teams, career_start, career_end | basketball.basketball_player : player_statistics, position_s | sports.sports_team_roster : player, team, position | people.person : profession, nationality, height_meters, place_of_birth, gender | sports.sports_team : arena_stadium, founded, location, team_mascot, sport, roster | type.object : type | basketball.basketball_player_stats : team | common.topic : notable_types | kg.object_profile : prominent_type | basketball.basketball_team : head_coach\n\n\nquestion:\n\nWhat basketball team with head coach Jeff Hornacek did Steve Nash play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01yqrk ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:basketball.basketball_team.head_coach ns:m.03bmvc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Phoenix Suns"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWilliam O. Schaefer Elementary School: m.076dzmh | type.object : type | location.location : containedby | organization.organization : date_founded, parent | film.director : film | business.business_operation : industry | sports.sports_team : sport, colors | education.educational_institution : school_type, colors | organization.organization_relationship : parent | kg.object_profile : prominent_type | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | award.award_winner : awards_won | award.award_honor : award\n\n\nquestion:\n\nWhat movies were directed by the notable person who was educated at William O. Schaefer Elementary School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.076dzmh .\n?c ns:film.director.film ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "By the Sea, In the Land of Blood and Honey, A Place in Time, Unbroken"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBalochistan, Pakistan: m.01hf6 | type.object : type | common.topic : notable_types | location.location : time_zones, area, containedby | kg.object_profile : prominent_type | people.person : religion | government.politician : government_positions_held | government.government_position_held : basic_title | geography.geographical_feature : category | location.mailing_address : citytown | location.country : official_language, administrative_divisions\n\n\nquestion:\n\nWhat languages are used in the country where Balochistan, Pakistan is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hf6 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language, Urdu Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLupang Hinirang: m.0jkdr | people.person : religion, profession, nationality, gender | type.object : type | time.event : locations | architecture.structure : height_meters | language.human_language : countries_spoken_in | sports.pro_athlete : career_start | influence.influence_node : influenced_by | government.politician : government_positions_held | government.government_position_held : office_holder, office_position_or_title, governmental_body | location.location : containedby, contains, people_born_here | meteorology.tropical_cyclone : affected_areas | people.deceased_person : cause_of_death, place_of_death | kg.object_profile : prominent_type | location.country : form_of_government | common.topic : notable_types | government.government_office_category : officeholders | book.written_work : subjects | film.film : language | government.political_appointer : appointees\n\n\nquestion:\n\nWhat form of government used in the country with national anthem Lupang Hinirang?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.0jkdr .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Unitary state, Republic, Constitutional republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSanjay Gupta: m.02yyk6 | Michigan Wolverines baseball: m.04ct8_g | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | location.location : time_zones, containedby | type.object : type | government.politician : government_positions_held, party | sports.sports_team : fight_song, founded, colors | organization.organization : spin_offs, date_founded, founders | organization.organization_spin_off : child_company | people.person : religion, profession, nationality, education, height_meters, gender | sports.school_sports_team : school | education.education : institution, student, degree | education.educational_institution : school_type, colors, newspaper, sports_teams, students_graduates | common.topic : notable_types | kg.object_profile : prominent_type | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | medicine.cancer_center_constituent : cancer_center | government.political_party_tenure : party\n\n\nquestion:\n\nWhat college with Michigan Wolverines baseball team did Sanjay Gupta attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02yyk6 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.04ct8_g .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Michigan"
    }
]