[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBelieve Tour: m.0j_3p6t | kg.object_profile : prominent_type | music.composition : composer | film.film_character : portrayed_in_films | film.performance : film | type.object : type | media_common.netflix_genre : titles | location.location : time_zones, contains, people_born_here | music.genre : albums | time.event : end_date, start_date | people.deceased_person : date_of_death, place_of_death | location.statistical_region : population, religions, co2_emissions_per_capita, gdp_real | film.film : film_production_design_by, release_date_s | film.film_regional_release_date : release_date | government.governmental_jurisdiction : government_bodies, government, governing_officials | music.artist : concert_tours | common.topic : notable_types | people.person : place_of_birth | government.politician : government_positions_held | measurement_unit.dated_integer : number | award.award_nominated_work : award_nominations | media_common.netflix_title : netflix_genres | government.government_position_held : office_holder, jurisdiction_of_office | measurement_unit.adjusted_money_value : adjusted_value | award.award_category : date_established | location.religion_percentage : religion | music.album : release_date\n\n\nquestion:\n\nThe artist who had a concert tour named Believe Tour uses what type of instrument?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0j_3p6t .\n?c ns:music.group_member.membership ?y .\n?y ns:music.group_membership.role ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Vocals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Santa Clara: m.0f4t11 | location.location : events, time_zones, people_born_here, contains, containedby | common.topic : notable_types | sports.sports_team_location : teams | book.newspaper : owner | symbols.namesake : named_after | type.object : type | education.educational_institution : sports_teams, newspaper, colors | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.hud_county_place : county | organization.organization : child, date_founded, founders | organization.organization_relationship : child | periodicals.newspaper_circulation_area : newspapers\n\n\nquestion:\n\nIt what city and state is the university that publishes the newspaper titled Santa Clara?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.newspaper ns:m.0f4t11 .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "California, United States of America, Santa Clara"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLouis XVI of France: m.0dj9w | symbols.name_source : namesakes | people.person : religion, children, nationality, parents, place_of_birth, gender | government.government_office_or_title : office_holders | government.government_position_held : office_holder, from | royalty.noble_person : titles | royalty.noble_title_tenure : noble_title | common.topic : notable_types\n\n\nquestion:\n\nWho was Louis XVI that held the position form 6-2-1952?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0dj9w ns:royalty.noble_person.titles ?y .\n?y ns:royalty.noble_title_tenure.noble_title ?x .\n?x ns:government.government_office_or_title.office_holders ?c .\n?c ns:government.government_position_held.from \"1952-02-06\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Duke of Normandy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBasketball: m.018w8 | Shaquille O'Neal: m.012xdf | Micky Arison: m.027f6w | location.location : contains, people_born_here | sports.pro_athlete : teams | sports.sports_team_roster : team, position | media_common.netflix_genre : titles | government.governmental_jurisdiction : governing_officials | sports.professional_sports_team : draft_picks, owner_s | sports.sports_league_draft_pick : player | sports.sports_team : location, sport, colors, roster | government.government_position_held : office_holder | media_common.netflix_title : netflix_genres | organization.organization : leadership | organization.leadership : person | type.object : type | film.film : starring | film.performance : actor | people.person : ethnicity\n\n\nquestion:\n\nWhat basketball team owned by Micky Arison did Shaq play on?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.sport ns:m.018w8 .\n?x ns:sports.professional_sports_team.owner_s ns:m.027f6w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Miami Heat"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSir Purr: m.03lr5s | sports.sports_team_location : teams | type.object : type | sports.sports_championship_event : runner_up | location.location : containedby, contains, people_born_here | people.person : profession, nationality, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | time.event : end_date, start_date, locations | film.film_subject : films | sports.sports_facility : teams | kg.object_profile : prominent_type | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from | location.place_with_neighborhoods : neighborhoods | sports.sports_team : team_mascot, colors, championships, coaches | sports.sports_team_coach_tenure : coach | travel.travel_destination : tourist_attractions | american_football.football_team : current_head_coach | common.topic : notable_types\n\n\nquestion:\n\nTeam mascot named Sir Purr is part of the team coached by whom?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.03lr5s .\n?c ns:american_football.football_team.current_head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ron Rivera"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | The Daily Free Press: m.09412d | Martin Luther King, Jr.: m.051cc | location.location : containedby | organization.organization : headquarters, date_founded | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : speech_topic, event | type.object : type | education.educational_institution : school_type, newspaper, colors | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | people.person : quotations, children, profession, parents, ethnicity, education, spouse_s, place_of_birth | education.education : institution, major_field_of_study, degree | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | base.activism.activist : area_of_activism | broadcast.radio_station_owner : radio_stations | people.marriage : spouse | influence.influence_node : influenced_by | kg.object_profile : prominent_type | film.film_subject : films | symbols.name_source : namesakes | music.featured_artist : recordings | people.deceased_person : place_of_burial | fictional_universe.school_in_fiction : students_graduates | organization.organization_founder : organizations_founded | award.award_nominee : award_nominations | award.award_nomination : nominated_for | award.award_winner : awards_won | award.award_honor : award | common.topic : notable_types\n\n\nquestion:\n\nWhat college did Martin Luther King attend that publishes the Daily Free Press?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.051cc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.newspaper ns:m.09412d .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGovernor: m.0fkvn | Puerto Rico: m.05r7t | government.government_position_held : office_holder, basic_title, jurisdiction_of_office, appointed_by, to | government.government_office_category : officeholders | government.politician : government_positions_held | government.governmental_jurisdiction : governing_officials | people.person : profession | type.object : type\n\n\nquestion:\n\nWhat winner of the Puerto Rican governor election held position from after January 2, 2009?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05r7t ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.0fkvn .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Alejandro García Padilla"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational anthem of South Africa: m.07lzg | common.topic : notable_types | people.person : profession, nationality, gender | type.object : type | time.time_zone : locations_in_this_time_zone | location.location : people_born_here, contains, containedby | finance.currency : countries_used | government.politician : government_positions_held | government.government_position_held : governmental_body, office_holder, jurisdiction_of_office | location.country : form_of_government | government.governmental_body : members | language.human_language : main_country, countries_spoken_in | government.government_office_or_title : office_holders | government.government_office_category : officeholders | film.film : featured_film_locations | architecture.building : floors | kg.object_profile : prominent_type | people.deceased_person : date_of_death\n\n\nquestion:\n\nWhich political system does the country utilize, that has the  National anthem of South Africa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.07lzg .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Constitutional republic, Parliamentary republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1964 World Series: m.045_79 | Albert Pujols: m.035gcb | sports.pro_athlete : teams | sports.sports_team_roster : player, team, position | sports.sports_award_winner : awards | baseball.baseball_team : current_manager, current_coaches | baseball.current_coaching_tenure : baseball_coach | people.person : education, nationality, place_of_birth, gender | education.education : institution | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, championships, roster | baseball.baseball_player : position_s | type.object : type | time.event : end_date, start_date | sports.sports_championship_event : championship, champion, runner_up | kg.object_profile : prominent_type | common.topic : notable_types | award.award_nominee : award_nominations | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nWhat team did Pujols play for that won the 1964 World Series Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.035gcb ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.045_79 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "St. Louis Cardinals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Abkhazia: m.011jw | Country: m.01mp | location.location : partially_contains, adjoin_s, people_born_here, contains, containedby | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, office_position_or_title | type.object : name | government.government_office_category : officeholders | government.governmental_jurisdiction : governing_officials | location.country : capital, administrative_divisions, form_of_government | people.person : nationality | finance.currency : countries_used | time.time_zone : locations_in_this_time_zone | location.adjoining_relationship : adjoins | location.administrative_division : country | common.topic : notable_types\n\n\nquestion:\n\nAbkhazia is part of what country close to Russia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.011jw .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Georgia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Country: m.01mp | Mikheil Saakashvili: m.0212q2 | location.location : adjoin_s, contains, partially_contains | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | type.object : name | location.country : official_language, capital, languages_spoken | government.government_office_category : officeholders | government.government_position_held : office_position_or_title, office_holder, jurisdiction_of_office, governmental_body | government.politician : government_positions_held | location.adjoining_relationship : adjoins | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | film.film_subject : films\n\n\nquestion:\n\nWhat is the country close to Russia where Mikheil Saakashvii holds a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.0212q2 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Georgia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Vladimir Putin: m.08193 | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | common.topic : notable_types | type.object : type | people.deceased_person : cause_of_death, date_of_death, place_of_burial | american_football.football_player : position_s | government.politician : government_positions_held, party | government.political_party_tenure : party | government.government_position_held : basic_title, from, to, district_represented | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | location.location : containedby | film.film_story_contributor : film_story_credits | kg.object_profile : prominent_type\n\n\nquestion:\n\nThe location that appointed Vladimir Putin to govermental position is close to what countries?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.08193 .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belarus, Estonia, Finland, Kazakhstan, Latvia, Lithuania, Mongolia, Norway, North Korea, Poland, Ukraine, China, Georgia, Azerbaijan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKrasnodar Krai: m.02dw2c | President: m.060c4 | location.location : time_zones, contains, containedby | type.object : type | kg.object_profile : prominent_type | government.government_position_held : basic_title, office_holder | location.country : administrative_divisions | common.topic : notable_types | government.governmental_jurisdiction : governing_officials\n\n\nquestion:\n\nWhat was the first president of the country that has Karanodar Krai?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02dw2c .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\n?y ns:government.government_position_held.from ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boris Yeltsin"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEmsley A. Laney High School: m.07qymj | type.object : type | organization.organization : place_founded, headquarters, date_founded | common.topic : notable_types | education.educational_institution : colors | education.school : highest_grade_taught | location.location : containedby | film.film : starring | film.performance : actor | kg.object_profile : prominent_type | sports.sports_team : sport, founded | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | american_football.football_team : current_head_coach\n\n\nquestion:\n\nWhat year did the NBA player that went to Emsley A Laney High school got drafted?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.07qymj .\n?c ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1984 NBA draft"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNicolas Sarkozy: m.02ps9k | people.person : religion, children, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | government.government_position_held : governmental_body | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | location.country : languages_spoken | type.object : type | kg.object_profile : prominent_type | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.political_party_tenure : party | common.topic : notable_types | location.location : containedby\n\n\nquestion:\n\nWhat are the languages used for communication in the region where Nicolas Sarkozy was placed in a government post?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.02ps9k .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Basque Language, Catalan language, Provençal Language, Corsican Language, Tahitian Language, Franco-Provençal Language, Breton, Yeniche Language, Guianese Creole French Language, Esperanto Language, West Flemish, Gallo language, Antillean Creole French, Occitan language, French, Réunion Creole French Language, Alsatian dialect"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHoh River: m.039fqk | location.location : adjoin_s, people_born_here, partially_contained_by, partiallycontains, contains | location.partial_containment_relationship : partially_contained_by, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | location.country : second_level_divisions, administrative_divisions | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhich location is the Hoh River partially situated in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.039fqk .\n?c ns:base.usnationalparks.us_national_park.state ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThai National Anthem: m.01b8l3 | location.location : time_zones, containedby | type.object : type | architecture.structure : opened, height_meters | travel.tourist_attraction : near_travel_destination | kg.object_profile : prominent_type | people.person : religion, profession, nationality, place_of_birth, gender | common.topic : notable_types | government.government_office_or_title : office_holders | government.government_position_held : basic_title, office_holder, from | people.ethnicity : geographic_distribution | language.human_language : main_country, countries_spoken_in | people.deceased_person : place_of_death | sports.sports_team : location | book.newspaper : owner | symbols.namesake : named_after | media_common.netflix_title : netflix_genres | government.government : government_for | government.politician : government_positions_held | location.country : currency_used | religion.religion : sacred_sites | government.form_of_government : countries | film.film : featured_film_locations\n\n\nquestion:\n\nWhat currency is used where Thai National Anthem is the national anthem?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01b8l3 .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thai baht"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSurat Thani Province: m.018k_b | Country: m.01mp | Cambodia: m.01xbgx | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita, religions | measurement_unit.dated_metric_ton : number | location.location : adjoin_s, time_zones, people_born_here, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | type.object : name, type | location.adjoining_relationship : adjoins | biology.breed_origin : breeds_originating_here | location.country : administrative_divisions | measurement_unit.dated_integer : number | common.topic : notable_types | location.religion_percentage : religion\n\n\nquestion:\n\nWhich country that shares a border with Cambodia contains the Surat Thani Province?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01xbgx ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.018k_b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thailand"
    }
]