[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAshanti Region: m.06d0dr | location.location : time_zones, containedby | architecture.structure : opened, height_meters | type.object : type | common.topic : notable_types | travel.tourist_attraction : near_travel_destination | kg.object_profile : prominent_type | geography.river : discharge | location.country : official_language, administrative_divisions | tv.tv_location : tv_shows_filmed_here\n\n\nquestion:\n\nWhat spoken language is used in the country that has Ashanti Region?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.06d0dr .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCarlos Santana: m.01304j | Central Time Zone: m.02fqwt | location.location : time_zones, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | time.time_zone : locations_in_this_time_zone | location.statistical_region : population, co2_emissions_per_capita | measurement_unit.dated_integer : number | organization.organization_member : member_of | organization.organization_membership : organization | people.person : gender | common.topic : notable_types\n\n\nquestion:\n\nWhere does Carlos Santana live in the Central Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01304j ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:location.location.time_zones ns:m.02fqwt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jalisco"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMae Hong Son Province: m.01jb47 | location.location : area, time_zones, people_born_here, contains, containedby | location.country : administrative_divisions, languages_spoken | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | organization.organization : founders | architecture.structure : opened\n\n\nquestion:\n\nWhat languages are spoken in the country with Mae Hong Son Province?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01jb47 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lao Language, Khmer language, Akha Language, Mlabri Language, Hmong language, Saek language, Malay, Pattani Language, Vietnamese Language, Nyaw Language, Phu Thai language, Cham language, Mon Language, Thai Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaoyuan, Taiwan: m.03582r | type.object : type | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, area, containedby | common.topic : notable_types | location.country : official_language, administrative_divisions | architecture.structure : height_meters | organization.organization : date_founded\n\n\nquestion:\n\nWhat spoken language is used in the country that has Taoyuan, Taiwan?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03582r .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Standard Chinese"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Moscow: m.04swd | government.politician : government_positions_held | government.government_position_held : from | location.location : time_zones, people_born_here, partially_containedby, containedby | common.topic : notable_types | type.object : type | people.person : profession, place_of_birth, gender | architecture.structure : opened, height_meters | film.producer : film | location.country : administrative_divisions | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat are the neighboring countries to the country that contains Moscow?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.04swd .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belarus, Estonia, Finland, Kazakhstan, Latvia, Lithuania, Mongolia, Norway, North Korea, Poland, Ukraine, China, Georgia, Azerbaijan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJ.J. Abrams: m.01xndd | film.film : language, produced_by, subjects, release_date_s, edited_by, music, sequel, film_series, initial_release_date, starring, prequel, genre | type.object : type | people.person : religion, profession, parents, height_meters, place_of_birth, gender | film.producer : film | fictional_universe.fictional_character : occupation, gender | film.performance : character, actor | film.actor : film | film.director : film | film.writer : film | film.film_regional_release_date : film_release_distribution_medium, release_date | music.featured_artist : recordings | award.award_nominee : award_nominations | award.award_nomination : award, nominated_for | music.composer : compositions\n\n\nquestion:\n\nWhat movie did JJ Abrams direct with a character named Carol Marcus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01xndd ns:film.director.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:g.1n3dw0yqp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Star Trek Into Darkness"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFederal Reserve System: m.02xmb | type.object : type | government.political_appointer : appointees | government.government_position_held : basic_title, office_position_or_title, from, jurisdiction_of_office, appointed_by, to, governmental_body | people.person : religion, quotations, children, profession, education | government.politician : government_positions_held, party | government.political_party_tenure : party | organization.organization : date_founded, founders | organization.organization_founder : organizations_founded | education.education : institution | influence.influence_node : influenced_by, influenced | book.book_subject : works | symbols.name_source : namesakes | government.us_president : vice_president | people.deceased_person : date_of_death\n\n\nquestion:\n\nWho founded the Federal Reserve Board and held his position in the government beginning 1929-01-01?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02xmb ns:organization.organization.founders ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Franklin D. Roosevelt"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | Yale University Handsome Dan: m.05ty1h | James Franco: m.05bnp0 | common.topic : notable_types | type.object : type | people.person : education, profession | organization.organization : child, leadership, date_founded | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | film.writer : film | education.educational_institution : mascot, school_type, colors, sports_teams, students_graduates | location.location : containedby | kg.object_profile : prominent_type | periodicals.newspaper_circulation_area : newspapers | organization.leadership : person | education.education : institution, student | organization.organization_relationship : child | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | film.director : film\n\n\nquestion:\n\nWhat educational institution with mascot named Yale University Handsome Dan did James Franco go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05bnp0 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.mascot ns:m.05ty1h .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University Yale"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | William Morris: m.08304 | The Oxford Student: m.046h3s | influence.influence_node : peers, influenced_by, influenced | kg.object_profile : prominent_type | type.object : type | book.author : book_editions_published, works_written | architecture.architect : structures_designed | people.person : education, profession, nationality, gender | education.educational_institution : school_type, students_graduates, sports_teams, newspaper | education.education : institution, student | book.book_subject : works | influence.peer_relationship : peers | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | organization.organization : headquarters, founders | music.lyricist : lyrics_written | location.location : nearby_airports, containedby | common.topic : notable_types | government.politician : party | government.political_party_tenure : party | fictional_universe.school_in_fiction : students_graduates\n\n\nquestion:\n\nWhere did Gilliam Morris attend college, where the educational institution's newspaper is The Oxford Student?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.08304 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.newspaper ns:m.046h3s .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Oxford"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAustralian Eastern Time Zone: m.0y497_m | Sydney: m.06y57 | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title, governmental_body | location.location : time_zones, containedby, contains, people_born_here | time.time_zone : locations_in_this_time_zone | government.political_district : representatives | location.country : languages_spoken, administrative_divisions | travel.travel_destination : tourist_attractions | type.object : type | common.topic : notable_types | amusement_parks.park : opened\n\n\nquestion:\n\nWhat main tourist attractions in Australian and within the Eastern Time Zone can one visit around Sydney?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06y57 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.0y497_m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Port Jackson, Bondi Beach, Luna Park Sydney, Darling Harbour"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Athanasius of Alexandria: m.014kt | location.location : events, contains, people_born_here | location.country : administrative_divisions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | religion.religion : notable_figures, texts | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value | book.book_subject : works | type.object : type\n\n\nquestion:\n\nWhat is the most common religion with Athanasius of Alexandria in the Untied States?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.notable_figures ns:m.014kt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Christianity"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSão Nicolau: m.0100rkfm | Portuguese Language: m.05zjd | language.human_language : iso_639_1_code, countries_spoken_in | location.location : events, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.statistical_region : foreign_direct_investment_net_inflows, co2_emissions_per_capita | location.country : official_language, languages_spoken, administrative_divisions, form_of_government | kg.object_profile : prominent_type | type.object : type | measurement_unit.dated_money_value : amount\n\n\nquestion:\n\nWhich nation in which Sao Nicolau can be found uses Portuguese as its language for communication?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05zjd ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.administrative_divisions ns:m.0100rkfm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Cape Verde"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHail to the Redskins: m.0234px | location.location : contains, people_born_here | sports.sports_championship_event : championship, champion, runner_up | film.film_subject : films | kg.object_profile : prominent_type | people.person : children, profession, gender | type.object : type | sports.sports_team : fight_song, sport, location | sports.sports_facility : teams | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : appointed_by | sports.pro_athlete : teams | sports.sports_team_roster : position | time.event : end_date | architecture.venue : capacity\n\n\nquestion:\n\nWhat area is the NFL team with the fight song \"Hail to the Redskins\" from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.0234px .\n?c ns:sports.sports_team.location ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington, D.C."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPhilip Anschutz: m.02fzwl | american_football.football_player : position_s | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport | kg.object_profile : prominent_type | type.object : type | sports.sports_team : championships | government.politician : government_positions_held, party | location.location : containedby | government.government_position_held : basic_title, governmental_body | common.topic : notable_types | people.deceased_person : place_of_burial, place_of_death | sports.professional_sports_team : owner_s | government.political_party_tenure : party\n\n\nquestion:\n\nWhat year did the team owned by Phillip Anschutz won the Stanley Cup?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.02fzwl .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2014 Stanley Cup Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2010 NBA Finals: m.0bx_x85 | Jerry Buss: m.03_6fp | location.country : second_level_divisions | location.location : contains, people_born_here | type.object : type | sports.professional_sports_team : owner_s | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | award.award_nominee : award_nominations | award.award_nomination : award | people.person : nationality | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat sports team owned by Jerry Buss that played in the NBA Finals in 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0bx_x85 ns:sports.sports_championship_event.champion ?x .\n}\nUNION\n{\nns:m.0bx_x85 ns:sports.sports_championship_event.runner_up ?x .\n}?x ns:sports.professional_sports_team.owner_s ns:m.03_6fp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Los Angeles Lakers"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBaghdad: m.01fqm | Gulf War: m.018w0j | location.location : time_zones, events, contains, people_born_here | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : basic_title, office_holder, appointed_by, governmental_body | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.country : administrative_divisions, national_anthem, official_language, capital, languages_spoken, form_of_government | type.object : type | common.topic : notable_types | time.event : locations | government.national_anthem_of_a_country : anthem | military.military_conflict : casualties | military.casualties : lower_estimate\n\n\nquestion:\n\nBaghdad is the capital of what country we were fighting in the Gulf War?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.018w0j ns:military.military_conflict.combatants ?y .\n?y ns:military.military_combatant_group.combatants ?x .\n?x ns:location.country.capital ns:m.01fqm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iraq"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWyc Grousbeck: m.0b7hk2 | 2010 NBA Finals: m.0bx_x85 | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | sports.sports_team : roster | sports.sports_team_roster : player | sports.professional_sports_team : owner_s | people.person : nationality | location.statistical_region : size_of_armed_forces, part_time_employment_percent | measurement_unit.dated_percentage : rate | location.country : second_level_divisions, administrative_divisions | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich team that appeared in the 2010 NBA Finals has who as its owner?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0bx_x85 ns:sports.sports_championship_event.champion ?x .\n}\nUNION\n{\nns:m.0bx_x85 ns:sports.sports_championship_event.runner_up ?x .\n}?x ns:sports.professional_sports_team.owner_s ns:m.0b7hk2 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston Celtics"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPresident of Technology: m.02_35z8 | location.location : people_born_here, partially_contains, contains, containedby | people.person : religion, profession, nationality, languages, place_of_birth | organization.organization : headquarters, founders, date_founded, parent | base.schemastaging.phone_sandbox : service_location | common.topic : notable_types | organization.organization_relationship : parent | location.statistical_region : co2_emissions_per_capita | base.schemastaging.organization_extra : phone_number | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | type.object : type | location.mailing_address : citytown | influence.influence_node : peers | influence.peer_relationship : peers | business.brand : products | award.award_category : category_of | kg.object_profile : prominent_type\n\n\nquestion:\n\nThe organization with a leadership role of President of Technology has main headquarters located where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.role ns:m.02_35z8 .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mountain View"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDarth Vader: m.0f2y0 | Ahsoka Tano: m.03mh1mw | type.object : name, type | fictional_universe.fictional_character : character_created_by, parents, occupation, romantically_involved_with, place_of_birth, gender | film.film_character : portrayed_in_films | film.performance : character, actor, film | book.book_character : appears_in_book | tv.tv_character : appeared_in_tv_program | tv.regular_tv_appearance : seasons, series, actor | tv.tv_actor : starring_roles | fictional_universe.romantic_involvement : partner | kg.object_profile : prominent_type | film.film : starring | people.person : profession | media_common.netflix_genre : titles\n\n\nquestion:\n\nWho provides the voice of Anakin in the movie that features a character named Ahsoka Tano?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.03mh1mw .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0f2y0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Matt Lanter"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Country: m.01mp | Central Time Zone: m.02fqwt | type.object : type | common.topic : notable_types | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | film.film_location : featured_in_films | symbols.namesake : named_after\n\n\nquestion:\n\nWhat country bordering the US is in the Central Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.time_zones ns:m.02fqwt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Canada"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1907 World Series: m.04tg9h | sports.sports_team : championships | time.event : end_date, start_date, locations, instance_of_recurring_event | sports.sports_championship_event : championship, champion, runner_up | type.object : type | kg.object_profile : prominent_type | award.award_category : date_established | time.recurring_event : instances | people.person : gender\n\n\nquestion:\n\nWhat year did the team who won the 1907 World Series championship last win the world series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04tg9h .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1908 World Series"
    }
]