[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAzua Province: m.028cgkl | Hurricane Irene: m.02p70bg | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.location : containedby, contains, people_born_here | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | meteorology.tropical_cyclone : affected_areas | location.country : second_level_divisions, administrative_divisions, form_of_government | travel.travel_destination : tourist_attractions | kg.object_profile : prominent_type | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhich nation that has Azua Province within its borders is a place where Hurricane Irene landed?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02p70bg ns:meteorology.tropical_cyclone.affected_areas ?x .\n?x ns:location.country.administrative_divisions ns:m.028cgkl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican Republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEl Seibo Province: m.03xplf | location.location : time_zones, area, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type | architecture.structure : height_meters | location.country : currency_used, administrative_divisions | geography.river : basin_countries\n\n\nquestion:\n\nWhat type of currency is used where the El Seibo Province is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03xplf .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nState bird: m.04627hw | Lansing: m.04pry | State flower: m.04627gn | type.object : type | location.location : time_zones, contains, containedby | medicine.notable_person_with_medical_condition : condition | government.governmental_jurisdiction : official_symbols | people.person : profession, nationality, place_of_birth, gender | location.location_symbol_relationship : Kind_of_symbol | architecture.structure : height_meters | government.politician : government_positions_held | government.government_position_held : basic_title, jurisdiction_of_office | influence.influence_node : influenced_by | kg.object_profile : prominent_type | location.us_state : capital | film.film : language | people.deceased_person : cause_of_death\n\n\nquestion:\n\nWhat are the official bird and flower of the state whose capital is Lansing?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.us_state.capital ns:m.04pry .\n?c ns:government.governmental_jurisdiction.official_symbols ?y . # Michigan\n?y ns:location.location_symbol_relationship.symbol ?x .\n?y ns:location.location_symbol_relationship.Kind_of_symbol ?k .\n\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "American robin, Apple Blossom"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTour Anfibio: m.09ncdd | symbols.namesake : named_after | people.ethnicity : included_in_group | award.award_category : date_established | music.genre : albums | type.object : type | religion.religion : deities, places_of_worship | music.composition : composer | music.artist : concert_tours | language.human_language : countries_spoken_in | kg.object_profile : prominent_type | location.location : partially_contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | media_common.netflix_genre : titles | music.album : release_date | common.topic : notable_types | people.person : profession, nationality, place_of_birth | location.country : administrative_divisions | film.film_job : films_with_this_crew_job | film.film_crew_gig : crewmember | interests.hobby : people_with_this_hobby\n\n\nquestion:\n\nWhat is the nationalilty of the artist who had a concert tour named Tour Anfibio's?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.09ncdd .\n?c ns:people.person.nationality ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colombia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Lancers: m.0c4r71 | Spain: m.06mkj | location.location : contains, people_born_here | organization.organization_founder : organizations_founded | type.object : name, type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : places_exported_to | location.imports_and_exports : exported_to | common.topic : notable_types | royalty.kingdom : rulers | wine.wine_region : wine_styles\n\n\nquestion:\n\nWhich bordering country of Spain that has the wine regions that produces Lancers wine?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mkj ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:wine.wine_region.wine_styles ns:m.0c4r71 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Portugal"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nApple tree: m.014j1m | people.deceased_person : cause_of_death, place_of_death | type.object : type | people.person : children, profession, place_of_birth, gender | kg.object_profile : prominent_type | location.location : contains, people_born_here | religion.religion : deities | book.book_subject : works | time.event : locations | sports.sports_championship_event : championship, runner_up | influence.influence_node : influenced_by, influenced | education.educational_institution : students_graduates | education.education : student | government.political_appointer : appointees | government.government_position_held : basic_title, office_holder, to | government.governmental_jurisdiction : governing_officials | military.military_conflict : casualties | military.casualties : lower_estimate | sports.sports_team : founded | base.schemastaging.organization_extra : phone_number | base.schemastaging.phone_sandbox : product_or_service\n\n\nquestion:\n\nWhat is the state capital where the major export is Apple trees?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.statistical_region.major_exports ?k .\n?k ns:location.imports_exports_by_industry.industry ns:m.014j1m .\n?c ns:base.aareas.schema.administrative_area.capital ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Olympia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nShche ne vmerla Ukraina: m.01kvjf | language.human_language : countries_spoken_in | type.object : type | government.government : government_for | people.person : religion, profession, nationality, ethnicity, gender | location.country : currency_used | government.government_office_category : officeholders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to | location.location : partially_containedby, contains, containedby | common.topic : notable_types | government.politician : government_positions_held | government.governmental_body : members | people.deceased_person : place_of_death | finance.currency : countries_used | government.government_office_or_title : office_holders | geography.river : mouth, cities | kg.object_profile : prominent_type | sports.pro_athlete : career_start | film.actor : film | film.performance : film | government.form_of_government : countries | film.film : genre | government.political_appointer : appointees\n\n\nquestion:\n\nThe country that has the national anthem Shche ne vmerla Ukraina uses what kind of money?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01kvjf .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ukrainian hryvnia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMichoacán: m.01btry | type.object : type | common.topic : notable_types | location.location : time_zones, people_born_here, containedby | kg.object_profile : prominent_type | architecture.structure : opened, height_meters | location.country : currency_used, administrative_divisions\n\n\nquestion:\n\nThe nation where Michoacan is located uses which form of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01btry .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGod Defend New Zealand: m.03b03 | people.deceased_person : cause_of_death, date_of_death | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, office_position_or_title, jurisdiction_of_office, to, governmental_body | tv.tv_series_episode : episode_number | time.event : start_date, included_in_event | people.person : religion, profession, nationality, place_of_birth, gender | base.culturalevent.event : entity_involved | government.government_office_category : officeholders | government.government_office_or_title : office_holders | location.country : form_of_government | government.governmental_body : jurisdiction | location.location : containedby | type.object : type | kg.object_profile : prominent_type | sports.sports_team : location | award.award_nominee : award_nominations | award.award_nomination : award | film.film : subjects\n\n\nquestion:\n\nWhat type of government is run in the country with the anthem titled \"God Defend New Zealand\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.03b03 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Unitary state, Constitutional monarchy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | Luitpold Gymnasium: m.07yfzw | common.topic : notable_types | organization.organization : date_founded | location.location : people_born_here, contains, containedby | kg.object_profile : prominent_type | type.object : type | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | education.educational_institution : school_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | film.film_location : featured_in_films\n\n\nquestion:\n\nWhat college was attended by the famous alumni of Luitpold Gymnasium ?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.07yfzw .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "ETH Zurich, University of Zurich"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTiến Quân Ca: m.01kvf8 | type.object : name, type | people.person : religion, profession, nationality, place_of_birth, gender | film.film_subject : films | government.government_office_or_title : office_holders | government.government_position_held : basic_title, office_holder, jurisdiction_of_office | kg.object_profile : prominent_type | location.country : form_of_government | fictional_universe.fictional_character : place_of_birth | tv.tv_series_episode : episode_number | architecture.structure : opened, height_meters | location.location : contains, containedby | military.military_conflict : commanders | military.military_command : military_commander | film.film : genre | common.topic : notable_types | government.politician : government_positions_held | finance.currency : countries_used | people.deceased_person : date_of_death, place_of_death | government.government_office_category : officeholders | base.unitednations.united_nations_body_membership : member | government.form_of_government : countries | geography.river : cities | biology.animal_breed : place_of_origin\n\n\nquestion:\n\nWhat is the type of government where the national anthem is \"Tien Quan Ca\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01kvf8 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Communist state, Socialist state, Single-party state"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Country: m.01mp | Ukrainian Greek Catholic Church: m.02cd38 | type.object : name, type | religion.religious_leadership_jurisdiction : leader | religion.religious_organization_leadership : leader | location.location : events, adjoin_s, contains, partially_contains | location.adjoining_relationship : adjoins | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | common.topic : notable_types | location.country : currency_used, administrative_divisions | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat country close to Russia has a religious organization named Ukrainian Greek Catholic Church?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:religion.religious_leadership_jurisdiction.leader ?c .\n?c ns:religion.religious_organization_leadership.organization ns:m.02cd38 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ukraine"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMrs. Met: m.0w7lzvh | type.object : type | location.location : events, contains, people_born_here | sports.sports_team : team_mascot, championships | media_common.netflix_genre : titles | film.film_location : featured_in_films | people.person : profession, gender | location.place_with_neighborhoods : neighborhoods | travel.travel_destination : how_to_get_here | travel.transportation : transport_terminus | sports.sports_championship_event : championship, champion, runner_up | architecture.structure : construction_started | sports.pro_athlete : teams | sports.sports_team_roster : team | kg.object_profile : prominent_type | organization.organization : leadership | organization.leadership : person | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | location.administrative_division : country | fictional_universe.fictional_setting : universe\n\n\nquestion:\n\nWhen did the sports team whose mascot is Mrs. Met most recently win the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.0w7lzvh .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1986 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMichelle D. Johnson: m.0c56jn | location.mailing_address : state_province_region | people.person : religion, profession, nationality, parents, date_of_birth, languages, place_of_birth, gender | government.politician : government_positions_held, party | type.object : type | government.political_party_tenure : party | common.topic : image, notable_types | kg.object_profile : prominent_type | people.deceased_person : place_of_burial, cause_of_death | music.artist : genre | organization.organization : headquarters\n\n\nquestion:\n\nMichelle D. Johnson is a leader of the organization established in what state?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0c56jn .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.state_province_region ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colorado"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRenminbi: m.0hn4_ | location.location : contains, containedby | kg.object_profile : prominent_type | type.object : type | common.topic : notable_types | language.human_language : countries_spoken_in | architecture.structure : opened, height_meters | location.country : official_language, currency_used | people.deceased_person : cause_of_death | architecture.venue : capacity | government.politician : government_positions_held | government.government_position_held : from\n\n\nquestion:\n\nWhat is the official language of the country that uses Renminbi as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.0hn4_ .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Standard Chinese"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBenjamin Netanyahu: m.0fm2h | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.politician : government_positions_held | type.object : type | american_football.football_player : position_s | location.religion_percentage : religion | people.deceased_person : date_of_death, place_of_death | influence.influence_node : influenced | government.government_position_held : basic_title, from, jurisdiction_of_office, to, governmental_body | location.statistical_region : religions | award.award_category : date_established\n\n\nquestion:\n\nWhat is the religion of the people where Benjamin Netanyahu is in a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0fm2h .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVictoria: m.07ypt | est: m.02hcv8 | time.time_zone : locations_in_this_time_zone | sports.sports_team_location : teams | location.statistical_region : population, consumer_price_index, cpi_inflation_rate, gdp_real, foreign_direct_investment_net_inflows, co2_emissions_per_capita, net_migration | measurement_unit.dated_money_value : amount | measurement_unit.dated_percentage : rate | location.location : adjoin_s, time_zones, people_born_here, contains, containedby | location.adjoining_relationship : adjoins | measurement_unit.dated_integer : number | measurement_unit.adjusted_money_value : adjusted_value | film.film_location : featured_in_films | location.country : languages_spoken | symbols.namesake : named_after\n\n\nquestion:\n\nWhat North American country located within Eastern Time Zone includes the city of Victoria, British Columbia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ypt ns:location.location.containedby ?x .\n?x ns:location.location.time_zones ns:m.02hcv8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Canada"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKushinagar: m.01h0lq | Australia: m.0chghy | location.location : containedby, contains, people_born_here | religion.religion : sacred_sites, places_of_worship | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, basic_title, office_position_or_title, legislative_sessions, governmental_body | location.country : form_of_government | film.film_location : featured_in_films | type.object : type | common.topic : image\n\n\nquestion:\n\nWhat religion in Australia has a sacred site named Kishinagar?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0chghy ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.sacred_sites ns:m.01h0lq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Buddhism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAmerican football team: m.01xljyt | National Collegiate Athletic Association: m.0gh43 | 1993 College World Series: m.0287wy5 | sports.sports_team : arena_stadium, league, colors, location, fight_song, sport, team_mascot, championships, roster | sports.sports_league : teams | sports.sports_league_participation : league, team | sports.sports_team_roster : player, position | time.event : start_date | sports.school_sports_team : school | award.award_nominee : award_nominations | award.award_nomination : award | type.object : type | common.topic : notable_types | organization.organization : founders | american_football.football_team : current_head_coach, division | film.film_subject : films\n\n\nquestion:\n\nWhat NCAA football team won the 1993 College World Series championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0gh43 ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n?x ns:common.topic.notable_types ns:m.01xljyt .\n?x ns:sports.sports_team.championships ns:m.0287wy5 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "LSU Tigers football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nmakkah: m.058wp | russian: m.06bnz | location.location : containedby, contains, partially_contains | location.country : administrative_divisions | religion.religion : sacred_sites, holidays | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich prominent Russia religion has Mecca as a sacred location?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.sacred_sites ns:m.058wp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Islam"
    }
]