[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQuarterback: m.06b1q | Steve Bisciotti: m.06x8mf | sports.sports_team_roster : player, team, position | kg.object_profile : prominent_type | sports.sports_team : roster | american_football.football_player : position_s | military.military_person : participated_in_conflicts | location.location : time_zones, contains, people_born_here | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : sport | people.person : height_meters, profession, nationality, gender | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | sports.professional_sports_team : owner_s | book.book_subject : works | government.politician : government_positions_held | people.deceased_person : cause_of_death | type.object : type\n\n\nquestion:\n\nWho were quarterback Steve Bisciotti's sports team owners in 2012?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.06x8mf .\n?c ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.position ns:m.06b1q .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Curtis Painter, Randall Cunningham, Tyrod Taylor, Joe Flacco, Trent Dilfer, Scott Mitchell, Chester Stewart"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEast Whittier Elementary School: m.0_sp3dx | travel.tourist_attraction : near_travel_destination | education.educational_institution : school_type, students_graduates, colors | people.person : place_of_birth | type.object : type | kg.object_profile : prominent_type | organization.organization : place_founded, date_founded, founders | business.business_operation : industry | sports.sports_team : location, founded, sport, colors | location.location : containedby | film.film : featured_film_locations | education.education : student | common.topic : notable_types | government.government_office_or_title : office_holders\n\n\nquestion:\n\nWhat is the birth place of the famous person who went to East Whittier Elementary School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0_sp3dx .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Yorba Linda"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKurt Vonnegut: m.049gc | Butler Bulldogs men's basketball: m.02qqzmn | award.award_nominee : award_nominations | location.location : containedby, contains, people_born_here | education.educational_institution : students_graduates, sports_teams | influence.influence_node : influenced_by | people.person : education, religion, profession | education.education : institution, student | type.object : type | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | award.award_nomination : award, nominated_for | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | sports.sports_team_location : teams | common.topic : notable_types | media_common.dedicator : dedications | media_common.dedication : work_dedicated\n\n\nquestion:\n\nWhat men's basketball sports team named Butler Bulldogs did Kurt Vonnegut go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.049gc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.02qqzmn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Butler University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArgentina: m.0jgd | Netherlands Reformed Congregations: m.0117z61q | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | type.object : type | kg.object_profile : prominent_type | location.location : partially_contains, adjoin_s, contains, people_born_here | location.country : official_language, languages_spoken, administrative_divisions, form_of_government | religion.religion : organizations, beliefs, texts | religion.religious_leadership_jurisdiction : leader | religion.religious_organization_leadership : start_date | location.adjoining_relationship : adjoins | organization.organization : place_founded, date_founded | measurement_unit.dated_percentage : rate | media_common.netflix_genre : titles\n\n\nquestion:\n\nWhat kind of religion does Argentina have that has a religious organization called the Netherlands Reformed Congregations?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jgd ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.organizations ns:m.0117z61q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Protestantism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGreenwich Mean Time Zone: m.03bdv | Roman Empire: m.06cmp | location.location : time_zones, contains, partially_contains | time.time_zone : locations_in_this_time_zone | type.object : type\n\n\nquestion:\n\nWhat continent is the country in Greenwich Mean Time Zone that was a part of Roman Empire is in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06cmp ns:location.location.partially_contained_by ?y .\n?y ns:location.partial_containment_relationship.partially_contained_by ?x .\n?x ns:location.location.time_zones ns:m.03bdv .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Europe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWalton County: m.0nym5 | est: m.02hcv8 | location.location : time_zones, containedby, contains, people_born_here | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : office_holder | time.time_zone : locations_in_this_time_zone | location.statistical_region : population | measurement_unit.dated_integer : number | location.country : second_level_divisions, administrative_divisions | type.object : type | symbols.namesake : named_after\n\n\nquestion:\n\nIn what Eastern Time Zone State is Walton County?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0nym5 ns:location.location.containedby ?x .\n?x ns:location.location.time_zones ns:m.02hcv8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Georgia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2009 NBA Finals: m.04gg8b0 | sports.sports_championship : events | sports.sports_team : founded, colors, location, championships, roster | type.object : type | sports.sports_team_roster : player, position | sports.sports_championship_event : champion, runner_up | time.event : start_date | basketball.basketball_team : head_coach | organization.organization : leadership | organization.leadership : role | award.award_nominee : award_nominations | award.award_nomination : award | sports.professional_sports_team : owner_s | time.recurring_event : instances, date_of_first_occurance\n\n\nquestion:\n\nWhat years did the champion of the 2009 NBA Final championship with the championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04gg8b0 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2009 NBA Finals, 1980 NBA Finals, 2002 NBA Finals, 2000 NBA Finals, 2001 NBA Finals, 1988 NBA Finals, 1987 NBA Finals, 1985 NBA Finals, 1982 NBA Finals, 2010 NBA Finals, 1972 NBA Finals, 1954 NBA Finals, 1953 NBA Finals, 1952 NBA Finals, 1950 NBA Finals, 1949 BAA Finals, 1948 NBL Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPrime Minister of Pakistan: m.02cd6_ | government.politician : government_positions_held, party | type.object : type | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, from, to, governmental_body | government.political_party_tenure : party | people.person : religion, nationality, gender\n\n\nquestion:\n\nWho held his governental position from May 26, 1993 and was the Prime Minister of Pakistan in 1999?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02cd6_ ns:government.government_office_or_title.office_holders ?y .\n?y ns:government.government_position_held.office_holder ?x .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1993-05-26\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Nawaz Sharif"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nsan diego, ca: m.071vr | location.location : people_born_here, contains, partially_contains | travel.travel_destination : tourist_attractions | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : basic_title, office_holder | government.political_district : representatives | travel.tourist_attraction : near_travel_destination | zoos.zoo : opened\n\n\nquestion:\n\nWhat zoo opened in 1903 and is a fun thing to do in San Diego?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.071vr ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened \"1903\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Birch Aquarium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nState Elementary School Menteng 01: m.0280qps | government.political_appointer : appointees | government.government_position_held : office_holder, district_represented, basic_title, from, to | government.politician : government_positions_held | location.location : time_zones, containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | location.statistical_region : co2_emissions_per_capita, religions | type.object : type | book.book_subject : works | people.person : education, profession | location.country : capital, languages_spoken | education.education : institution, degree | award.award_nominee : award_nominations | award.award_nomination : nominated_for | location.religion_percentage : religion\n\n\nquestion:\n\nWhere did the famous person who went to State Elementary School Menteng attend college?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0280qps .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Harvard Law School, Columbia University, Noelani Elementary School, State Elementary School Menteng 01, Punahou School, Occidental College, St. Francis of Assisi Catholic School"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1937 NFL Championship Game: m.027bqj9 | sports.sports_championship_event : championship, champion, runner_up | location.location : contains, people_born_here | type.object : type | people.person : profession, nationality, place_of_birth, gender | sports.sports_team : arena_stadium, sport, championships, previously_known_as | time.event : end_date, start_date | common.topic : notable_types | sports.sports_team_owner : teams_owned | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | film.film_subject : films | kg.object_profile : prominent_type | sports.sports_facility : teams | american_football.football_player : position_s\n\n\nquestion:\n\nThe 1937 NFL Championship Game was won by what team?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.027bqj9 .\n?c ns:sports.sports_team.previously_known_as ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston Redskins"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCarlos Santana: m.01304j | Dianne Feinstein: m.01gqws | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | location.country : second_level_divisions, administrative_divisions | government.politician : government_positions_held | music.composer : compositions\n\n\nquestion:\n\nThe location that appointed Dianne Feinstein to governmental position is from what location where Carlos Santana lives?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01304j ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.01gqws .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "San Francisco"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAntonis Samaras: m.054q0_ | type.object : type | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | government.politician : government_positions_held | american_football.football_player : position_s | kg.object_profile : prominent_type | location.location : events | location.country : languages_spoken | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : date_of_death | government.government_position_held : legislative_sessions\n\n\nquestion:\n\nWhat are the spoken languages in the country with Antonis Samaras in the government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.054q0_ .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Albanian language, Greek Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVietnam War: m.07_nf | location.location : time_zones, events, contains, containedby | military.military_conflict : casualties, commanders, combatants | military.military_combatant_group : combatants | base.culturalevent.event : entity_involved | time.time_zone : locations_in_this_time_zone | film.film_subject : films | book.book_subject : works | type.object : type | military.military_command : military_commander | time.event : locations | military.casualties : lower_estimate | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhere was the Vietnam War in the Indonesia Eastern Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07_nf ns:time.event.locations ?x .\n?x ns:location.location.time_zones ns:g.1224z91_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Southeast Asia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Latin America: m.04pnx | Mexican peso: m.012ts8 | location.location : time_zones, adjoin_s, contains, people_born_here | common.topic : notable_types | location.country : calling_code, currency_used, languages_spoken | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | location.statistical_region : consumer_price_index, population, gdp_real, size_of_armed_forces, co2_emissions_per_capita, part_time_employment_percent | measurement_unit.dated_integer : number | measurement_unit.dated_percentage : rate | type.object : name | travel.travel_destination : tourist_attractions | sports.sports_team_location : teams | measurement_unit.adjusted_money_value : adjusted_value | location.adjoining_relationship : adjoins | finance.currency : countries_used\n\n\nquestion:\n\nWhat part of Latin America uses the Mexican peso?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04pnx ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.012ts8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBaby Carmen: m.02ql50 | FoOglie #3: m.0zfn7vw | location.location : contains, people_born_here | book.book_subject : works | kg.object_profile : prominent_type | location.country : administrative_divisions | film.performance : character, actor, film | fictional_universe.fictional_language : where_spoken | type.object : type | film.music_contributor : film | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film_genre : films_in_this_genre | film.film : written_by, starring, release_date_s | film.film_regional_release_date : film_release_distribution_medium | people.person : place_of_birth | film.actor : film | film.film_character : portrayed_in_films | fictional_universe.fictional_character : gender | media_common.netflix_genre : titles\n\n\nquestion:\n\nIn the film with the characted name  FoOglie #3, who played Carmen Cortez?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0zfn7vw .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.02ql50 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Alexa Vega, Addisyn Fair"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDuisburg: m.0ps1q | Country: m.01mp | type.object : type | kg.object_profile : prominent_type | location.location : time_zones, containedby, contains, people_born_here | common.topic : notable_types | architecture.building : floors | architecture.structure : opened, height_meters | people.deceased_person : date_of_death | aviation.airport : serves | organization.organization : date_founded\n\n\nquestion:\n\nWhat countries share a border with the nation that includes an airport in Duisburg?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.contains ?k .\n?k ns:aviation.airport.serves ns:m.0ps1q .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belgium, Czech Republic, Luxembourg, Netherlands, Poland, Switzerland, France, Austria, Denmark"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGulf War: m.018w0j | Najaf Governorate: m.01ch32 | location.location : events, contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.country : calling_code, administrative_divisions, languages_spoken, form_of_government | base.culturalevent.event : entity_involved | type.object : type | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.administrative_division : country | time.event : locations | military.military_conflict : combatants | military.military_combatant_group : combatants\n\n\nquestion:\n\nWho was fighting in the Gulf War which is a country that contains the Najaf Governorate?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.018w0j ns:military.military_conflict.combatants ?y .\n?y ns:military.military_combatant_group.combatants ?x .\n?x ns:location.country.administrative_divisions ns:m.01ch32 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iraq"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQuarterback: m.06b1q | Atlanta Falcons: m.0wsr | kg.object_profile : prominent_type | type.object : type | sports.pro_athlete : teams, sports_played_professionally, career_start, career_end | sports.sports_team_roster : player, position, from, team, to | sports.sports_team : roster | sports.pro_sports_played : sport, career_start | common.topic : notable_types | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from | people.person : gender | american_football.football_player : passing, position_s | american_football.player_passing_statistics : attempts\n\n\nquestion:\n\nWhat pro athlete who started his career latest was a Falcons 2012 quarterback?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0wsr ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.position ns:m.06b1q .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.pro_athlete.career_start ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Luke McCown"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral European Time Zone: m.02llzg | Germany: m.0345h | common.topic : notable_types | location.location : time_zones, people_born_here, contains, containedby | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | kg.object_profile : prominent_type | travel.tourist_attraction : near_travel_destination | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat tourist attraction in Germany is in Central European Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0345h ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tropical Islands Resort"
    }
]