[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2014 AFC Championship Game: m.0_gtzbl | sports.sports_championship : events | sports.sports_team : arena_stadium, founded, colors, fight_song, team_mascot, location, championships, roster | time.recurring_event : instances | sports.sports_championship_event : champion, runner_up | award.award_nominee : award_nominations | sports.professional_sports_team : draft_picks, owner_s | sports.sports_league_draft_pick : player | type.object : type | time.event : locations, instance_of_recurring_event | american_football.football_team : historical_coaching_staff, current_head_coach | american_football.football_historical_coach_position : coach | award.award_nomination : award | sports.sports_facility : teams | sports.sports_team_roster : player, position | location.location : containedby | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat's the home stadium of the team that won the 2014 AFC Championship Game?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gtzbl .\n?c ns:sports.sports_team.arena_stadium ?x .\n?x ns:architecture.structure.opened ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sports Authority Field at Mile High"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Madison Square Garden Company: m.03cf31q | Tyson Chandler: m.05j8c8 | kg.object_profile : prominent_type | people.person : ethnicity, profession, nationality, gender | sports.sports_team : arena_stadium, founded, location, sport, championships, roster | sports.sports_team_roster : player, team, position | sports.sports_team_owner : teams_owned | type.object : type | organization.organization : headquarters, leadership, date_founded, founders | sports.pro_athlete : teams, career_start | basketball.basketball_player : position_s | sports.professional_sports_team : owner_s | common.topic : image, notable_types | basketball.basketball_team : head_coach | organization.leadership : person, role\n\n\nquestion:\n\nWhat sports team owned by The Madison Square Garden Company did Tyson Chandler play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05j8c8 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.03cf31q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York Knicks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Ukrainian Greek Catholic Church: m.02cd38 | Body Of Water: m.01y2jks | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | common.topic : notable_types | location.location : contains, containedby | people.deceased_person : date_of_death, place_of_death | type.object : type | kg.object_profile : prominent_type | government.politician : government_positions_held | government.government_position_held : basic_title | education.educational_institution : sports_teams | royalty.monarch : kingdom\n\n\nquestion:\n\nWhat countries and bodies of water share a border with the nation that includes the Ukrainian Greek Catholic Church?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.02cd38 .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n{ {?x ns:common.topic.notable_types ns:m.01mp .} UNION {?x ns:common.topic.notable_types ns:m.01y2jks .} }\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belarus, Hungary, Moldova, Poland, Russia, Romania, Slovakia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMickey Loomis: m.02q31wy | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | film.film : genre | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | common.topic : notable_types | government.politician : government_positions_held, party | type.object : type | kg.object_profile : prominent_type | time.event : end_date | people.deceased_person : place_of_death | film.writer : film | government.government_position_held : basic_title, appointed_by | architecture.structure : opened | fictional_universe.fictional_character : education, gender | location.location : containedby | american_football.football_team : current_head_coach | government.political_party_tenure : party | government.political_appointer : appointees\n\n\nquestion:\n\nWhat is the name of the head coach of of the organization with Mickey Loomis?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.02q31wy .\n?c ns:american_football.football_team.current_head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sean Payton"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | John Mayer 2008 Summer Tour: m.04gkk8d | location.location : people_born_here, adjoin_s, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by, from | type.object : type | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : school | music.artist : genre, concert_tours | government.us_president : vice_president | location.statistical_region : consumer_price_index, size_of_armed_forces, co2_emissions_per_capita | location.adjoining_relationship : adjoins | measurement_unit.dated_integer : number | time.event : end_date | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : career_start | common.topic : notable_types | government.political_appointer : appointees\n\n\nquestion:\n\nWhich college was attended by the artist who headlined the John Mayer 2008 Summer Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.04gkk8d .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Berklee College of Music"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMontesquieu: m.0f9wd | influence.influence_node : peers, influenced_by, influenced | location.location : containedby, contains, people_born_here | common.topic : notable_types | book.author : book_editions_published | type.object : type | people.person : religion, profession | media_common.netflix_genre : titles | government.governmental_jurisdiction : governing_officials | influence.peer_relationship : peers | government.us_president : vice_president | people.deceased_person : place_of_death | location.country : languages_spoken | music.composer : compositions | government.political_appointer : appointees | government.government_position_held : to | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhich person that held a government position earliest did Baron de Montesquie influence?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f9wd ns:influence.influence_node.influenced ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "John Adams"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUpper Mississippi River: m.0bzw5j | United States Senate: m.07t58 | government.government_position_held : basic_title, from, legislative_sessions, appointed_by, governmental_body | type.object : type | people.person : employment_history, profession, nationality, date_of_birth, place_of_birth, gender | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.political_district : representatives | government.politician : government_positions_held, party | location.location : time_zones, containedby | government.governmental_jurisdiction : governing_officials | business.employment_tenure : company | common.topic : notable_types | government.political_party_tenure : party | film.film : cinematography | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport\n\n\nquestion:\n\nWho are the current senators from the state that partially contains the Upper Mississippi River?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.0bzw5j .\n?c ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.governmental_body ns:m.07t58 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dick Durbin, Mark Kirk"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nitalian: m.02bjrlw | Swiss franc: m.01_h4b | language.human_language : countries_spoken_in | location.country : internet_tld, currency_used, second_level_divisions | location.location : people_born_here, containedby, contains, partially_contains | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | periodicals.newspaper_circulation_area : newspapers | finance.currency : countries_used | type.object : type\n\n\nquestion:\n\nWhat country speaks Italian and uses the Swiss franc?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02bjrlw ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.currency_used ns:m.01_h4b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Switzerland"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEnglewood: m.0xkq4 | University of the Rockies: m.03wbmx5 | location.mailing_address : citytown | government.politician : government_positions_held | government.government_position_held : legislative_sessions | location.location : time_zones, people_born_here, contains, containedby | kg.object_profile : prominent_type | architecture.structure : height_meters | people.person : profession, nationality, ethnicity, height_meters, place_of_birth, gender | type.object : type | base.culturalevent.event : entity_involved | common.topic : notable_types | people.deceased_person : cause_of_death | american_football.football_player : position_s\n\n\nquestion:\n\nWhat location that includes the city of Englewood is the site of the University of the Rockies?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03wbmx5 ns:location.location.containedby ?x .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0xkq4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colorado"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLion Rampant: m.09n9lsy | Mark Zuckerberg: m.086dny | people.person : religion, profession, nationality, education, height_meters, place_of_birth, gender | influence.influence_node : influenced | education.education : institution, student, major_field_of_study | fictional_universe.school_in_fiction : students_graduates | type.object : type | education.educational_institution : mascot, school_type, students_graduates | kg.object_profile : prominent_type | internet.website_owner : websites_owned | organization.organization : date_founded | film.film_subject : films | common.topic : notable_types | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhat high school institution did the Facebook founder & CEO Mark Zuckerberg attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.086dny ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.mascot ns:m.09n9lsy .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Phillips Exeter Academy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMangyongdae Revolutionary School: m.0j277fx | location.location : containedby | type.object : type | organization.organization : date_founded, founders | kg.object_profile : prominent_type | sports.sports_team : arena_stadium, sport, founded, roster | sports.sports_team_roster : position | people.deceased_person : date_of_death, place_of_death | common.topic : notable_types | people.person : gender\n\n\nquestion:\n\nThe person from education institution Mangyongdae Revolutionary School died where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0j277fx .\n?c ns:people.deceased_person.place_of_death ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Pyongyang"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSharia: m.074hw | type.object : type | people.person : religion, profession, nationality, ethnicity, date_of_birth, place_of_birth, gender | kg.object_profile : prominent_type | people.deceased_person : place_of_burial, date_of_death, place_of_death | location.location : containedby | religion.religion : beliefs, types_of_places_of_worship | government.politician : government_positions_held | common.topic : notable_types | government.government_position_held : basic_title, from, jurisdiction_of_office | music.group_member : instruments_played | film.film_genre : films_in_this_genre | film.film_subject : films | organization.organization : founders | book.book_subject : works | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nWhat locations are considered places of worship for the people who practice the Sharia Belief?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.beliefs ns:m.074hw .\n?c ns:religion.religion.types_of_places_of_worship ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mosque, Masjid Hamza, Valley Stream"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2000 AFC Asian Cup Final: m.010qvrmk | Keisuke Honda: m.03gsj06 | sports.sports_team : arena_stadium, founded, location, sport, championships, roster | sports.sports_team_roster : player, team, position | sports.pro_athlete : teams | type.object : type | people.person : nationality, gender | sports.sports_championship_event : champion\n\n\nquestion:\n\nWhat team in Japan won the 2000 AFC Asian Cup Final championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03gsj06 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.championships ns:m.010qvrmk .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Japan national football team"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSteve Kerr: m.01gcq3 | government.politician : government_positions_held, party | government.government_position_held : to, legislative_sessions, from | sports.sports_team : championships | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | type.object : type | location.location : containedby, people_born_here | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | kg.object_profile : prominent_type | film.film_character : portrayed_in_films | film.performance : film | american_football.football_player : position_s | people.deceased_person : cause_of_death, date_of_death | government.political_party_tenure : party | basketball.basketball_team : head_coach | music.artist : label\n\n\nquestion:\n\nWhat year did the NBA franchise currently coached by Steve Keer win their first championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:basketball.basketball_team.head_coach ns:m.01gcq3 .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1975 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKim Kardashian: m.0261x8t | location.location : contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | people.person : education, profession | location.statistical_region : cpi_inflation_rate | measurement_unit.dated_percentage : rate | sports.pro_athlete : career_start | education.education : institution | tv.tv_personality : tv_regular_appearances | tv.tv_regular_personal_appearance : from\n\n\nquestion:\n\nWhat pro athlete who started his career in 2003 did Kim Kardashian date?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0261x8t ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n?x ns:sports.pro_athlete.career_start \"2003\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ben Roethlisberger"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTurkish people: m.0hb7h_z | Lejre Municipality: m.010v_j8w | location.administrative_division : country | location.country : official_language, second_level_divisions, administrative_divisions, form_of_government | royalty.kingdom : rulers | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.location : events, contains, people_born_here | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : basic_title, office_holder | food.beer_country_region : beers_from_here | people.ethnicity : geographic_distribution | type.object : type | common.topic : image | biology.breed_origin : breeds_originating_here\n\n\nquestion:\n\nWhich nation with Lejre Municipality is the place where Turkish people have their origins?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hb7h_z ns:people.ethnicity.geographic_distribution ?x .\n?x ns:location.country.administrative_divisions ns:m.010v_j8w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Denmark"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJohn Mayer 2008 Summer Tour: m.04gkk8d | type.object : type | architecture.structure : opened, height_meters, construction_started | location.location : containedby | music.artist : genre, concert_tours | people.person : date_of_birth, profession, place_of_birth | time.event : start_date | film.film : initial_release_date | sports.sports_team_roster : to, position | common.topic : notable_types | government.politician : government_positions_held | government.government_position_held : basic_title, to, jurisdiction_of_office | award.award_honor : award | people.deceased_person : date_of_death | kg.object_profile : prominent_type | book.book_subject : works\n\n\nquestion:\n\nThe artist of the concert tour named John Mayer 2008 Summer Tour plays what type of music?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.04gkk8d .\n?c ns:music.artist.genre ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Indie rock, Blues, Alternative rock, Folk rock, Country, Soul rock, Soft rock, Blue-eyed soul, Folk music, Blues rock, Pop rock, Pop music, Rock music, Acoustic music, Soul music, Country rock"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAbraham Lincoln: m.0gzh | government.government_office_or_title : office_holders | government.government_position_held : office_holder, office_position_or_title, from, to, governmental_body | government.politician : government_positions_held, party | government.us_president : vice_president | government.political_party_tenure : from | symbols.name_source : namesakes | people.person : religion, quotations | influence.influence_node : influenced_by, influenced | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : speech_topic, event | government.political_appointer : appointees | medicine.notable_person_with_medical_condition : condition | people.deceased_person : place_of_burial | type.object : type | media_common.dedicatee : dedications\n\n\nquestion:\n\nWhat important office did Abraham Lincoln hold from April 30, 1789?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0gzh ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.office_position_or_title ?x .\n?x ns:government.government_office_or_title.office_holders ?c .\n?c ns:government.government_position_held.from \"1789-04-30\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "President of the United States"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2009 AFC Championship Game: m.0_gt_lv | sports.sports_championship_event : championship, champion, runner_up | location.location : events, people_born_here | people.deceased_person : date_of_death, place_of_death | people.person : ethnicity, profession, nationality, gender | time.event : end_date, start_date, locations | type.object : type | sports.sports_team : arena_stadium, championships, roster | sports.sports_team_roster : player, position, from, team, to | kg.object_profile : prominent_type | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from, to | common.topic : notable_types | award.award_category : date_established | sports.pro_athlete : teams | american_football.football_player : passing | american_football.player_passing_statistics : attempts\n\n\nquestion:\n\nWhich man coached the football team that emerged victorious in the 2009 AFC Championship Game?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gt_lv .\n?c ns:american_football.football_team.historical_coaching_staff ?y .\n?y ns:american_football.football_historical_coach_position.coach ?x .\nEXISTS {?y ns:american_football.football_historical_coach_position.from ?sk1 .\nEXISTS {?y ns:american_football.football_historical_coach_position.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bill Cowher"
    }
]