[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSusana Martinez: m.0c3z1kx | State flower: m.04627gn | type.object : type | kg.object_profile : prominent_type | government.governmental_jurisdiction : official_symbols | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | common.topic : notable_types | location.location : people_born_here, containedby | government.politician : government_positions_held, party | government.government_position_held : district_represented, basic_title, office_position_or_title, jurisdiction_of_office, to, governmental_body | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.political_party_tenure : party | people.deceased_person : date_of_death, place_of_death | location.location_symbol_relationship : Kind_of_symbol\n\n\nquestion:\n\nWhat is the state flower of the geographic region where Susana Martinez was appointed to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0c3z1kx .\n?c ns:government.governmental_jurisdiction.official_symbols ?y .\n?y ns:location.location_symbol_relationship.symbol ?x .\n?y ns:location.location_symbol_relationship.Kind_of_symbol ns:m.04627gn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Yucca flower"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnkara: m.0jyw | location.location : time_zones, containedby | type.object : type | people.deceased_person : date_of_death | common.topic : notable_types | kg.object_profile : prominent_type | architecture.building : floors | location.country : capital, currency_used | people.person : place_of_birth | travel.tourist_attraction : near_travel_destination | government.politician : government_positions_held | government.government_position_held : from\n\n\nquestion:\n\nWhat type of currency do I need in the country whose capital is Ankara?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0jyw .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkish lira"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCampbell High School: m.027bc43 | Marriage: m.04ztj | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.country : administrative_divisions, official_language, second_level_divisions, capital, form_of_government | location.location : events, time_zones, people_born_here, contains, containedby | people.person : spouse_s | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.marriage : type_of_union, spouse | geography.river : cities | type.object : type | travel.tourist_attraction : near_travel_destination | government.political_district : representatives\n\n\nquestion:\n\nWho were married to the famous person that went to Campbell High School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.027bc43 .\n?c ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lyle Lovett, Daniel Moder"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVladimir Putin: m.08193 | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | government.government_position_held : governmental_body, from, jurisdiction_of_office, district_represented | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | kg.object_profile : prominent_type | time.event : end_date | architecture.architect : structures_designed | government.political_party_tenure : party | people.deceased_person : cause_of_death\n\n\nquestion:\n\nWhat continent contains the location where Vladimir Putin has been appointed to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.08193 .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Europe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGeorge Soros: m.0gyk6w | Sefer Yetzirah: m.019n87 | organization.organization_founder : organizations_founded | people.person : religion, profession, nationality, ethnicity, gender | symbols.name_source : namesakes | religion.religion : deities, places_of_worship, types_of_places_of_worship, notable_figures, texts, practices, is_part_of, sacred_sites, beliefs, founding_figures | type.object : type | media_common.netflix_genre : titles | book.book_subject : works | common.topic : notable_types | kg.object_profile : prominent_type | government.politician : party | government.political_party_tenure : party | film.film_subject : films\n\n\nquestion:\n\nWhat religion has Sefer Yetzirah as text and is followed by George Soros?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0gyk6w ns:people.person.religion ?x .\n?x ns:religion.religion.texts ns:m.019n87 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIranian rial: m.034n11 | language.human_language : language_family, countries_spoken_in | location.country : currency_used, form_of_government | government.government_office_or_title : office_holders | government.government_position_held : basic_title, office_holder, office_position_or_title, jurisdiction_of_office | people.person : religion, profession, nationality, place_of_birth, gender | government.form_of_government : countries | people.deceased_person : cause_of_death | organization.organization : date_founded | government.politician : government_positions_held | time.event : locations | time.time_zone : locations_in_this_time_zone | type.object : name, type | location.location : people_born_here, contains, containedby | military.military_person : participated_in_conflicts | kg.object_profile : prominent_type | government.governmental_body : members | government.government_office_category : officeholders | common.topic : notable_types\n\n\nquestion:\n\nWhat type of political system is used in the country with the currency of Iranian rial?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.034n11 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Presidential system, Islamic republic, Unitary state, Theocracy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSteve Bisciotti: m.06x8mf | type.object : type | government.politician : government_positions_held | people.deceased_person : cause_of_death | architecture.building : floors | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | location.location : time_zones, containedby | sports.sports_team : arena_stadium | film.film : production_companies | music.group_member : instruments_played | american_football.football_player : position_s | kg.object_profile : prominent_type | sports.professional_sports_team : owner_s | government.government_position_held : basic_title\n\n\nquestion:\n\nTeam owner Steve Bisciotti's sports team plays where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.06x8mf .\n?c ns:sports.sports_team.arena_stadium ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "M&T Bank Stadium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIan Ayre: m.0gjcv98 | Football League Cup: m.012dbw | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | type.object : type | location.location : containedby | soccer.football_team : borrowed_players | soccer.football_player_loan : player | government.politician : government_positions_held | government.government_position_held : from, jurisdiction_of_office | organization.organization : date_founded | sports.sports_team : championships, roster | sports.sports_team_roster : position | kg.object_profile : prominent_type | film.director : film | sports.sports_championship_event : championship, runner_up | people.deceased_person : place_of_death | education.educational_institution : colors | sports.pro_athlete : career_end | common.topic : notable_types | government.governmental_jurisdiction : government | visual_art.visual_artist : art_forms\n\n\nquestion:\n\nWhen did the sports team whose organizational leadership includes someone named Ian Ayre most recently win the league championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0gjcv98 .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.championship ns:m.012dbw .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2012 Football League Cup Final"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRasheed Wallace: m.02hdjz | The Madison Square Garden Company: m.03cf31q | sports.sports_team : arena_stadium, founded, location, sport, championships, roster | basketball.basketball_player : position_s | organization.organization : headquarters, leadership, date_founded, founders | organization.leadership : person, role | common.topic : image, notable_types | type.object : type | kg.object_profile : prominent_type | people.person : religion, profession, nationality, ethnicity, place_of_birth, gender | sports.sports_team_roster : player, team, position | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start, career_end | sports.professional_sports_team : owner_s | sports.sports_team_owner : teams_owned | basketball.basketball_team : head_coach\n\n\nquestion:\n\nWhat sports team for which Rasheed Wallace played is the team owned by The Madison Square Garden Company?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02hdjz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.03cf31q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York Knicks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIran: m.03shp | Time in the United Arab Emirates: m.0cn_nt6 | location.location : time_zones, contains, people_born_here | type.object : type | travel.travel_destination : tourist_attractions | location.place_with_neighborhoods : neighborhoods | time.time_zone : locations_in_this_time_zone\n\n\nquestion:\n\nWhich major Iranian trading partner is in the location of time zone Time in the United Arab Emirates?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.03shp ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.03shp ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.location.time_zones ns:m.0cn_nt6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dubai"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral Western Time Zone: m.0y498v7 | government.politician : government_positions_held | type.object : type | people.deceased_person : cause_of_death, date_of_death | government.government_position_held : from, to, district_represented | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | location.location : time_zones, containedby | architecture.structure : opened, height_meters | kg.object_profile : prominent_type | location.country : languages_spoken | film.actor : film | film.performance : character | common.topic : notable_types | base.culturalevent.event : entity_involved\n\n\nquestion:\n\nWhat language is spoken in the Central Western Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.time_zones ns:m.0y498v7 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language, Esperanto Language, Lojban"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLara, Venezuela: m.02pp6_ | common.topic : notable_types | location.location : time_zones, contains, containedby | type.object : type | sports.sports_team_location : teams | kg.object_profile : prominent_type | location.country : administrative_divisions | architecture.structure : height_meters | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nIn the countries which inclide Lara as a city, which major sports are played?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02pp6_ .\n?c ns:sports.sports_team_location.teams ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Venezuela women's national volleyball team, Venezuela men's national volleyball team, Venezuela national football team, Cocodrilos de Caracas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHonolulu County: m.03fb3t | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder | location.location : time_zones, people_born_here, contains, containedby | government.government_office_category : officeholders | type.object : type | location.us_state : capital | time.time_zone : locations_in_this_time_zone | location.statistical_region : consumer_price_index | government.governmental_jurisdiction : governing_officials | people.person : nationality | common.topic : notable_types | people.deceased_person : cause_of_death\n\n\nquestion:\n\nWhat is the Time zone in the state with the Capital of Honolulu?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.us_state.capital ns:m.03fb3t .\n?c ns:location.location.time_zones ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hawaii-Aleutian Time Zone"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSt. John's Catholic Elementary School: m.0jwh_hy | College/University: m.01y2hnl | education.educational_institution : mascot, school_type, colors | common.topic : notable_types | type.object : type | location.location : containedby | symbols.namesake : named_after | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | organization.organization : date_founded, parent | education.education : institution | people.person : education | kg.object_profile : prominent_type | sports.sports_team : colors | organization.organization_relationship : parent\n\n\nquestion:\n\nWhat college did the President who attended St. John's Catholic Elementary School attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0jwh_hy .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Yale Law School, Edmund A. Walsh School of Foreign Service, University of Oxford, University Yale, Georgetown University, University College, Oxford"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSiege of Vicksburg: m.01hf7f | Jackson: m.043yj | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : office_holder | location.country : second_level_divisions | location.location_symbol_relationship : Kind_of_symbol | base.culturalevent.event : entity_involved | time.event : locations | location.us_state : capital\n\n\nquestion:\n\nWhat state with capital city named Jackson did the Battle of Vicksburg occur?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01hf7f ns:time.event.locations ?x .\n?x ns:location.us_state.capital ns:m.043yj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mississippi"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nConcord: m.01x96 | Northeastern United States: m.027rjr | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : basic_title, office_holder, legislative_sessions | location.location : events, adjoin_s, people_born_here, contains, containedby | location.adjoining_relationship : adjoins | common.topic : notable_types | government.political_district : representatives | location.us_state : capital | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value\n\n\nquestion:\n\nConcord is the capital of which US State in the North East?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027rjr ns:location.location.contains ?x .\n?x ns:location.us_state.capital ns:m.01x96 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Hampshire"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGeneral Motors Commercial Corp: m.09m51hn | education.educational_institution : sports_teams, students_graduates, colors | education.education : student | business.business_operation : industry | type.object : type | fictional_universe.school_in_fiction : students_graduates | sports.sports_team : sport, championships | location.location : containedby | common.topic : notable_types | architecture.structure : height_meters | organization.organization : date_founded | kg.object_profile : prominent_type | government.political_party : politicians_in_this_party | government.political_party_tenure : politician\n\n\nquestion:\n\nWhat is the child organization that branched from the General Motors Commerical Corporation?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.09m51hn .\n?c ns:business.business_operation.industry ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Automotive industry, Motor Vehicles and Passenger Car Bodies"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEast Caribbean dollar: m.02r4k | United Kingdom: m.07ssc | kg.object_profile : prominent_type | location.country : currency_used, administrative_divisions, calling_code, official_language, languages_spoken, form_of_government | type.object : type | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.location : contains, containedby | finance.currency : countries_used\n\n\nquestion:\n\nWhat country that uses the East Caribbean dollar is a trading partner of the uk?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.07ssc ns:location.statistical_region.places_exported_to ?y . # United Kingdom\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.07ssc ns:location.statistical_region.places_exported_from ?y . # United Kingdom\n?y ns:location.imports_and_exports.exported_from ?x .\n}?x ns:location.country.currency_used ns:m.02r4k .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Anguilla"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1992 NBA Finals: m.08x9nn | government.politician : government_positions_held | government.government_position_held : from, to | people.deceased_person : place_of_death | people.ethnicity : languages_spoken | people.person : profession, nationality, gender | time.event : end_date, start_date, instance_of_recurring_event, included_in_event | type.object : type | film.producer : film | location.location : partially_contains, contains, containedby | common.topic : notable_types | organization.organization : founders | kg.object_profile : prominent_type | sports.sports_team : championships | government.political_appointer : appointees | music.composer : compositions | base.activism.activist : area_of_activism | fictional_universe.fictional_character : gender | influence.influence_node : influenced_by | location.country : form_of_government | religion.religion : texts | baseball.baseball_player : batting_stats | baseball.batting_statistics : season | base.culturalevent.event : entity_involved | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : team\n\n\nquestion:\n\nWhat year was the first championship win of the team who won the 1992 NBA Finals?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.08x9nn .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1991 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEd Woodward: m.0wjm5zg | people.person : religion, children, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | american_football.football_player : position_s | people.deceased_person : date_of_death | sports.sports_team : championships | government.politician : government_positions_held | government.government_position_held : jurisdiction_of_office, governmental_body | common.topic : notable_types | type.object : type | music.featured_artist : recordings | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhen was the first trophy won by the organization led by Ed Woodward?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0wjm5zg .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1976–77 FA Cup"
    }
]