[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCosta Rican colón: m.04wccn | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to | people.person : profession, nationality, date_of_birth, place_of_birth, gender | time.event : locations | type.object : name, type | location.country : currency_used, languages_spoken | government.form_of_government : countries | location.location : people_born_here, contains, containedby | organization.organization : founders | finance.currency : countries_used, countries_formerly_used | travel.tourist_attraction : near_travel_destination | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | film.film : subjects | government.government_office_or_title : office_holders | base.unitednations.united_nations_body_membership : member | people.deceased_person : date_of_death | symbols.namesake : named_after | media_common.netflix_title : netflix_genres | language.human_language : main_country | kg.object_profile : prominent_type\n\n\nquestion:\n\nPeople from the country that uses the Costa Rican Colon speak what languages?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.04wccn .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bribri Language, Jamaican Creole English Language, Limonese Creole, Spanish Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nthe united kingdom of great britain: m.014tss | American Revolutionary War: m.0jnh | military.military_conflict : commanders | military.military_command : military_commander, military_conflict | people.person : date_of_birth, nationality | government.political_appointer : appointees | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, to | government.politician : government_positions_held | time.event : locations, start_date, end_date, includes_event, included_in_event | base.culturalevent.event : entity_involved | military.military_person : participated_in_conflicts, service | location.country : currency_used, capital, form_of_government | government.governmental_jurisdiction : governing_officials | military.military_service : unit | military.military_combatant : casualties | military.casualties : military_conflict | military.military_commander : military_commands | people.deceased_person : place_of_burial, date_of_death | common.topic : notable_types | type.object : type | location.location : containedby, people_born_here\n\n\nquestion:\n\nWho held their governmental position from 1786 and was the British General of the Revolutionary War?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jnh ns:military.military_conflict.commanders ?y .\n?y ns:military.military_command.military_commander ?x .\n?x ns:people.person.nationality ns:m.014tss .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1786\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Charles Cornwallis, 1st Marquess Cornwallis"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKevin McHale: m.04b87b | government.politician : government_positions_held | government.government_position_held : basic_title, from, to, jurisdiction_of_office | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | location.location : containedby | basketball.basketball_team : head_coach | media_common.netflix_title : netflix_genres | people.deceased_person : date_of_death | sports.sports_team : championships\n\n\nquestion:\n\nIn what year did the basketball team whose head coach is Kevin McHale win their first championship game?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:basketball.basketball_team.head_coach ns:m.04b87b .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1994 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Cry of Love Tour: m.04gkgs_ | type.object : type | location.location : contains, people_born_here | music.artist : genre, concert_tours | people.person : date_of_birth, profession, languages | music.genre : albums | book.book_subject : works | influence.influence_node : influenced_by | organization.organization : date_founded | music.composition : composer | film.film_job : films_with_this_crew_job | film.film_crew_gig : crewmember | kg.object_profile : prominent_type | music.instrument : family | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film : genre, starring, initial_release_date | language.human_language : countries_spoken_in | film.performance : actor | people.deceased_person : cause_of_death\n\n\nquestion:\n\nWhat style of music did the artist that went to Cry of Love Tour play?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.04gkgs_ .\n?c ns:music.artist.genre ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Blues, Acid rock, Blues rock, Heavy metal, Psychedelic rock, Rock music, Rhythm and blues, Experimental rock, Funk rock, Psychedelia, Progressive rock, Hard rock"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRathfarnham: m.02bm4m | kg.object_profile : prominent_type | type.object : type | location.location : time_zones, contains, containedby | architecture.structure : height_meters | common.topic : notable_types | people.person : nationality | architecture.building : floors\n\n\nquestion:\n\nA person from Rathfarnham is of what nationality?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.02bm4m .\n?c ns:people.person.nationality ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "India, Ottoman Empire"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMustang: m.02_fkk | Jackie Robinson: m.0443c | people.person : profession, nationality, ethnicity, education, height_meters, gender | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : sport | symbols.name_source : namesakes | education.educational_institution : mascot, students_graduates | military.military_person : participated_in_conflicts | sports.sports_team_roster : team, position | baseball.baseball_player : batting_stats, position_s | baseball.batting_statistics : season, team | type.object : type | common.topic : notable_types | influence.influence_node : influenced | education.school : nces_school_id, highest_grade_taught | education.education : institution, student | location.location : containedby | organization.organization : headquarters, date_founded | american_football.football_player : position_s | symbols.namesake : named_after | people.deceased_person : cause_of_death\n\n\nquestion:\n\nWhat educational institution that has a mascot named Mustang did Jackie Robinson go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0443c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.mascot ns:m.02_fkk .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "John Muir High School"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Colombia: m.01prgy | location.location : containedby, people_born_here | government.government_position_held : basic_title, office_holder, jurisdiction_of_office | government.politician : government_positions_held | type.object : type | people.person : religion, children, profession, nationality, languages, place_of_birth, gender | people.deceased_person : cause_of_death, place_of_death | geography.river : basin_countries | common.topic : notable_types | government.form_of_government : countries\n\n\nquestion:\n\nThe nation with National Anthem of Colombia as its national anthem is located in which geographic regions?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01prgy .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "South America, Americas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMargrethe II of Denmark: m.0g2kv | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | film.producer : film | government.politician : government_positions_held, party | type.object : type | kg.object_profile : prominent_type | government.government_position_held : office_holder, district_represented, basic_title, from, jurisdiction_of_office, to, governmental_body | government.political_party_tenure : party | location.country : languages_spoken | military.military_person : participated_in_conflicts | people.deceased_person : date_of_death, place_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport\n\n\nquestion:\n\nWhat language is spoken in the location that appointed Margrethe II of Denmark to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0g2kv .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Danish Language, Greenlandic language, Faroese, German Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJessica Simpson: m.0c7xjb | Marriage: m.04ztj | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | kg.object_profile : prominent_type | people.marriage : type_of_union, spouse, from | book.book_subject : works | people.person : spouse_s | location.statistical_region : consumer_price_index | music.artist : genre | sports.pro_athlete : career_start | location.country : second_level_divisions\n\n\nquestion:\n\nWhat pro athlete married to Jessica Simpson started his career in 2000?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0c7xjb ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\n?x ns:sports.pro_athlete.career_start \"2000\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Eric Johnson"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDeion Sanders: m.03n69x | Baseball: m.018jz | George Steinbrenner: m.01q5t3 | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.location : contains, people_born_here | award.award_nominee : award_nominations | award.award_nomination : award | sports.sports_team : team_mascot, sport, championships | common.topic : notable_types | location.statistical_region : population | measurement_unit.dated_integer : number | film.film_subject : films | people.person : profession | sports.professional_sports_team : owner_s | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : career_end\n\n\nquestion:\n\nWhat sports team owned by George  Steinbrenner did Deion Sanders play baseball for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03n69x ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.sport ns:m.018jz .\n?x ns:sports.professional_sports_team.owner_s ns:m.01q5t3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York Yankees"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaylor Lautner: m.07ldhs | film.actor : film | film.performance : character, actor, film | kg.object_profile : prominent_type | people.person : religion, profession, nationality, place_of_birth, gender | tv.tv_series_episode : episode_number, season_number | common.topic : image, notable_types | award.award_nominee : award_nominations | award.award_nomination : nominated_for | type.object : type | tv.tv_program : episode_running_time | film.film : prequel, starring, sequel\n\n\nquestion:\n\nWhich film had no TV series based on it and starred Taylor Lautner?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:tv.tv_series_episode.season_number \"0\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "He's a Bully, Charlie Brown"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSecretary of State: m.0789n | Andrew Jackson: m.0rlz | location.location : contains, people_born_here | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, to, from, jurisdiction_of_office, appointed_by, governmental_body | location.statistical_region : co2_emissions_per_capita | government.politician : government_positions_held, party | government.governmental_jurisdiction : governing_officials | symbols.name_source : namesakes | location.country : second_level_divisions | government.government_office_category : officeholders | government.political_party_tenure : party | government.political_appointer : appointees\n\n\nquestion:\n\nWhen Andrew Jackson was president and held his governmental position from 1795, who was the Secretary of State?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0rlz ns:government.political_appointer.appointees ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.0789n .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1795\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Edward Livingston"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDaniel Snyder: m.04pn7c | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.sports_team : location | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | kg.object_profile : prominent_type | people.deceased_person : cause_of_death | government.politician : government_positions_held, party | type.object : type | government.political_party_tenure : party | sports.professional_sports_team : owner_s | government.government_position_held : jurisdiction_of_office | music.artist : genre | fictional_universe.fictional_character : place_of_birth | film.film : film_art_direction_by\n\n\nquestion:\n\nWhat is the home town of the NFL team owned by Daniel Snyder?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.04pn7c .\n?c ns:sports.sports_team.location ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington, D.C."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTyler Crowley: m.05m1x3_ | Jacob Black: m.02qd_td | government.politician : government_positions_held, party | type.object : type | people.person : religion, profession, nationality, ethnicity, date_of_birth, height_meters, place_of_birth, gender | government.political_party_tenure : party | government.us_vice_president : vice_president_number | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | kg.object_profile : prominent_type | government.government_position_held : from, jurisdiction_of_office | film.film : starring | music.artist : genre | film.performance : character, actor | law.judge : courts | law.judicial_tenure : title | people.deceased_person : place_of_death\n\n\nquestion:\n\nIn the film with the character named Tyler Crowley, who played Jacob Black?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.05m1x3_ .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.02qd_td .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Taylor Lautner"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nChernivtsi Oblast: m.01_07_ | Country: m.01mp | Romania: m.06c1y | location.country : administrative_divisions, form_of_government | film.film_location : featured_in_films | location.location : events, adjoin_s, time_zones, people_born_here, contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | kg.object_profile : prominent_type | type.object : name, type | common.topic : notable_types | organization.organization_member : member_of | organization.organization_membership : organization | location.adjoining_relationship : adjoins | location.statistical_region : size_of_armed_forces, gdp_real | measurement_unit.adjusted_money_value : adjusted_value | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat European country bordering Romania also contains Chernivtsi Oblast?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06c1y ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.01_07_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ukraine"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAfghan afghani: m.019vxc | Osama bin Laden: m.05mg9 | location.country : currency_formerly_used, currency_used, administrative_divisions, calling_code, official_language | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | engineering.location_with_mains_power : mains_power_standards | engineering.mains_power : compatible_plugs | location.statistical_region : major_exports, lending_interest_rate, size_of_armed_forces, religions | location.religion_percentage : religion | type.object : type | film.film_subject : films | measurement_unit.dated_percentage : date | people.person : places_lived, profession, languages | military.military_person : participated_in_conflicts | people.deceased_person : cause_of_death | location.location : contains | finance.currency : countries_used | measurement_unit.dated_integer : number | common.topic : notable_types | location.imports_exports_by_industry : industry | people.place_lived : location\n\n\nquestion:\n\nWhat country did Osama bin Laden live in that uses Afghan Afghani?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05mg9 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:location.country.currency_used ns:m.019vxc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Afghanistan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNestle Belarusia: m.075sdjl | business.business_operation : industry | type.object : type | kg.object_profile : prominent_type | location.location : containedby | common.topic : notable_types | organization.organization : child, date_founded, founders | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | people.person : nationality | education.educational_institution : school_type | government.government_office_or_title : office_holders | government.government_position_held : from | sports.sports_team : founded, colors | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | organization.organization_relationship : child\n\n\nquestion:\n\nWhat organization is owned by Nestle Belarusia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.075sdjl .\n?c ns:business.business_operation.industry ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Food processing, Ice Cream and Frozen Dessert Manufacturing, Soft Drink Manufacturing, Bottled Water Manufacturing, Cookies and Crackers, Chocolate and Cocoa Products, Bottled and Canned Soft Drinks and Carbonated Waters"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nYardymli District: m.055njn | location.location : time_zones, adjoin_s, containedby | kg.object_profile : prominent_type | common.topic : notable_types | location.country : administrative_divisions | location.adjoining_relationship : adjoins | type.object : type | architecture.structure : opened | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder\n\n\nquestion:\n\nWhat country has Yardymli District in it?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.055njn .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Eurasia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nOral Fixation Tour: m.0g2n_6 | government.politician : government_positions_held | type.object : type | film.film_subject : films | media_common.netflix_genre : titles | people.person : religion, profession, place_of_birth, gender | people.deceased_person : cause_of_death, place_of_death | law.invention : inventor | location.location : contains, people_born_here | sports.sports_championship_event : champion | biology.breed_origin : breeds_originating_here | time.event : end_date, start_date, included_in_event | music.artist : origin, concert_tours | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | kg.object_profile : prominent_type | influence.influence_node : influenced_by, influenced | people.ethnicity : languages_spoken | location.statistical_region : co2_emissions_commercial | base.culturalevent.event : entity_involved | fictional_universe.fictional_setting : characters_that_have_lived_here | biology.animal_breed : place_of_origin\n\n\nquestion:\n\nWhere is the Oral Fixation Tour artist from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0g2n_6 .\n?c ns:music.artist.origin ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colombia"
    }
]