[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRetsina: m.01jg9j | Country: m.01mp | location.location : people_born_here, partially_containedby, contains, containedby | common.topic : notable_types | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | architecture.structure : opened | government.form_of_government : countries | time.event : locations | people.deceased_person : cause_of_death | language.human_language : language_family | government.government_office_or_title : office_holders | government.government_position_held : basic_title, office_holder | wine.wine_region : wine_styles | type.object : type | film.film : country | geography.river : basin_countries | government.politician : government_positions_held | government.government_office_category : officeholders | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat are the bordering countries to the wine regions that produce Retsina wine?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:wine.wine_region.wine_styles ns:m.01jg9j .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria, Turkey, Republic of Macedonia, Albania"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSouth Hwanghae Province: m.022g39 | common.topic : notable_types | location.location : time_zones, contains, containedby | type.object : type | location.country : administrative_divisions, form_of_government | architecture.building : floors | kg.object_profile : prominent_type\n\n\nquestion:\n\nThe country that contains the South Hwanghae Province has what type of government?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.022g39 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Juche, Socialist state, Single-party state"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTao Te Ching: m.02czn | location.location : contains | type.object : type | book.written_work : subjects, author | common.topic : notable_types | influence.influence_node : influenced_by, influenced | religion.religion : deities, beliefs, texts | film.film : country | people.person : profession, nationality | book.book_subject : works | symbols.name_source : namesakes | book.book : genre | government.politician : government_positions_held\n\n\nquestion:\n\nWhich gods are worshipped in the religious text Tao Te Ching?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.texts ns:m.02czn .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "He Xiangu, Cao Guojiu, Li Tieguai, Lan Caihe, Lü Dongbin, Han Xiangzi, Zhang Guolao, Zhongli Quan, Jade Emperor, Queen Mother of the West, Three Pure Ones, Magu, Yuanshi Tianzun, Cai Shen"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nImperial anthems of the Ottoman Empire: m.070xtc | people.person : religion, children, profession, nationality, ethnicity, places_lived, place_of_birth, gender | location.location : people_born_here, contains, containedby | location.country : capital | kg.object_profile : prominent_type | people.place_lived : location | language.human_language : main_country | base.culturalevent.event : entity_involved | government.form_of_government : countries | type.object : name, type | religion.religion : deities, places_of_worship, types_of_places_of_worship, notable_figures, texts, organizations, founding_figures | common.topic : notable_types | finance.currency : countries_used, countries_formerly_used | people.deceased_person : cause_of_death | book.book_subject : works | government.politician : government_positions_held\n\n\nquestion:\n\nWhat religion does the country whose national anthem is \"Imperial Anthems of the Ottoman Empire Turks\" follow?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.070xtc .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Christianity, Judaism, Eastern Christianity, Catholicism, Islam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPresident of the European Council: m.02vk5s1 | language.human_language : dialects, countries_spoken_in | location.location : time_zones, events, contains, people_born_here | government.politician : government_positions_held | type.object : type | people.person : profession, nationality, gender | government.political_appointer : appointees | government.government_position_held : office_holder, district_represented, basic_title, jurisdiction_of_office, governmental_body | law.court : jurisdiction | government.government_office_category : officeholders | government.governmental_body : members | location.statistical_region : size_of_armed_forces, gdp_real | measurement_unit.dated_integer : number | media_common.netflix_genre : titles | measurement_unit.adjusted_money_value : adjusted_value | location.country : administrative_divisions\n\n\nquestion:\n\nWhat are the official languages in the country that has a President of the European Council?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.role ns:m.02vk5s1 .\n?c ns:user.ktrueman.default_domain.international_organization.official_language_s ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Dutch Language, English Language, Greek Language, German Language, Polish Language, Portuguese Language, French, Swedish Language, Spanish Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQuarterback: m.06b1q | Baltimore Ravens: m.01ct6 | sports.sports_team : roster | type.object : type | sports.sports_team_roster : player, position, from, team, to | people.person : height_meters, nationality, place_of_birth, gender | american_football.football_player : passing, position_s | kg.object_profile : prominent_type | american_football.player_passing_statistics : attempts | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : career_start\n\n\nquestion:\n\nWhat pro quarterback began his career in 1993 and was a memebr fo the 2012 Baltimore Ravens?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01ct6 ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.position ns:m.06b1q .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.pro_athlete.career_start \"1993\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Trent Dilfer"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCrete: m.01xyy | location.location : time_zones, area, contains, containedby | common.topic : notable_types | kg.object_profile : prominent_type | type.object : type | location.administrative_division : country | architecture.structure : opened, height_meters | location.country : administrative_divisions | medicine.disease : parent_disease | influence.influence_node : influenced_by | architecture.venue : capacity\n\n\nquestion:\n\nWhere is the country located that contains Crete?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01xyy .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Europe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSociety of Jesus: m.04399 | people.person : religion, profession, date_of_birth, nationality, education, spouse_s, gender | location.location : containedby | people.marriage : spouse | common.topic : notable_types | film.producer : film | location.country : languages_spoken | influence.influence_node : influenced_by, influenced | education.educational_institution : school_type | government.politician : government_positions_held | government.government_position_held : office_position_or_title, from, jurisdiction_of_office | people.deceased_person : cause_of_death, date_of_death, place_of_death | kg.object_profile : prominent_type | type.object : type | sports.pro_athlete : career_end | education.education : institution | base.culturalevent.event : entity_involved | sports.sports_team : sport | medicine.notable_person_with_medical_condition : condition\n\n\nquestion:\n\nWhat language does the religious organization under the leadership of the Society of Jesus speak?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.04399 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Guaraní language, Quechuan languages, Spanish Language, Yiddish Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEl Rodeo School: m.04f1d50 | location.location : time_zones, contains, containedby | architecture.structure : opened, height_meters | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | education.educational_institution : colors | people.person : parents\n\n\nquestion:\n\nWho are the parents of the famous person who went to El Rodeo School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.04f1d50 .\n?c ns:people.person.parents ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Marcheline Bertrand, Jon Voight"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAsian College of Science and Technology, main campus: m.0jwbft1 | kg.object_profile : prominent_type | location.location : time_zones, events, contains, containedby | type.object : type | common.topic : notable_types | film.film : language | organization.organization : date_founded | location.country : form_of_government\n\n\nquestion:\n\nWhat type of government is in the country that has Asian College of Science and Technology, Main Campus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.0jwbft1 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Unitary state, Republic, Constitutional republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAuburn University Aubie: m.067twr | music.artist : genre, origin | people.person : religion, profession, nationality, parents, education, date_of_birth, height_meters, place_of_birth, gender | location.location : containedby | government.politician : government_positions_held | government.government_position_held : legislative_sessions, governmental_body | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | type.object : type | influence.influence_node : influenced_by | film.actor : film | film.performance : character, film | education.educational_institution : mascot | common.topic : notable_types | organization.organization : founders | education.education : major_field_of_study\n\n\nquestion:\n\nWhere is the college has the mascot named Auburn University Aubie?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.mascot ns:m.067twr .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Auburn University Historic District, United States of America, Alabama, Auburn"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSouthern Region, Iceland: m.02hq5qh | location.location : time_zones, people_born_here, contains, containedby | location.country : administrative_divisions, languages_spoken | common.topic : notable_types | type.object : type | kg.object_profile : prominent_type | architecture.building : floors, building_complex | government.politician : government_positions_held | architecture.structure : opened\n\n\nquestion:\n\nWhat spoken language is used in the country that has Southern Region, Iceland?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02hq5qh .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Icelandic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTrelawny Parish: m.06qrc3 | location.country : official_language, administrative_divisions | location.location : time_zones, people_born_here, contains, containedby | location.administrative_division : country | common.topic : notable_types | architecture.structure : height_meters | type.object : type | kg.object_profile : prominent_type | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nWhich languages are recognized as the official ones in the nation where Trelawny Parish is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.06qrc3 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jamaican English"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCanada: m.0d060g | church building: m.01wb7 | architecture.building_function : buildings | location.statistical_region : population, consumer_price_index, cpi_inflation_rate, gdp_real, foreign_direct_investment_net_inflows, long_term_unemployment_rate, size_of_armed_forces, net_migration | measurement_unit.dated_integer : number | type.object : type | religion.religion : places_of_worship, types_of_places_of_worship, texts, is_part_of | measurement_unit.adjusted_money_value : adjusted_value | location.location : events, adjoin_s, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title, appointed_by, governmental_body | measurement_unit.dated_percentage : rate | location.adjoining_relationship : adjoins | location.country : languages_spoken | measurement_unit.dated_money_value : amount\n\n\nquestion:\n\nWhat religion with places of worship including Churches is recognized in Canada?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d060g ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.types_of_places_of_worship ns:m.01wb7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAppalachian Mountains: m.0lm0n | Boston: m.01cx_ | location.location : time_zones, people_born_here, partially_containedby, contains, containedby | location.citytown : postal_codes | government.governmental_jurisdiction : government_bodies, governing_officials, official_symbols | government.government_position_held : office_holder | tv.tv_location : tv_episodes_filmed_here | type.object : type | location.us_state : capital | location.location_symbol_relationship : Kind_of_symbol | government.political_district : representatives\n\n\nquestion:\n\nWhat geographic region through which the Appalachian Mountains extend is the location whose central government is in Boston?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0lm0n ns:location.location.partially_containedby ?x .\n?x ns:location.us_state.capital ns:m.01cx_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Massachusetts"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBridgetown: m.0fn5r | type.object : type | location.location : time_zones, containedby, people_born_here | kg.object_profile : prominent_type | common.topic : notable_types | location.country : capital, currency_used | architecture.building : floors | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nWhat currency is used in the country where the capital is Bridgetown?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0fn5r .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barbadian dollar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAlan Cohen: m.03wf82n | people.person : religion, profession, nationality, parents, date_of_birth, height_meters, place_of_birth, gender | film.film : language, genre | location.location : containedby | people.deceased_person : cause_of_death, place_of_death | sports.sports_team : arena_stadium | type.object : type | time.event : start_date | kg.object_profile : prominent_type | government.politician : government_positions_held, party | government.political_party_tenure : party | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.government_position_held : office_position_or_title, jurisdiction_of_office | common.topic : notable_types | sports.professional_sports_team : owner_s | american_football.football_player : position_s\n\n\nquestion:\n\nWhere does team owner Alan Cohen's sports team play?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.03wf82n .\n?c ns:sports.sports_team.arena_stadium ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "BB&T Center, Miami Arena"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTrigemal neuralgia: m.05sswr_ | medicine.disease : parent_disease | kg.object_profile : prominent_type | type.object : type | organization.organization : place_founded, founders | book.book_subject : works | organization.organization_founder : organizations_founded | location.location : contains, people_born_here | medicine.notable_person_with_medical_condition : condition | people.cause_of_death : parent_cause_of_death\n\n\nquestion:\n\nWhat did the person who had Trigemal Neuralgia found?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:medicine.notable_person_with_medical_condition.condition ns:m.05sswr_ .\n?c ns:organization.organization_founder.organizations_founded ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Coalition of Labor Union Women, Choice USA, Ms. Foundation for Women, National Women's Political Caucus, New York Media, LLC, Women's Action Alliance, Feminist Majority Foundation"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAntonis Samaras: m.054q0_ | people.person : religion, profession, nationality, date_of_birth, height_meters, gender | government.politician : government_positions_held, party | government.government_position_held : basic_title, from, jurisdiction_of_office, to, governmental_body | type.object : type | government.political_party_tenure : party | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | military.military_person : participated_in_conflicts | location.country : currency_used | people.deceased_person : cause_of_death, place_of_death | american_football.football_player : position_s\n\n\nquestion:\n\nWhat currency is used in the location where Antonis Samaras was appointed to a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.054q0_ .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Euro"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLa Guajira Department: m.08rct3 | President: m.060c4 | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | common.topic : notable_types | people.person : religion | architecture.structure : opened, height_meters | type.object : type | location.location : time_zones, contains, containedby | location.country : administrative_divisions | kg.object_profile : prominent_type\n\n\nquestion:\n\nThe nation with La Guajira Department 2011 has who as its president today?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.08rct3 .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Juan Manuel Santos"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAuburn University: m.01wdj_ | Robert J. Bentley: m.080fp__ | location.country : second_level_divisions, administrative_divisions | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : office_holder, jurisdiction_of_office | location.statistical_region : co2_emissions_per_capita, net_migration, gdp_real | measurement_unit.dated_integer : number | measurement_unit.adjusted_money_value : adjusted_value | type.object : type | organization.organization_founder : organizations_founded | government.political_appointer : appointees\n\n\nquestion:\n\nWhere is the location that appointed Robert J. Bentley to governmental position and Where Auburn University is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01wdj_ ns:location.location.containedby ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.080fp__ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Alabama"
    }
]