[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPacific Time Zone: m.02lcqs | Bradley Walsh: m.05h48b | location.location : time_zones, contains, people_born_here | time.time_zone : locations_in_this_time_zone | people.person : places_lived, nationality | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | film.film_location : featured_in_films | people.place_lived : location\n\n\nquestion:\n\nIn which location, does Bradley Walsh live, where the location time zone, is in the Pacific Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05h48b ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\nEXISTS {?y ns:people.place_lived.end_date ?sk1 .\nEXISTS {?y ns:people.place_lived.start_date ?sk3 .\n?x ns:location.location.time_zones ns:m.02lcqs .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Los Angeles"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBarack Obama: m.02mjmr | Columbia Daily Spectator: m.0b6q54 | location.location : contains, people_born_here | internet.blogger : blog | education.educational_institution : students_graduates, newspaper | education.education : student | government.political_appointer : appointees | government.government_position_held : basic_title, to, office_holder, from | government.politician : government_positions_held | government.governmental_jurisdiction : governing_officials | film.film_location : featured_in_films | type.object : type | people.person : places_lived | people.place_lived : location | symbols.namesake : named_after\n\n\nquestion:\n\nWhere did Obama supposedly go to school that has the newspaper the Columbia Daily Spectator?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.newspaper ns:m.0b6q54 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Columbia University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLopburi Province: m.01kjwm | location.location : containedby, time_zones, people_born_here, partially_containedby, contains, partially_contains | common.topic : notable_types | kg.object_profile : prominent_type | type.object : type | aviation.airport : serves | architecture.structure : height_meters | location.country : currency_used, administrative_divisions | geography.river : basin_countries\n\n\nquestion:\n\nThe country that contains Lopburi Province would require me to take what type of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01kjwm .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thai baht"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nStephen G. Haines: m.06619nf | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | people.deceased_person : date_of_death, place_of_death | type.object : type | common.topic : notable_types | government.politician : government_positions_held, party | government.political_party_tenure : party | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.government_position_held : basic_title, jurisdiction_of_office | kg.object_profile : prominent_type | organization.organization : headquarters\n\n\nquestion:\n\nWhat state is the school where Stephen G. Haines is a grad student in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.students_graduates ?k .\n?k ns:education.education.student ns:m.06619nf .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.state_province_region ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington, D.C."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral European Time Zone: m.02llzg | United Nations Security Council: m.07vnr | time.time_zone : locations_in_this_time_zone | location.location : time_zones, contains | organization.organization_member : member_of | organization.organization_membership : organization\n\n\nquestion:\n\nWhat Central European Time Zone countries are member of the Security Council?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07vnr ns:base.unitednations.united_nations_body.members ?y .\n?y ns:base.unitednations.united_nations_body_membership.member ?x .\nEXISTS {?y ns:base.unitednations.united_nations_body_membership.from ?sk1 .\nEXISTS {?y ns:base.unitednations.united_nations_body_membership.to ?sk3 .\n?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Croatia, France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\ngeorge iv: m.0b0sx | Queen Victoria: m.0cw10 | government.government_office_category : officeholders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to | government.political_appointer : appointees | government.governmental_jurisdiction : governing_officials | government.politician : government_positions_held | type.object : type | symbols.name_source : namesakes | people.person : gender\n\n\nquestion:\n\nWhat country that Queen Victoria ruled that appointed George IV of the UK to a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0cw10 ns:government.political_appointer.appointees ?y .\n?y ns:government.government_position_held.jurisdiction_of_office ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.0b0sx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "The Canadas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQunu, Eastern Cape: m.0b3jmh | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type | people.person : religion | education.educational_institution : students_graduates | education.education : student | organization.organization : date_founded\n\n\nquestion:\n\nWhat is the religion belief of the person who once lived in Qunu, Eastern Cape?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.0b3jmh .\n?c ns:people.person.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Methodism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Russia: m.01ptxd | organization.organization : date_founded | type.object : type | common.topic : notable_types | location.location : area, containedby | kg.object_profile : prominent_type | geography.river : cities | sports.pro_athlete : career_start | people.deceased_person : cause_of_death | people.person : nationality, place_of_birth, ethnicity | government.politician : government_positions_held | government.government_position_held : basic_title | transportation.bridge : locale | location.country : official_language\n\n\nquestion:\n\nWhat is the name of the language where The National Anthem of Russia is used?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01ptxd .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Russian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLyon: m.0dprg | Country: m.01mp | Spain: m.06mkj | location.location : contains, people_born_here | time.time_zone : locations_in_this_time_zone | location.country : languages_spoken | type.object : name | common.topic : notable_types\n\n\nquestion:\n\nLyon is a city/town in what country surrounding Spain?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mkj ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0dprg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQuarterback: m.06b1q | Serena Williams: m.015z4j | type.object : type | location.location : contains, people_born_here | sports.sports_team_roster : team, position | sports.sports_team : roster | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : sport | people.person : religion, profession, nationality, ethnicity, gender | time.event : start_date, locations | government.governmental_jurisdiction : official_symbols | sports.professional_sports_team : owner_s | location.statistical_region : co2_emissions_per_capita | people.deceased_person : cause_of_death, place_of_death | government.form_of_government : countries | kg.object_profile : prominent_type | american_football.football_player : position_s | location.country : official_language | film.film_subject : films\n\n\nquestion:\n\nWho is Serena Williams sports team quarterback?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.015z4j .\n?c ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.position ns:m.06b1q .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Matt Moore, Ryan Tannehill"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUlsan: m.01vsdq | type.object : type | common.topic : notable_types | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | location.country : administrative_divisions, form_of_government | aviation.airport : serves | architecture.structure : height_meters\n\n\nquestion:\n\nThe country that includes Ulsan uses what system of government?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01vsdq .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Unitary state, Constitutional republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLyon: m.0dprg | Western Europe: m.0852h | location.location : people_born_here, containedby, contains, partially_contains | location.country : administrative_divisions, capital, second_level_divisions, languages_spoken, form_of_government | type.object : type | location.mailing_address : citytown | media_common.netflix_genre : titles | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_position_or_title | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | kg.object_profile : prominent_type | film.film_location : featured_in_films | organization.organization : place_founded | military.military_combatant : casualties | military.casualties : military_conflict | location.administrative_division : country\n\n\nquestion:\n\nLyon is a city/town in what Western European country?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0852h ns:location.location.contains ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0dprg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVirginia: m.07z1m | United States Senate: m.07t58 | government.political_district : representatives | people.person : profession, nationality, gender | type.object : type | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | government.politician : government_positions_held | people.deceased_person : cause_of_death, date_of_death | government.governmental_jurisdiction : governing_officials | government.government_office_category : officeholders | government.political_appointer : appointees | location.location : people_born_here\n\n\nquestion:\n\nWho was the Virginia Senator in 2013 that held his government position from 5-1-1987?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07z1m ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.governmental_body ns:m.07t58 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1987-05-01\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jim Webb"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGilbert Islands: m.0101msg_ | Japan: m.03_3d | location.location : contains, containedby | type.object : type | location.country : capital, administrative_divisions | measurement_unit.dated_percentage : rate | government.governmental_jurisdiction : governing_officials | travel.travel_destination : tourist_attractions | location.statistical_region : places_exported_to | location.imports_and_exports : exported_to | government.government_position_held : basic_title, office_holder | sports.sports_team_location : teams\n\n\nquestion:\n\nWhat country includes the GIlbert Islands and imports good from Japan?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03_3d ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n?x ns:location.country.administrative_divisions ns:m.0101msg_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kiribati"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nest: m.02hcv8 | Jeb Bush: m.019x9z | location.location : time_zones, contains, people_born_here | government.political_district : representatives | government.government_position_held : office_holder, appointed_by | government.governmental_jurisdiction : governing_officials | time.time_zone : locations_in_this_time_zone | location.statistical_region : population, co2_emissions_per_capita | measurement_unit.dated_integer : number | people.person : parents\n\n\nquestion:\n\nWhere in the Eastern Time Zone does Jeb Bush live?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.019x9z ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\nEXISTS {?y ns:people.place_lived.end_date ?sk1 .\nEXISTS {?y ns:people.place_lived.start_date ?sk3 .\n?x ns:location.location.time_zones ns:m.02hcv8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Coral Gables"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNassau Weekly: m.08zwhp | F. Scott Fitzgerald: m.02zjd | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | influence.influence_node : influenced_by, peers, influenced | type.object : type | people.person : religion, quotations, children, profession, nationality, education, place_of_birth, gender | influence.peer_relationship : peers | book.author : book_editions_published | education.education : institution, student | organization.organization : date_founded | education.educational_institution : school_type, newspaper, sports_teams, students_graduates | people.deceased_person : place_of_death | location.location : containedby | film.writer : film | common.topic : notable_types | fictional_universe.school_in_fiction : students_graduates | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | media_common.dedicator : dedications | media_common.dedication : work_dedicated\n\n\nquestion:\n\nThe Nassau Weekly is the newspaper of which educational institution F Scott Fitzgerald attended?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02zjd ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.newspaper ns:m.08zwhp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Princeton University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1995 World Series: m.04j712 | time.recurring_event : instances | sports.sports_championship : events | type.object : type | sports.sports_team : arena_stadium, colors, team_mascot, sport, previously_known_as, championships, roster | time.event : end_date, start_date | sports.sports_facility : teams | baseball.baseball_team : current_manager | common.topic : notable_types\n\n\nquestion:\n\nWhat years did the team who won the 1995 championship win the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04j712 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1995 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJames D. Stern: m.0ggb8tz | government.politician : government_positions_held | type.object : type | location.location : people_born_here, containedby | music.artist : genre | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.government_position_held : basic_title, from, jurisdiction_of_office, to, governmental_body | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | film.film : release_date_s, country | kg.object_profile : prominent_type | common.topic : notable_types | american_football.football_player : position_s | people.deceased_person : cause_of_death, date_of_death, place_of_death | sports.professional_sports_team : owner_s | basketball.basketball_team : head_coach | military.military_person : participated_in_conflicts\n\n\nquestion:\n\nWho is the current coach of the sports team owned by James D. Stern?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.0ggb8tz .\n?c ns:basketball.basketball_team.head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tom Thibodeau"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2007 AFC Championship Game: m.0_gt_mg | time.event : end_date, start_date, locations, instance_of_recurring_event | sports.sports_championship_event : championship, champion, runner_up | type.object : type | award.award_category : date_established | people.person : profession, height_meters, place_of_birth, gender | architecture.venue : capacity | common.topic : notable_types | time.recurring_event : instances | film.film_subject : films | location.location : containedby, contains, people_born_here | kg.object_profile : prominent_type | sports.pro_athlete : teams, sports_played_professionally | sports.sports_team_roster : team | film.actor : film | film.performance : character | american_football.football_team : division | sports.sports_team : championships | sports.pro_sports_played : sport\n\n\nquestion:\n\nWhich division did the 2007 AFC champions play in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gt_mg .\n?c ns:american_football.football_team.division ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "AFC South"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPerspective: m.021hz5 | location.us_state : capital | architecture.building_function : buildings | type.object : type | organization.organization_founder : organizations_founded | people.person : religion, quotations, profession, place_of_birth, gender | common.topic : notable_types | language.human_language : countries_spoken_in | government.governmental_jurisdiction : official_symbols | location.location_symbol_relationship : Kind_of_symbol | film.film_genre : films_in_this_genre | time.event : includes_event, start_date, locations, included_in_event | influence.influence_node : influenced | location.location : events, contains, people_born_here | visual_art.visual_artist : art_forms, associated_periods_or_movements | sports.sports_championship_event : championship, champion | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | award.award_nominee : award_nominations | award.award_nomination : nominated_for | fictional_universe.fictional_setting : characters_that_have_lived_here | time.recurring_event : instances | education.educational_institution : school_type | base.culturalevent.event : entity_involved\n\n\nquestion:\n\nWhat style of art did the person who majored in Perspective do?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.major_field_of_study ns:m.021hz5 .\n?c ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Post-Impressionism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMountain Time Zone: m.02hczc | Missouri River: m.04ykz | location.location : time_zones, partially_containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : co2_emissions_per_capita, part_time_employment_percent | measurement_unit.dated_percentage : rate | time.time_zone : locations_in_this_time_zone | government.political_district : elections, representatives | location.country : second_level_divisions\n\n\nquestion:\n\nWhich states does the Missouri River touch, where the location is in the Mountain Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04ykz ns:location.location.partially_containedby ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:location.location.time_zones ns:m.02hczc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kansas, Montana, Nebraska, North Dakota, South Dakota"
    }
]