[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDallas: m.0f2rq | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.politician : party | government.political_party_tenure : party | government.government_office_category : officeholders | government.government_position_held : office_holder | type.object : type | american_football.football_player : position_s | location.location : containedby | travel.travel_destination : tourist_attractions | architecture.structure : height_meters | common.topic : notable_types | kg.object_profile : prominent_type | symbols.namesake : named_after\n\n\nquestion:\n\nWhat zoo that opened earliest is there to see in Dallas, TX?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f2rq ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dallas Zoo"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAssuptuion Saint Bridget: m.02wsngb | organization.organization : date_founded | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | education.educational_institution : mascot | location.location : containedby | common.topic : notable_types | type.object : type | kg.object_profile : prominent_type | sports.sports_team : sport, founded, colors | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | people.person : place_of_birth | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | film.film_location : featured_in_films\n\n\nquestion:\n\nA person attending education institution Assuptuion Saint Bridget is from where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.02wsngb .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bremerton"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHomer: m.07vbb7 | sports.professional_sports_team : owner_s | sports.sports_team_owner : teams_owned | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, championships, roster | baseball.baseball_team : current_manager | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | sports.sports_team_roster : player, position\n\n\nquestion:\n\nWhat sports team has a mascot with the name of Homer?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.07vbb7 .\n?c ns:sports.sports_team.team_mascot ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Homer, Rally, Chief Noc-A-Homa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNicolas Sarkozy: m.02ps9k | President: m.060c4 | people.deceased_person : cause_of_death, date_of_death | people.person : profession, nationality, ethnicity, place_of_birth, gender | government.government_position_held : basic_title, office_holder, to | government.politician : government_positions_held | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.governmental_jurisdiction : governing_officials | type.object : type | american_football.football_player : position_s | language.human_language : language_family | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat is the name of the president of the geographic location where Nicolas Sarkozy was appointed to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.02ps9k .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "François Hollande"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDown District Council: m.02dv8y | UK constituent country: m.0hzjlmp | United Kingdom: m.07ssc | location.country : second_level_divisions, administrative_divisions | location.location : contains, people_born_here | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | royalty.kingdom : rulers | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | media_common.netflix_genre : titles | book.book_subject : works | type.object : type\n\n\nquestion:\n\nWhat country in the United Kingdom contains the Down District Council?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:base.aareas.schema.administrative_area.administrative_children ?x .\n?x ns:base.aareas.schema.administrative_area.administrative_area_type ns:m.0hzjlmp .\n?x ns:location.country.administrative_divisions ns:m.02dv8y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Northern Ireland"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Denmark: m.0k6nt | location.location : events, adjoin_s, time_zones, people_born_here, contains, partially_contains | government.governmental_jurisdiction : government, governing_officials | type.object : name, type | government.government_position_held : office_holder | location.country : second_level_divisions | common.topic : notable_types | media_common.netflix_genre : titles | travel.travel_destination : tourist_attractions | location.adjoining_relationship : adjoins | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat is the largest populated country that partially contains Denmark?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.0k6nt .\n?c ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:topic_server.population_number ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Germany"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nmales: m.05zppz | Alien on TV Monitors #2: m.0pbzq16 | film.film : starring, other_crew | film.film_crew_gig : crewmember | film.actor : film | location.statistical_region : religions, co2_emissions_per_capita, gdp_real | measurement_unit.adjusted_money_value : adjusted_value | type.object : type | award.award_category : date_established | music.album : release_date | location.location : contains, people_born_here | music.genre : albums | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film_genre : films_in_this_genre | music.composition : composer | book.book_subject : works | time.event : end_date | people.person : sibling_s, profession, nationality, gender | education.educational_institution : students_graduates | education.education : student | film.film_character : portrayed_in_films | film.performance : character, film | people.sibling_relationship : sibling | location.religion_percentage : religion | location.citytown : postal_codes | media_common.netflix_genre : titles | organization.organization : date_founded | film.film_story_contributor : film_story_credits\n\n\nquestion:\n\nWho is the brother of the actor who played the character Alien on TV Monitors #2?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.actor.film ?k .\n?k ns:film.performance.character ns:m.0pbzq16 .\n?c ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jaxon Bieber"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRio de Janeiro: m.01hd4s | location.location : time_zones, people_born_here, partially_containedby, contains, containedby | people.person : profession, nationality, gender | type.object : type | common.topic : notable_types | architecture.structure : height_meters | kg.object_profile : prominent_type | location.country : currency_used, administrative_divisions\n\n\nquestion:\n\nWhat form of currency is used in the nation where you'd find Rio de Janeiro?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hd4s .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brazilian real"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDe divina proportione: m.06pqb_7 | common.topic : notable_types | type.object : type | award.award_nominated_work : award_nominations | book.written_work : subjects, date_of_first_publication, author, copyright_date | law.invention : inventor | film.film : genre | influence.influence_node : influenced_by, peers | influence.peer_relationship : peers | book.illustrator : books_illustrated | people.deceased_person : place_of_death | book.book : genre\n\n\nquestion:\n\nWhere did the illustrator of \"De Divina Proportione\" die?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:book.illustrator.books_illustrated ns:m.06pqb_7 .\n?c ns:people.deceased_person.place_of_death ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Amboise"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\npeoples republic of china: m.0d05w3 | Khartoum: m.04d_m | government.politician : government_positions_held | government.government_position_held : basic_title, from, jurisdiction_of_office | location.country : official_language, iso3166_1_alpha2, capital, languages_spoken, form_of_government | location.location : containedby, adjoin_s, time_zones, contains, partially_contains | type.object : type | people.person : date_of_birth, nationality, place_of_birth, gender | location.administrative_division : country | time.event : locations | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita, places_exported_to | measurement_unit.dated_integer : number | location.imports_and_exports : exported_to | kg.object_profile : prominent_type | location.adjoining_relationship : adjoins | measurement_unit.dated_metric_ton : number | common.topic : notable_types | architecture.structure : height_meters\n\n\nquestion:\n\nWho trades with China and has a capital city called Khartoum?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0d05w3 ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.0d05w3 ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.country.capital ns:m.04d_m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sudan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTom Thibodeau: m.043jv80 | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | basketball.basketball_team : head_coach | sports.sports_team : arena_stadium, colors | kg.object_profile : prominent_type | location.statistical_region : consumer_price_index, cpi_inflation_rate | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nWho is the head coach of the basketball team whose head coach is Tom Thibodeau?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:basketball.basketball_team.head_coach ns:m.043jv80 .\n?c ns:basketball.basketball_team.head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tom Thibodeau"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Yale Herald: m.0544pz | location.location : containedby, contains, people_born_here | location.hud_county_place : county | common.topic : notable_types | type.object : type | education.educational_institution : newspaper, sports_teams, students_graduates | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | organization.organization : headquarters, leadership | organization.leadership : person | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | fictional_universe.school_in_fiction : students_graduates | education.education : student | kg.object_profile : prominent_type | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nThe Yale Herald is the newspaper of the educational institution located where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.newspaper ns:m.0544pz .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Haven"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nOrthodox Autocephalous Church of Albania: m.06yy_g | location.location : containedby | type.object : type | organization.organization : place_founded, date_founded | common.topic : notable_types | kg.object_profile : prominent_type | sports.sports_team : founded, roster | award.award_winner : awards_won | award.award_honor : award | education.educational_institution : school_type, students_graduates | people.person : nationality, gender | education.education : student | organization.organization_founder : organizations_founded | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | location.country : capital | sports.sports_team_roster : position\n\n\nquestion:\n\nWhat is the capital city of the geographic division where the religious organizational leadership is called the Orthodox Autocephalous Church of Albania?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.06yy_g .\n?c ns:location.country.capital ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tirana"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nitalian republic: m.03rjj | Country: m.01mp | location.location : contains, partially_contains | common.topic : notable_types | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : administrative_divisions, gdp_nominal | measurement_unit.dated_money_value : amount | type.object : name, type\n\n\nquestion:\n\nWhich countries are located in a place that slightly contains Italy?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.03rjj .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkey, Monaco, Spain, France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGeorgia: m.0d0x8 | United States Senate: m.07t58 | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, legislative_sessions, to, governmental_body | government.political_district : representatives | government.politician : government_positions_held | government.governmental_jurisdiction : governing_officials | people.person : profession, nationality, place_of_birth | government.governmental_body : members | location.location : contains | type.object : type\n\n\nquestion:\n\nWhich state senator from Georgia took this position at the earliest date?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d0x8 ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.governmental_body ns:m.07t58 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Saxby Chambliss"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFotheringhay Castle: m.025s1y5 | common.topic : notable_types | location.location : time_zones, partially_containedby, contains, containedby | kg.object_profile : prominent_type | type.object : type | geography.river : mouth | government.political_district : representatives | government.government_position_held : office_holder | architecture.structure : opened, height_meters | people.person : religion\n\n\nquestion:\n\nWhat religion was followed by the person who once lived in Fotheringhay Castle?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.025s1y5 .\n?c ns:people.person.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUniversity of Oregon The Oregon Duck: m.03d53pb | John Madden: m.0frmb1 | type.object : type | sports.pro_athlete : teams, sports_played_professionally, career_start, career_end | sports.sports_team : arena_stadium, league, fight_song, location, sport, team_mascot, roster | sports.pro_sports_played : sport, career_start, career_end | common.topic : notable_types | american_football.football_team : division | sports.sports_league_participation : league | sports.school_sports_team : school | sports.sports_team_roster : player, team | people.person : profession, nationality, quotations, gender | kg.object_profile : prominent_type | american_football.football_player : position_s\n\n\nquestion:\n\nWhat college football team has the mascot of a duck and included John Madden as a former player?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0frmb1 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.team_mascot ns:m.03d53pb .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Oregon Ducks football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEl Seibo Province: m.03xplf | type.object : type | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : opened, height_meters | government.government_position_held : basic_title | location.country : currency_used, administrative_divisions\n\n\nquestion:\n\nWhat type of money does the country where El Seibo Province is use?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03xplf .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCommunist Party of China: m.02189 | organization.organization : founders | influence.influence_node : influenced_by, influenced | people.person : religion, quotations, profession, nationality, height_meters, place_of_birth, gender | people.deceased_person : date_of_death, place_of_death | type.object : type | government.politician : government_positions_held, party | government.political_party_tenure : party | government.government_position_held : basic_title, office_position_or_title, from, jurisdiction_of_office, to | organization.organization_founder : organizations_founded | common.topic : notable_types | medicine.notable_person_with_medical_condition : condition | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical\n\n\nquestion:\n\nWho held his governmental position from March 20, 1943 and created the Chinese Communist Party?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02189 ns:organization.organization.founders ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1943-03-20\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mao Zedong"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArmy of the Lord: m.010hq7jr | Massachusetts: m.05k7sb | location.location : containedby, partially_contains, contains, people_born_here | government.political_district : representatives | government.government_position_held : basic_title, office_holder | religion.religion : deities, sacred_sites, organizations | government.governmental_jurisdiction : governing_officials, official_symbols | location.location_symbol_relationship : Kind_of_symbol | book.book_subject : works | type.object : type | location.statistical_region : religions | location.religion_percentage : religion\n\n\nquestion:\n\nWhat is the religion that has an organization called Army of the Lord and was also the religion of Massachusetts?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05k7sb ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.organizations ns:m.010hq7jr .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Christianity"
    }
]