[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBuenos Aires: m.01ly5m | people.person : religion | kg.object_profile : prominent_type | common.topic : notable_types | location.location : time_zones, contains, containedby | type.object : type | location.country : administrative_divisions, form_of_government | government.politician : government_positions_held | government.government_position_held : from\n\n\nquestion:\n\nWhat is the political system where Buenos Aires is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01ly5m .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Constitutional republic, Representative democracy, Federal republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nT-1000: m.01kdgk | christopher crosby farley: m.012801 | film.film : language, produced_by, subjects, release_date_s, other_crew, film_set_decoration_by, edited_by, featured_film_locations, sequel, initial_release_date, country, starring, genre | film.film_regional_release_date : film_release_distribution_medium, release_date | people.person : religion, profession, nationality, languages, height_meters | influence.influence_node : influenced_by, influenced | fictional_universe.fictional_character : character_created_by, gender | film.film_character : portrayed_in_films | film.performance : character, actor, film | film.actor : film | type.object : type | film.film_crew_gig : crewmember | kg.object_profile : prominent_type | people.deceased_person : cause_of_death, place_of_death\n\n\nquestion:\n\nWhat film with character named T-1000 did Chris Farley do?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.012801 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.01kdgk .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wayne's World"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSweet Caroline: m.0bb6y_8 | location.location : people_born_here, events, contains, containedby | sports.sports_team : fight_song, sport, colors, team_mascot | periodicals.newspaper_circulation_area : newspapers | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from | location.place_with_neighborhoods : neighborhoods | time.event : end_date, start_date | type.object : type | people.person : nationality, profession, height_meters, gender | travel.travel_destination : tourist_attractions | sports.sports_championship_event : champion, runner_up | kg.object_profile : prominent_type | sports.sports_team_coach : teams_coached | sports.sports_team_coach_tenure : team | american_football.football_player : position_s | location.hud_county_place : county | sports.sports_team_location : teams | american_football.football_team : current_head_coach | film.film_subject : films\n\n\nquestion:\n\nWho is the coach of the team whose fight song is \"Sweet Caroline\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.0bb6y_8 .\n?c ns:american_football.football_team.current_head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ron Rivera"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNina Dobrev: m.027nwk2 | location.statistical_region : population, consumer_price_index, gdp_real, religions, long_term_unemployment_rate, foreign_direct_investment_net_inflows, size_of_armed_forces, co2_emissions_per_capita, market_cap_of_listed_companies_as_percent_of_gdp, part_time_employment_percent, net_migration | measurement_unit.dated_integer : number | type.object : type | measurement_unit.adjusted_money_value : adjusted_value | people.person : nationality, place_of_birth, gender | measurement_unit.dated_percentage : rate | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.religion_percentage : religion | measurement_unit.dated_money_value : amount | location.location : contains, partially_contains | film.actor : film | film.performance : character, film\n\n\nquestion:\n\nWhere is the place with the long term unemployment rate 43.3 and Nina Dobrev's nationality?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027nwk2 ns:people.person.nationality ?x .\n?x ns:location.statistical_region.long_term_unemployment_rate ?c .\n?c ns:measurement_unit.dated_percentage.rate \"43.3\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJay: m.0gl_8b_ | Alva Skate Team Member: m.0zmb5d2 | location.location : contains, people_born_here | film.film_genre : films_in_this_genre | people.person : nationality | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | type.object : type | film.film_character : portrayed_in_films | film.performance : character, actor, film | location.statistical_region : population | measurement_unit.dated_integer : number | film.film : starring, country | media_common.netflix_genre : titles | language.human_language : language_family, countries_spoken_in | location.country : second_level_divisions | film.actor : film\n\n\nquestion:\n\nWho played the character Jay Adams in the film with a character named Alva Skate Team member?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0zmb5d2 .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0gl_8b_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Emile Hirsch"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nbangkok, thailand: m.0fn2g | location.location : containedby | people.person : religion, profession, nationality, height_meters, gender | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title, office_position_or_title, to | common.topic : notable_types | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | travel.travel_destination : tourist_attractions | architecture.structure : opened, height_meters | travel.tourist_attraction : near_travel_destination | film.film : language | zoos.zoo : num_species\n\n\nquestion:\n\nWhat zoo opened later and can be visited in Bangkok?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0fn2g ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Safari World"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRooney family: m.03nrwfz | kg.object_profile : prominent_type | time.event : end_date, start_date, locations, instance_of_recurring_event | type.object : type | american_football.football_player : passing | american_football.player_passing_statistics : completions | sports.sports_team : colors | location.location : events, contains, people_born_here | people.person : religion, profession, nationality, gender | people.deceased_person : date_of_death, place_of_death | common.topic : notable_types | tv.tv_personality : tv_regular_appearances | tv.tv_regular_personal_appearance : from | sports.sports_championship_event : runner_up | sports.sports_facility : home_venue_for | sports.team_venue_relationship : team | film.film_subject : films | sports.professional_sports_team : owner_s | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.political_appointer : appointees | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | sports.sports_team_owner : teams_owned | book.book_subject : works | award.award_category : date_established | military.military_person : participated_in_conflicts | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from | government.politician : government_positions_held\n\n\nquestion:\n\nWho is the 2005 coach of the team owned by the Rooney family?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.03nrwfz .\n?c ns:american_football.football_team.historical_coaching_staff ?y .\n?y ns:american_football.football_historical_coach_position.coach ?x .\nEXISTS {?y ns:american_football.football_historical_coach_position.from ?sk1 .\nEXISTS {?y ns:american_football.football_historical_coach_position.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bill Cowher"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAppalachian Mountains: m.0lm0n | John Lynch: m.041gm | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : basic_title, office_holder, appointed_by | location.location : adjoin_s, time_zones, people_born_here, partially_containedby, contains | common.topic : notable_types | location.adjoining_relationship : adjoins | government.political_district : representatives | type.object : type | government.political_appointer : appointees\n\n\nquestion:\n\nWhere do the Appalachian mountains run through, and is the location that appointed John Lynch to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0lm0n ns:location.location.partially_containedby ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.041gm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Hampshire"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMediterranean Sea: m.04swx | Country: m.01mp | city of paris: m.05qtj | location.location : containedby, events, contains, people_born_here | royalty.kingdom : rulers | type.object : name, type | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : official_language, capital, currency_used, second_level_divisions | kg.object_profile : prominent_type\n\n\nquestion:\n\nParis is part of what country in the Mediterranean Sea?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04swx ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.05qtj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJames K. Polk: m.042f1 | President: m.060c4 | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, to | government.politician : government_positions_held | type.object : type | government.us_president : presidency_number | government.political_appointer : appointees | people.person : height_meters\n\n\nquestion:\n\nWhat office position did James K. Polk hold from April 1, 1789 before he was President?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nSELECT ?pFrom\nWHERE {\nns:m.042f1 ns:government.politician.government_positions_held ?y . # James K. Polk\n?y ns:government.government_position_held.office_position_or_title ?x ;\nns:government.government_position_held.basic_title ns:m.060c4 ; # President\nns:government.government_position_held.from ?pFrom .\n}\n}\nns:m.042f1 ns:government.politician.government_positions_held ?y . # James K. Polk\n?y ns:government.government_position_held.office_position_or_title ?x ;\nns:government.government_position_held.from ?from .\n\n?c ns:government.government_position_held.from \"1789-04-01\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Speaker of the United States House of Representatives"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGalápagos Islands: m.016zjj | Quito: m.01dtq1 | location.location : time_zones, containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | location.country : calling_code, capital, administrative_divisions, second_level_divisions | government.government_position_held : basic_title, office_holder | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | type.object : type | common.topic : notable_types\n\n\nquestion:\n\nWhere is the Galapagos Islands located where the capital is Quito?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.016zjj ns:location.location.containedby ?x .\n?x ns:location.country.capital ns:m.01dtq1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ecuador"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNorthern Cyprus: m.01nx28 | location.location : events, contains, containedby | location.country : administrative_divisions, languages_spoken | government.government_office_category : officeholders | government.government_position_held : office_holder, jurisdiction_of_office | people.ethnicity : geographic_distribution | language.human_language : language_family | people.person : date_of_birth, profession, place_of_birth, gender | government.form_of_government : countries | time.time_zone : locations_in_this_time_zone | type.object : name, type | common.topic : notable_types | finance.currency : countries_formerly_used | government.politician : government_positions_held\n\n\nquestion:\n\nWhat spoken languages of the country that has Northern Cyprus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01nx28 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkish Language, Zaza language, Ladino Language, Kurdish languages, Arabic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNicholas Kehoe: m.02q241c | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.person : children, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | location.location : people_born_here | location.mailing_address : citytown | kg.object_profile : prominent_type | government.politician : government_positions_held, party | government.government_position_held : basic_title, governmental_body | type.object : type | organization.organization : headquarters | medicine.notable_person_with_medical_condition : condition | people.deceased_person : date_of_death, place_of_death | government.political_party_tenure : party | time.event : included_in_event\n\n\nquestion:\n\nIn what city was the educational institution that had a grad student named Nicholas Kehoe founded?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.students_graduates ?k .\n?k ns:education.education.student ns:m.02q241c .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colorado Springs"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Beijing: m.01914 | Country: m.01mp | location.location : adjoin_s, contains, partially_contains | type.object : name, type | location.country : official_language, capital, second_level_divisions | common.topic : notable_types | organization.organization_founder : organizations_founded | kg.object_profile : prominent_type | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat country near Russia that has the capital Beijing?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.01914 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nturkish: m.02hwyss | location.location : time_zones, containedby, contains, partially_contains | location.country : calling_code, languages_spoken, second_level_divisions, administrative_divisions | language.human_language : countries_spoken_in | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | type.object : type | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | event.speech_topic : speeches_or_presentations_on_this_topic | event.speech_or_presentation : speaker_s\n\n\nquestion:\n\nWhich country had a co2 emiisions per capita was once 2010 metric ton and uses turkish as a language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02hwyss ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2010\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Cyprus, Turkey, Republic of Macedonia, Austria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMicky Arison: m.027f6w | government.political_appointer : appointees | government.government_position_held : basic_title, from, to, jurisdiction_of_office | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | location.location : time_zones, containedby | people.deceased_person : date_of_death, place_of_death | architecture.structure : opened | type.object : type | government.politician : government_positions_held, party | sports.sports_team : championships | government.political_party_tenure : party | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : sport | common.topic : notable_types | american_football.football_player : position_s | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nMicky Arison's sports team last won the championship in what year?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.027f6w .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2006 NBA Finals, 2012 NBA Finals, 2013 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCornell University Library: m.05d3mj | education.educational_institution : school_type, students_graduates | type.object : type | location.location : time_zones, containedby | organization.organization : headquarters, date_founded | american_football.football_team : division | kg.object_profile : prominent_type | sports.sports_team : sport | education.education : student | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | amusement_parks.park : opened | common.topic : notable_types | exhibitions.exhibition_venue : exhibitions_at_this_venue | exhibitions.exhibition_run : opened_on\n\n\nquestion:\n\nIn what city is the Library for Cornell University located in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.05d3mj .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ithaca"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHumat al-Hima: m.01nwq8 | time.event : start_date, locations | people.person : religion, profession, nationality, ethnicity, place_of_birth | location.location : time_zones, containedby | type.object : name, type | kg.object_profile : prominent_type | government.politician : government_positions_held | government.government_position_held : office_holder, to, from | royalty.monarch : kingdom | language.human_language : countries_spoken_in | government.form_of_government : countries | time.time_zone : locations_in_this_time_zone | government.government_office_category : officeholders | common.topic : notable_types\n\n\nquestion:\n\nWhere is the country that has national anthem Humat al-Hima?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01nwq8 .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Africa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nZygi Wilf: m.07d8sx | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | people.deceased_person : place_of_burial, date_of_death, place_of_death | type.object : type | government.government_position_held : office_holder | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.politician : government_positions_held | location.location : containedby | american_football.football_player : position_s | sports.professional_sports_team : owner_s | kg.object_profile : prominent_type\n\n\nquestion:\n\nWho have been the coaches of the team owned by Zygi Wilf?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.07d8sx .\n?c ns:american_football.football_team.historical_coaching_staff ?y .\n?y ns:american_football.football_historical_coach_position.coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bud Grant, Mike Zimmer, Norm Van Brocklin, Mike Tice, Dennis Green, Les Steckel, Jerry Burns, Leslie Frazier, Brad Childress, Joe Woods, Mike Tomlin"
    }
]