[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJamaica, Land We Love: m.01f58t | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start | government.government_office_category : officeholders | government.government_position_held : office_holder | type.object : name, type | location.location : contains | fictional_universe.fictional_setting : characters_that_have_lived_here | people.deceased_person : date_of_death, place_of_death | language.human_language : main_country, countries_spoken_in | government.politician : government_positions_held, party | time.time_zone : locations_in_this_time_zone | time.event : end_date | kg.object_profile : prominent_type | government.political_party_tenure : party | american_football.football_player : position_s | book.book_subject : works | sports.sports_team_roster : team | government.form_of_government : countries | location.country : currency_used | award.award_nominee : award_nominations\n\n\nquestion:\n\nThe country that claims Jamaica, Land We Love as its national anthem has what form of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01f58t .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jamaican dollar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFatick Region: m.0241zf | common.topic : notable_types | type.object : type | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | location.country : currency_used, administrative_divisions | aviation.airport : serves\n\n\nquestion:\n\nWhat currency is used in the country with Fatick Region?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0241zf .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "West African CFA franc"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2013 AFC Championship Game: m.0_gtz8t | award.award_category : date_established | time.recurring_event : instances | kg.object_profile : prominent_type | time.event : end_date, start_date, locations, instance_of_recurring_event | sports.sports_team_roster : player, to, team, position | common.topic : notable_types | type.object : type | sports.sports_team : arena_stadium, championships | sports.sports_championship_event : championship, champion, runner_up | people.person : profession, nationality, gender | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : sport | sports.sports_league_draft_pick : player | music.composition : composer | location.location : people_born_here | american_football.football_player : passing, position_s | american_football.player_passing_statistics : attempts, completions | sports.professional_sports_team : draft_picks\n\n\nquestion:\n\nWhere does the team play that won  the 2013 AFC Championship Game championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gtz8t .\n?c ns:sports.sports_team.arena_stadium ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "M&T Bank Stadium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Auburn Plainsman: m.06hxtz | location.hud_county_place : county | location.location : area, time_zones, people_born_here, contains, containedby | organization.organization : leadership | organization.leadership : person, role | type.object : type | education.educational_institution : mascot, colors, newspaper, sports_teams, students_graduates | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | periodicals.newspaper_circulation_area : newspapers | kg.object_profile : prominent_type | common.topic : notable_types | education.education : student\n\n\nquestion:\n\nWhere is The Auburn Plainsman educational newspaper published?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.newspaper ns:m.06hxtz .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Auburn University Historic District, United States of America, Alabama, Auburn"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJim Harbaugh: m.04rmtv | 1995 AFC Championship Game: m.0100z7dx | sports.sports_team : founded, colors, location, team_mascot, sport, previously_known_as, championships, roster | sports.pro_athlete : teams, sports_played_professionally | sports.sports_team_roster : player, team, position | people.person : profession, nationality, parents, height_meters, place_of_birth, gender | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | time.event : locations, instance_of_recurring_event | sports.pro_sports_played : sport | sports.sports_championship_event : championship, champion, runner_up | sports.professional_sports_team : owner_s | american_football.football_player : position_s | american_football.football_team : current_head_coach\n\n\nquestion:\n\nWhat team that won 1995 AFC Championship and once had Jim Harbaugh on its roster?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04rmtv ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.0100z7dx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "San Diego Chargers"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArgentina: m.0jgd | Eve: m.025t1rz | media_common.netflix_genre : titles | location.location : time_zones, people_born_here, contains, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : administrative_divisions, languages_spoken, form_of_government | religion.religion : places_of_worship, types_of_places_of_worship, notable_figures, texts, sacred_sites, beliefs | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita, religions | location.religion_percentage : religion | people.person : gender | measurement_unit.dated_integer : number | biology.breed_origin : breeds_originating_here | film.film_location : featured_in_films | periodicals.newspaper_circulation_area : newspapers | religion.religious_leadership_jurisdiction : leader | religion.religious_organization_leadership : start_date, leader\n\n\nquestion:\n\nWhat religion practiced in Argentina venerates Eve as a notable figure?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jgd ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.notable_figures ns:m.025t1rz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSwitzerland: m.06mzp | Country: m.01mp | Vienna: m.0fhp9 | common.topic : notable_types | time.time_zone : locations_in_this_time_zone | location.country : official_language, capital | type.object : name, type | location.location : people_born_here, contains, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | influence.influence_node : influenced_by | film.film_location : featured_in_films\n\n\nquestion:\n\nVienna is the capital of what coucntry bordering Switzerland?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mzp ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.0fhp9 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Austria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAlabama Crimson Tide Football: m.026bt_h | government.governmental_jurisdiction : official_symbols, governing_officials | sports.pro_athlete : teams | sports.sports_team_roster : team | award.award_nominee : award_nominations | government.government_position_held : basic_title, office_holder | award.award_category : date_established | location.location : containedby, contains, people_born_here | film.film_subject : films | american_football.football_player : position_s | award.award_nomination : award | type.object : type | sports.sports_team_location : teams | american_football.football_team : division | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | organization.organization : leadership | organization.leadership : role | common.topic : notable_types | people.person : profession | education.educational_institution : sports_teams | government.political_district : representatives\n\n\nquestion:\n\nWhich geographic divisions contain the university that has the athletic team called Alabama Crimson Tide Football?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.026bt_h .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United States of America, Alabama, Tuscaloosa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBahamian dollar: m.01l6dm | type.object : type | finance.currency : countries_used | location.country : currency_used, calling_code, national_anthem, official_language, capital, languages_spoken, form_of_government | government.national_anthem_of_a_country : anthem | location.location : time_zones, contains, people_born_here | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title, governmental_body | royalty.kingdom : rulers | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | film.film_location : featured_in_films\n\n\nquestion:\n\nWhat is the currency that is accepted in the country where the money used is the Bahamian dollar?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.01l6dm .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bahamian dollar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTheodore Roosevelt: m.07hyk | Cuban Missile Crisis: m.01zxx | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : office_holder | location.location : contains, people_born_here | type.object : type | location.country : second_level_divisions, administrative_divisions | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value | military.military_conflict : commanders | military.military_command : military_combatant | time.event : locations\n\n\nquestion:\n\nIn what location was Thoeodore Roosevelt appointed to governmental position and the place where the Cuban Missile Crisis happened?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01zxx ns:time.event.locations ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.07hyk .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Cuba"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSchool: m.01y2hn6 | Assuptuion Saint Bridget: m.02wsngb | common.topic : notable_types | type.object : type | organization.organization : date_founded | education.educational_institution : school_type, students_graduates, colors | location.location : time_zones, containedby | education.school : nces_school_id, highest_grade_taught | education.education : student\n\n\nquestion:\n\nThe person who attended Assuptuion Saint Bridget attended which high school?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.02wsngb .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hn6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Helix High School"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJudy McGrath: m.0dlclh | type.object : type | people.person : religion, profession, nationality, ethnicity, place_of_birth, gender | architecture.structure : opened, height_meters | government.politician : government_positions_held, party | government.government_position_held : office_position_or_title, from | film.film : genre | people.deceased_person : place_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | location.location : time_zones, containedby | common.topic : notable_types | kg.object_profile : prominent_type | organization.organization : headquarters | location.mailing_address : citytown | government.political_party_tenure : party | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nWhere is the headquarters of the organization led by Judy McGrath?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0dlclh .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nManny Ramirez: m.06tjlc | 1903 World Series: m.018n8 | people.person : profession, nationality, place_of_birth, gender | sports.sports_team : founded, colors, location, team_mascot, sport, championships, roster | sports.pro_athlete : teams, career_start | sports.sports_team_roster : player, team, position | sports.sports_championship_event : championship, champion | type.object : type | sports.professional_sports_team : owner_s | time.event : end_date, start_date, instance_of_recurring_event | award.award_nominee : award_nominations | common.topic : notable_types | award.award_nomination : award | baseball.baseball_team : current_manager | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat team did Manny Ramirez play for that won the 1903 World Series Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06tjlc ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.018n8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston Red Sox"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCrazy Crab: m.02q_hzh | type.object : type | location.location : people_born_here, events, contains, containedby | media_common.netflix_genre : titles | people.person : profession, place_of_birth, gender | sports.sports_team : team_mascot, championships | sports.sports_championship_event : championship, champion, runner_up | location.place_with_neighborhoods : neighborhoods | time.event : end_date, start_date, locations | sports.sports_team_location : teams | baseball.baseball_player : batting_stats, position_s | baseball.batting_statistics : team | kg.object_profile : prominent_type | common.topic : notable_types | fictional_universe.fictional_setting : characters_that_have_lived_here | architecture.structure : opened | sports.defunct_sports_team : later_known_as | baseball.baseball_team : current_coaches | baseball.current_coaching_tenure : baseball_coach\n\n\nquestion:\n\nWhat years did the team with the mascot named Crazy Crab win the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.02q_hzh .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2014 World Series, 2010 World Series, 2012 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVienna: m.0fhp9 | location.location : time_zones, people_born_here, events, containedby | common.topic : notable_types | type.object : type | location.country : administrative_divisions, languages_spoken | kg.object_profile : prominent_type | architecture.structure : height_meters | location.administrative_division : country | geography.river : basin_countries | book.book_subject : works\n\n\nquestion:\n\nWhat languages are spoken in the country that Vienna is in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0fhp9 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bavarian Language, Bosnian language, Turkish Language, Hungarian, German Language, Slovene language, Serbian language, Croatian language, Austrian German"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCairo: m.01w2v | Portugal: m.05r4w | people.person : religion, profession, nationality, place_of_birth, gender | location.location : contains, containedby | location.country : capital | architecture.structure : opened, height_meters | type.object : type | organization.organization : date_founded | people.deceased_person : date_of_death, place_of_death | government.politician : government_positions_held | government.government_position_held : basic_title, appointed_by | time.time_zone : locations_in_this_time_zone | kg.object_profile : prominent_type\n\n\nquestion:\n\nCairo is the capital of what country Portugal trades with?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.05r4w ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.05r4w ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.country.capital ns:m.01w2v .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Egypt"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBahamian dollar: m.01l6dm | location.location : area, time_zones, people_born_here, contains, containedby | type.object : name, type | people.deceased_person : place_of_death | people.person : profession, nationality, date_of_birth, place_of_birth, gender | government.government_office_category : officeholders | government.government_position_held : office_holder, office_position_or_title, from, jurisdiction_of_office, to | book.book_subject : works | government.government_office_or_title : office_holders | government.politician : government_positions_held | government.form_of_government : countries | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | time.time_zone : locations_in_this_time_zone | government.governmental_body : members | royalty.monarch : kingdom | location.country : currency_used | music.composer : compositions | people.marriage : location_of_ceremony | film.film : genre, country | meteorology.tropical_cyclone : affected_areas | language.human_language : main_country, countries_spoken_in | finance.currency : countries_used | kg.object_profile : prominent_type\n\n\nquestion:\n\nIn the nation that spends the Bahamian dollar as currency, what time zone is used?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.01l6dm .\n?c ns:location.location.time_zones ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "UTC−05:00, Eastern Time Zone"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBridgetown: m.0fn5r | type.object : type | location.location : area, time_zones, people_born_here, contains, containedby | common.topic : notable_types | location.country : currency_used, capital | kg.object_profile : prominent_type\n\n\nquestion:\n\nIn the country whose capital is Bridgetown, what currency can you use?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0fn5r .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barbadian dollar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNina Dobrev: m.027nwk2 | location.statistical_region : population, consumer_price_index, gdp_real, foreign_direct_investment_net_inflows, long_term_unemployment_rate, size_of_armed_forces, co2_emissions_per_capita, electricity_consumption_per_capita, gdp_growth_rate | measurement_unit.dated_integer : number | location.location : partiallycontains, adjoin_s, contains, partially_contains | location.country : official_language, languages_spoken, second_level_divisions, administrative_divisions | event.speech_topic : speeches_or_presentations_on_this_topic | event.speech_or_presentation : speaker_s | measurement_unit.dated_money_value : amount | measurement_unit.adjusted_money_value : adjusted_value | kg.object_profile : prominent_type | people.person : nationality | measurement_unit.dated_percentage : rate | location.partial_containment_relationship : partially_contains | type.object : type | measurement_unit.dated_metric_ton : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | measurement_unit.dated_kilowatt_hour : number | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat country's energy use per capita in KGOE was once 2225.872 and is Nina Dobrev's nationality?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027nwk2 ns:people.person.nationality ?x .\n?x ns:location.statistical_region.energy_use_per_capita ?c .\n?c ns:measurement_unit.dated_kgoe.number \"2225.872\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDoug Williams: m.0443ql | Malcolm Glazer: m.043cq6 | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, legislative_sessions | location.location : adjoin_s, contains, people_born_here | location.adjoining_relationship : adjoins | location.statistical_region : consumer_price_index, population | sports.sports_team_owner : teams_owned | sports.sports_team : roster | sports.sports_team_roster : position | measurement_unit.dated_integer : number | people.person : nationality | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nWhich team did Doug Williams play for, where the sports team owners name is Malcolm Glazer?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0443ql ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.043cq6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tampa Bay Buccaneers"
    }
]