[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Belfast: m.01l63 | United Kingdom: m.07ssc | location.location : people_born_here, contains, containedby | people.person : religion, children, profession, nationality, date_of_birth, place_of_birth, gender | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, from | type.object : type | location.country : capital, form_of_government | influence.influence_node : influenced | people.deceased_person : cause_of_death, date_of_death, place_of_death | military.military_person : participated_in_conflicts | government.politician : government_positions_held | common.topic : notable_types | time.time_zone : locations_in_this_time_zone | location.statistical_region : consumer_price_index\n\n\nquestion:\n\nWhat UK nation has Belfast as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.01l63 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Northern Ireland"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEkiti State: m.05s84z | common.topic : notable_types | type.object : type | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | location.country : administrative_divisions, form_of_government | architecture.structure : opened | people.person : gender\n\n\nquestion:\n\nWhat is the type of government where Ekiti State is?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.05s84z .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Federal republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nny yankees: m.0cqt41 | David Villa: m.08zpzz | sports.sports_team : founded, colors, location, sport, championships, roster | award.award_nominee : award_nominations | sports.sports_team_roster : team, position | type.object : type | sports.pro_athlete : teams | award.award_nomination : award | baseball.baseball_team : current_manager | organization.organization : date_founded | sports.professional_sports_team : owner_s | people.person : height_meters, nationality | kg.object_profile : prominent_type | sports.sports_team_owner : teams_owned\n\n\nquestion:\n\nWho did David Villa play for who owns the New York Yankees?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.08zpzz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.0cqt41 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York City FC"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMarco Rubio: m.0dpr5f | College/University: m.01y2hnl | The Independent Florida Alligator: m.05vsq8 | common.topic : notable_types | people.person : education, height_meters, place_of_birth | education.education : institution, student | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | education.educational_institution : mascot, school_type, colors, newspaper, sports_teams, students_graduates | type.object : type | periodicals.newspaper_circulation_area : newspapers | location.location : containedby | kg.object_profile : prominent_type | organization.organization : date_founded | government.politician : government_positions_held | government.government_position_held : legislative_sessions, from, governmental_body, district_represented\n\n\nquestion:\n\nWhich university's newspaper is The Independent Florida Alligator and was attended by Marco Rubio?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0dpr5f ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.newspaper ns:m.05vsq8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Florida"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEdward P. Roski: m.0bydfb | government.politician : government_positions_held, party | type.object : type | people.person : religion, children, profession, nationality, date_of_birth, place_of_birth, gender | government.government_position_held : basic_title, from, district_represented | people.deceased_person : date_of_death | architecture.building : floors | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | location.location : containedby | government.political_party_tenure : party | sports.sports_team : championships | film.film : directed_by | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nSports team owner Edward P. Roski last won the playoff series when?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.0bydfb .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2014 Stanley Cup Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGary Herbert: m.0dbg7w | United States Senator: m.02_7l8y | film.film : written_by, release_date_s | type.object : type | sports.pro_athlete : sports_played_professionally, career_end | sports.pro_sports_played : sport | government.government_position_held : basic_title, office_holder, office_position_or_title | common.topic : notable_types | media_common.netflix_title : netflix_genres | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | symbols.name_source : namesakes | location.location : containedby | government.political_district : representatives | kg.object_profile : prominent_type | film.film_regional_release_date : release_date | government.politician : government_positions_held\n\n\nquestion:\n\nThe location with Gary Herbert in governmental poisiton has which senators?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0dbg7w .\n?c ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.02_7l8y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Orrin Hatch, Bob Bennett, Frank Moss, Mike Lee"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSaint Ann Parish: m.02mzmt | geography.geographical_feature : category | type.object : type | location.location : time_zones, contains, containedby | common.topic : notable_types | location.country : administrative_divisions, languages_spoken | kg.object_profile : prominent_type\n\n\nquestion:\n\nIn what country is Saint Ann Parish?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02mzmt .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jamaican English, Jamaican Creole English Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Russia: m.01ptxd | location.location : contains, containedby | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | architecture.structure : opened | aviation.airport : serves | geography.river : discharge | government.politician : government_positions_held | government.government_position_held : from\n\n\nquestion:\n\nWhat country that has the national anthem of Russia import from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01ptxd .\n?c ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Uzbekistan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLupang Hinirang: m.0jkdr | language.human_language : main_country | base.culturalevent.event : entity_involved | people.person : religion, children, profession, nationality, languages, place_of_birth, gender | government.politician : government_positions_held | type.object : type | location.location : partially_contained_by, contains, containedby | location.partial_containment_relationship : partially_contained_by | film.film_subject : films | government.government_position_held : from | common.topic : notable_types | kg.object_profile : prominent_type | location.country : form_of_government | people.deceased_person : date_of_death, place_of_death | book.written_work : date_of_first_publication | location.mailing_address : citytown\n\n\nquestion:\n\nWhat type of government is used in the country whose national anthem is Lupang Hinirang?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.0jkdr .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Unitary state, Republic, Constitutional republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSviatoslav Shevchuk: m.0gjbf2p | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | type.object : type | american_football.football_player : position_s | kg.object_profile : prominent_type | government.politician : government_positions_held, party | government.government_position_held : basic_title, office_position_or_title, jurisdiction_of_office, appointed_by, governmental_body | common.topic : notable_types | government.political_party_tenure : party | location.country : languages_spoken | government.political_appointer : appointees | people.deceased_person : place_of_burial, place_of_death, cause_of_death | music.group_member : instruments_played\n\n\nquestion:\n\nWhat are the spoken languages in the country with Sviatoslav Shevchuk as its religious leader?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.leader ns:m.0gjbf2p .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Albanian language, Tatar Language, Moldovan language, Romanian Language, Hungarian, Russian Language, Ukrainian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIsraeli–Palestinian conflict: m.0cj5y | time.event : people_involved, locations | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | people.person : religion, children, profession, nationality, parents, ethnicity, date_of_birth, place_of_birth, gender | location.location : adjoin_s, contains | location.adjoining_relationship : adjoins | government.governmental_jurisdiction : governing_officials | royalty.monarch : kingdom | kg.object_profile : prominent_type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | type.object : type | award.award_winner : awards_won | award.award_honor : award | common.topic : notable_types | people.deceased_person : cause_of_death, date_of_death, place_of_death | military.military_person : participated_in_conflicts | food.beer_country_region : beers_from_here | location.country : official_language | government.political_appointer : appointees\n\n\nquestion:\n\nWho held his governmental position before 1981 and was in the Israeli Palestine Conflict?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0cj5y ns:time.event.people_involved ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Chaim Weizmann, Menachem Begin, Yasser Arafat, Yitzhak Rabin, Shimon Peres, Anwar Sadat, David Ben-Gurion, Hussein of Jordan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEast Street: m.04f4_tz | people.person : profession | location.location : time_zones, containedby, contains, people_born_here | common.topic : notable_types | type.object : type | kg.object_profile : prominent_type | architecture.structure : opened, height_meters | organization.organization : date_founded\n\n\nquestion:\n\nFor what work is the notable person who once lived on East Street most famous?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.04f4_tz .\n?c ns:people.person.profession ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Comedian, Composer, Film Producer, Actor, Film director, Film Score Composer, Film Editor, Screenwriter"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVietnam War: m.07_nf | time.event : locations | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, legislative_sessions, appointed_by | location.statistical_region : population, gdp_real | measurement_unit.dated_integer : number | measurement_unit.adjusted_money_value : adjusted_value | location.country : languages_spoken | base.culturalevent.event : entity_involved | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhere was the Vietnam War located where CO2 emissions per capita was once 1960 metric tons?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07_nf ns:time.event.locations ?x .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"1960\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Vietnam, Cambodia, Laos"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\npeoples republic of china: m.0d05w3 | Kabul: m.0494n | location.location : contains, people_born_here | location.statistical_region : size_of_armed_forces, places_exported_to | measurement_unit.dated_integer : number | location.country : capital | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.imports_and_exports : exported_to\n\n\nquestion:\n\nWhat country does China border with the capital of Kabul?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d05w3 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:location.country.capital ns:m.0494n .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Afghanistan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWorld War II: m.081pw | Central European Summer Time: m.03q7hb | Anne Frank: m.03d9rk | time.event : includes_event | location.location : partially_contains, time_zones, people_born_here, contains, containedby | location.country : second_level_divisions, form_of_government | location.administrative_division : country | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | people.deceased_person : place_of_death | periodicals.newspaper_circulation_area : newspapers | film.film_subject : films | government.political_district : representatives | time.time_zone : locations_in_this_time_zone | influence.influence_node : influenced\n\n\nquestion:\n\nWhere did Anne Frank live before the war in the Central European Summer Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03d9rk ns:people.person.places_lived ?y .  # ann frank\n?y ns:people.place_lived.location ?x ;\nns:people.place_lived.start_date ?start_date .\nns:m.081pw ns:time.event.start_date ?war_start_date .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Amsterdam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAustin: m.0vzm | location.location : time_zones, containedby, contains, people_born_here | architecture.structure : opened | zoos.zoo : opened | periodicals.newspaper_circulation_area : newspapers | type.object : type | kg.object_profile : prominent_type | film.film_location : featured_in_films | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat zoo that opened on December 12, 2013 is there to see in Austin Texas?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0vzm ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened \"2013-12-12\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Austin Aquarium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNewfoundland Time Zone: m.05jphn | Japan: m.03_3d | location.location : adjoin_s, time_zones, people_born_here, contains, containedby | location.statistical_region : consumer_price_index, population, gdp_real, long_term_unemployment_rate, places_imported_from, size_of_armed_forces, co2_emissions_per_capita, part_time_employment_percent | measurement_unit.dated_percentage : rate | sports.sports_team_location : teams | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | time.time_zone : locations_in_this_time_zone | location.country : languages_spoken, form_of_government | measurement_unit.adjusted_money_value : adjusted_value | location.imports_and_exports : imported_from | measurement_unit.dated_integer : number | location.adjoining_relationship : adjoins | media_common.netflix_genre : titles\n\n\nquestion:\n\nWhat country in the Newfoundland Time Zone does Japan import from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03_3d ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n?x ns:location.location.time_zones ns:m.05jphn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Canada"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSaint Ann Parish: m.02mzmt | type.object : type | location.location : time_zones, area, containedby | common.topic : notable_types | location.country : administrative_divisions, languages_spoken | kg.object_profile : prominent_type | architecture.structure : opened\n\n\nquestion:\n\nWhich language is spoken in the country, that includes the location of Saint Ann Parish?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02mzmt .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jamaican English, Jamaican Creole English Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral Western Time Zone: m.0y498v7 | people.person : religion, profession, nationality, place_of_birth, gender | architecture.structure : height_meters | people.deceased_person : cause_of_death | type.object : type | film.film : language, subjects, country | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, jurisdiction_of_office | symbols.namesake : named_after | common.topic : notable_types | government.political_district : representatives | kg.object_profile : prominent_type | base.culturalevent.event : entity_involved | location.location : time_zones, containedby | language.human_language : countries_spoken_in | time.event : end_date, locations | location.administrative_division : country\n\n\nquestion:\n\nWhat are some exported goods of the area that is located in the Central Western Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.time_zones ns:m.0y498v7 .\n?c ns:location.statistical_region.major_exports ?y .\n?y ns:location.imports_exports_by_industry.industry ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Energy industry, Agriculture"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Limpopo: m.01_zrk | location.location : time_zones, people_born_here, containedby | location.country : official_language, administrative_divisions | kg.object_profile : prominent_type | type.object : type | common.topic : notable_types | location.mailing_address : citytown | architecture.structure : construction_started\n\n\nquestion:\n\nWhat bordering countries are to the country that has Limpopo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01_zrk .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Botswana, Lesotho, Mozambique, Namibia, Swaziland, Zimbabwe"
    }
]