[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPort St. John: m.0rhs4 | Jeb Bush: m.019x9z | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | location.statistical_region : population | measurement_unit.dated_integer : number | government.government_position_held : office_holder | people.person : places_lived | people.place_lived : location | organization.organization_founder : organizations_founded | location.country : administrative_divisions\n\n\nquestion:\n\nWhat Port St. Johns location appointed Jeb Bush to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0rhs4 ns:location.location.containedby ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.019x9z .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Florida"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSan Pedro de Macorís Province: m.03xyyk | location.location : time_zones, contains, containedby | type.object : type | architecture.structure : height_meters | kg.object_profile : prominent_type | location.country : currency_used, administrative_divisions | geography.river : mouth | common.topic : notable_types | architecture.building : floors\n\n\nquestion:\n\nWhat currency is used where San Pedro de Marcos Province is?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03xyyk .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nZygi Wilf: m.07d8sx | Hank Baskett: m.0d81yf | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, governmental_body | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.country : second_level_divisions, administrative_divisions | people.person : nationality, gender | sports.professional_sports_team : owner_s | sports.sports_team : sport | american_football.football_team : historical_coaching_staff | american_football.football_historical_coach_position : coach\n\n\nquestion:\n\nWho does Hank Baskett play for in Nov of 2010, and the sports team owner was Zygi Wilf?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.professional_sports_team.owner_s ns:m.07d8sx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Minnesota Vikings"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1938 Stanley Cup Finals: m.03c6qq8 | location.location : people_born_here, contains, containedby | book.book_subject : works | people.person : spouse_s, profession, nationality, languages | kg.object_profile : prominent_type | government.politician : government_positions_held | government.government_position_held : office_holder, from | type.object : type | government.governmental_jurisdiction : governing_officials | people.marriage : spouse | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | biology.animal_breed : place_of_origin | people.deceased_person : cause_of_death, place_of_burial, place_of_death | government.government_office_category : officeholders | sports.sports_championship_event : championship, champion, runner_up | book.author : book_editions_published | common.topic : notable_types | film.film_genre : films_in_this_genre | time.event : end_date, includes_event, included_in_event | sports.sports_team : championships | ice_hockey.hockey_team : coach | organization.organization : companies_acquired | business.acquisition : company_acquired | film.film : featured_film_locations\n\n\nquestion:\n\nThe team won the 1938 Stanley Cup Finals championship has what head coach?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.03c6qq8 .\n?c ns:ice_hockey.hockey_team.coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Joel Quenneville"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPernambuco: m.01hdpp | common.topic : notable_types | location.location : containedby, area, time_zones, people_born_here | type.object : type | kg.object_profile : prominent_type | location.country : currency_used, administrative_divisions | people.person : gender | architecture.structure : opened, height_meters | time.event : included_in_event\n\n\nquestion:\n\nThe country that contains Pernambuco uses what currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hdpp .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brazilian real"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAli: m.024c1p | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : teams, sports_played_professionally | sports.sports_team_roster : team | kg.object_profile : prominent_type | religion.religion : notable_figures, beliefs | government.politician : government_positions_held | type.object : type | government.government_position_held : basic_title, to, jurisdiction_of_office | people.deceased_person : cause_of_death, place_of_death | sports.pro_sports_played : sport | music.artist : genre\n\n\nquestion:\n\nWhat is the belief of the religion with Ali?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.notable_figures ns:m.024c1p .\n?c ns:religion.religion.beliefs ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mahdi, Tawhid, Prophets in Islam, Predestination in Islam, Entering Heaven alive, Monotheism, Islamic view of angels, Qiyamah, Sharia, Masih ad-Dajjal, Islamic holy books, God in Islam, Ṭūbā"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2011 AFC Championship Game: m.0_gt_jy | location.location : events, people_born_here | type.object : type | award.award_category : date_established | time.event : end_date, start_date, locations, instance_of_recurring_event | common.topic : notable_types | people.person : profession, height_meters, gender | sports.sports_championship_event : championship, champion, runner_up | sports.sports_facility : teams, home_venue_for | architecture.venue : capacity | sports.professional_sports_team : owner_s | military.military_person : participated_in_conflicts | sports.sports_team : sport, championships | sports.team_venue_relationship : team | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_end | kg.object_profile : prominent_type | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from, to | film.film_subject : films\n\n\nquestion:\n\nWho is the ownership of the football franchise that claimed victory in the 2011 AFC Championship Game?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gt_jy .\n?c ns:sports.professional_sports_team.owner_s ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Rooney family"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBarack Obama: m.02mjmr | Columbia Lions men's basketball: m.05h0gpw | government.political_appointer : appointees | government.government_position_held : basic_title, office_position_or_title, from, to, governmental_body | people.person : religion, quotations, profession, nationality, parents, education, places_lived, height_meters, place_of_birth | education.education : institution | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : speech_topic, event | symbols.namesake : named_after | sports.sports_team : sport, colors | government.us_president : presidency_number | education.educational_institution : sports_teams | government.politician : government_positions_held | people.place_lived : location | kg.object_profile : prominent_type | organization.organization : date_founded | type.object : type | book.author : works_written | award.award_nominee : award_nominations | award.award_nomination : nominated_for | internet.blogger : blog\n\n\nquestion:\n\nWhat university has the Columbia Lions Mens Basketball team and includes Barack Obama as an alumni?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.05h0gpw .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Columbia University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nChartley Castle: m.02758g1 | type.object : type | common.topic : notable_types | location.location : time_zones, contains, containedby | people.person : religion, place_of_birth, gender | kg.object_profile : prominent_type | architecture.structure : opened, height_meters\n\n\nquestion:\n\nWhat is the religion observed by the individual who used to reside in Chartley Castle?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.02758g1 .\n?c ns:people.person.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThis Is It Tour: m.05y_zz5 | media_common.netflix_title : netflix_genres | type.object : type | music.instrument : family | music.genre : albums | book.written_work : subjects | people.person : sibling_s, profession, nationality, spouse_s, gender | people.sibling_relationship : sibling | influence.influence_node : influenced_by | music.artist : genre, label, concert_tours | common.topic : image, notable_types | film.film : genre, release_date_s, edited_by | film.film_character : portrayed_in_films | film.performance : actor | people.marriage : spouse | music.composition : composer | film.film_regional_release_date : release_date | time.event : end_date | award.award_category : date_established | book.book_subject : works | music.album : release_date | award.award_nominee : award_nominations | media_common.netflix_genre : titles | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder\n\n\nquestion:\n\nWho inspired the artist that went on This Is It Tour to become a singer?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.05y_zz5 .\n?c ns:influence.influence_node.influenced_by ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Redd Foxx, Charlie Chaplin, James Brown, Nipsey Russell, Walt Disney"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDyslexia: m.029sk | Phoebe Halliwell: m.01ymly | film.producer : film | medicine.notable_person_with_medical_condition : condition | people.person : religion, profession, nationality, ethnicity, height_meters, gender | type.object : type | kg.object_profile : prominent_type | fictional_universe.fictional_character : occupation, place_of_birth, parents, gender | celebrities.celebrity : sexual_relationships | celebrities.romantic_relationship : celebrity | food.diet_follower : follows_diet | tv.tv_character : appeared_in_tv_episodes | tv.tv_guest_role : actor\n\n\nquestion:\n\nNotable for her medical condition Dyslexia, what is Phoebe Halliwell's real name?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01ymly ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n?x ns:medicine.notable_person_with_medical_condition.condition ns:m.029sk .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Alyssa Milano"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLaura Wright: m.03wx83d | government.politician : government_positions_held, party | government.government_position_held : basic_title, legislative_sessions, governmental_body | government.political_party_tenure : party | people.person : religion, children, profession, nationality, parents, date_of_birth, place_of_birth, gender | people.deceased_person : cause_of_death, place_of_burial | type.object : type | organization.organization : founders | tv.tv_character : appeared_in_tv_program | tv.regular_tv_appearance : seasons | common.topic : notable_types | film.actor : film | film.performance : film\n\n\nquestion:\n\nWho started the organization that is led by Laura Wright?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.03wx83d .\n?c ns:organization.organization.founders ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Herb Kelleher, Rollin King"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl XLI: m.04k5qm | Hank Baskett: m.0d81yf | american_football.football_team : historical_coaching_staff, current_head_coach, division | american_football.football_historical_coach_position : coach | time.event : end_date, start_date, instance_of_recurring_event | sports.sports_team : arena_stadium, founded, league, colors, location, team_mascot, sport, championships, roster | people.person : ethnicity, profession, nationality, gender | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start, career_end | kg.object_profile : prominent_type | type.object : type | common.topic : notable_types | sports.professional_sports_team : draft_picks, owner_s | award.award_nominee : award_nominations | award.award_nomination : award | sports.sports_championship_event : championship, champion, runner_up | sports.sports_league_participation : league | sports.sports_team_roster : player, team, position | sports.sports_league_draft_pick : player\n\n\nquestion:\n\nWhat team won the Super Bowl XLI championship and Hank Baskett played for in Nov 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.championships ns:m.04k5qm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Indianapolis Colts"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQuarterback: m.06b1q | Mike Brown: m.0c612b | people.person : religion, profession, nationality, parents, date_of_birth, place_of_birth, gender | location.location : contains, people_born_here | type.object : type | sports.sports_team : roster | kg.object_profile : prominent_type | sports.professional_sports_team : owner_s | sports.sports_team_roster : player, team, position | people.deceased_person : place_of_burial | government.political_appointer : appointees | government.government_position_held : from, district_represented | music.artist : genre | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : sport | time.event : end_date | american_football.football_player : passing, position_s | government.politician : government_positions_held | base.culturalevent.event : entity_involved | american_football.player_passing_statistics : attempts\n\n\nquestion:\n\nWho is the quarterback of the team owned by Mike Brown?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.0c612b .\n?c ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.position ns:m.06b1q .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Andy Dalton, Jason Campbell, AJ McCarron"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDominican Republic: m.027rn | Central Time Zone: m.02fqwt | time.time_zone : locations_in_this_time_zone | location.location : time_zones, containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | travel.travel_destination : tourist_attractions | type.object : type | location.country : currency_used\n\n\nquestion:\n\nWhich Dominican Republic location is in the Central Time Zone and is a great place to vacation?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027rn ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.02fqwt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Pico Duarte"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDenmark: m.0k6nt | government.government_office_or_title : office_holders | government.government_position_held : office_holder, jurisdiction_of_office | people.person : children, profession, nationality, height_meters, place_of_birth, gender | location.location : time_zones, area, contains, containedby | time.event : locations | base.culturalevent.event : entity_involved | type.object : type | royalty.monarch : kingdom | people.deceased_person : place_of_death | media_common.netflix_title : netflix_genres | government.politician : government_positions_held | government.form_of_government : countries | kg.object_profile : prominent_type | common.topic : notable_types\n\n\nquestion:\n\nWho held his governmental position from November 27, 2001 and rules Denmark right now?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0k6nt ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Helle Thorning-Schmidt, Margrethe Vestager"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Paul McCartney World Tour: m.03h2b9f | Marriage: m.04ztj | location.location : adjoin_s, contains, people_born_here | people.person : religion, profession, nationality, education, spouse_s, height_meters, place_of_birth | type.object : type | people.marriage : type_of_union, spouse | media_common.netflix_genre : titles | common.topic : notable_types | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : office_holder, to, from | government.political_appointer : appointees | book.book_subject : works | location.adjoining_relationship : adjoins | film.film_character : portrayed_in_films | film.performance : actor | government.politician : government_positions_held | music.genre : albums | music.instrument : family | music.artist : concert_tours | fictional_universe.fictional_language : found_in_fictional_universe | time.event : start_date | people.deceased_person : date_of_death | education.education : degree\n\n\nquestion:\n\nWho is the current wife of the artist who had a concert tour named The Paul McCartney World Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.03h2b9f .\n?c ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\nEXISTS {?y ns:people.marriage.from ?sk1 .\nEXISTS {?y ns:people.marriage.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nancy Shevell"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTabasco: m.01bkt4 | City/Town/Village: m.01m9 | location.location : area, time_zones, people_born_here, contains, containedby | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | symbols.namesake : named_after | architecture.structure : opened, height_meters | location.country : administrative_divisions | education.educational_institution : sports_teams\n\n\nquestion:\n\nWhat is the city with the greatest population in terms of numbers in the country where Tabasco is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01bkt4 .\n?c ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n?x ns:topic_server.population_number ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMichigan Wolverines Women's Ice Hockey: m.0100qwc3 | Sanjay Gupta: m.02yyk6 | people.person : religion, profession, nationality, education, height_meters, gender | location.location : time_zones, containedby | type.object : type | education.educational_institution : school_type, colors, newspaper, sports_teams, students_graduates | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | medicine.cancer_center_constituent : cancer_center | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | government.politician : government_positions_held, party | government.political_party_tenure : party | sports.sports_team : sport | organization.organization : spin_offs, date_founded, founders | common.topic : notable_types | organization.organization_spin_off : child_company | kg.object_profile : prominent_type | education.education : institution, student, degree | sports.school_sports_team : school\n\n\nquestion:\n\nWith sports team Michigan Wolverines Women's Ice Hockey, where did Sanjay Gupta attend school?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02yyk6 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.0100qwc3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Michigan"
    }
]