[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCherkasy Oblast: m.02h81c | common.topic : notable_types | kg.object_profile : prominent_type | location.location : area, time_zones, people_born_here, partially_containedby, containedby | type.object : type | architecture.structure : opened | location.country : currency_used, administrative_divisions | organization.organization : founders | geography.river : mouth | architecture.building : floors\n\n\nquestion:\n\nWhat form of currency does the country containing Cherkasy Oblast use?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02h81c .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ukrainian hryvnia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDancer: m.01141_f5 | Nick Cannon: m.01d1st | tv.tv_personality : tv_regular_appearances | tv.tv_regular_personal_appearance : to, from | type.object : type | film.film : produced_by, language, runtime, release_date_s, executive_produced_by, initial_release_date, genre, starring | film.film_regional_release_date : release_date | film.actor : film | film.performance : character, actor, film | tv.tv_actor : starring_roles | tv.regular_tv_appearance : series | common.topic : notable_types | kg.object_profile : prominent_type | music.artist : genre, label, origin | film.writer : film | people.person : profession, height_meters | film.film_cut : runtime | film.film_character : portrayed_in_films | film.producer : films_executive_produced | award.award_nominee : award_nominations | award.award_nomination : nominated_for | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nWhat movie with a character named Dancer was Nick Cannon in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01d1st ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.01141_f5 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Love Don't Cost a Thing"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLyon: m.0dprg | Country: m.01mp | Germany: m.0345h | time.time_zone : locations_in_this_time_zone | common.topic : notable_types | location.location : events, containedby, contains, people_born_here | location.country : capital, second_level_divisions, form_of_government | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | people.person : religion | type.object : name | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat country with the city of Lyon does Germany border?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0345h ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0dprg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBeatrix of the Netherlands: m.0ktnm | people.person : religion, profession, nationality, parents, ethnicity, date_of_birth, place_of_birth, gender | government.politician : government_positions_held | government.government_position_held : basic_title, office_position_or_title, jurisdiction_of_office, appointed_by, to, governmental_body | type.object : type | location.location : time_zones, contains, containedby | people.deceased_person : cause_of_death, date_of_death, place_of_death | common.topic : notable_types | location.country : currency_used | music.artist : genre\n\n\nquestion:\n\nThe location that appointed Beatrix of the Netherlands to governmental position uses what type of money?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0ktnm .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Aruban florin"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDobruja: m.01lw9v | Nina Dobrev: m.027nwk2 | location.statistical_region : consumer_price_index, population, cpi_inflation_rate, gdp_real, long_term_unemployment_rate, foreign_direct_investment_net_inflows, size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_percentage : rate | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | measurement_unit.adjusted_money_value : adjusted_value | location.location : events, partially_containedby, contains, partially_contains | type.object : type | measurement_unit.dated_money_value : amount | people.person : languages, nationality | film.actor : film | film.performance : character, film | location.country : administrative_divisions | measurement_unit.dated_metric_ton : number | food.beer_country_region : beers_from_here\n\n\nquestion:\n\nWhat is the nationality of Nina Dobrev and is also the country that has part of Dobruja?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027nwk2 ns:people.person.nationality ?x .\n?x ns:location.location.partiallycontains ?c .\n?c ns:location.partial_containment_relationship.partially_contains ns:m.01lw9v .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Vila Real: m.01qwyf | Spain: m.06mkj | location.location : containedby, contains, people_born_here | food.beer_country_region : beers_from_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | location.country : administrative_divisions | common.topic : notable_types | location.administrative_division : country | sports.sports_team_location : teams | type.object : name\n\n\nquestion:\n\nWhich country surrounds Spain, which is the country that includes the location of Vila Real?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mkj ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.01qwyf .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Portugal"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnwar Sadat: m.0d58h | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.person : religion, profession, nationality, ethnicity, date_of_birth, height_meters, place_of_birth, gender | location.location : contains | kg.object_profile : prominent_type | type.object : type | government.politician : government_positions_held, party | government.government_position_held : to | government.political_party_tenure : party | people.deceased_person : date_of_death\n\n\nquestion:\n\nWhat major landforms are located in the country that has Anwar Sadat as its government officer?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0d58h .\n?c ns:location.location.contains ?y .\n?y ns:geography.geographical_feature.category ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bog, Desert, Bay, Peninsula, Mountain, Gulf"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLucky the Leprechaun: m.03hb1rs | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start | award.award_nominee : award_nominations | award.award_nomination : nominated_for | basketball.basketball_player : position_s | sports.sports_championship_event : championship, champion, runner_up | sports.sports_team_roster : player, team, position | time.event : start_date | type.object : type | award.award_category : date_established | sports.sports_team : team_mascot, championships, roster | media_common.netflix_genre : titles | location.location : people_born_here | people.deceased_person : place_of_burial\n\n\nquestion:\n\nWhen did the sports team whose mascot is named Lucky the Leprechaun win their first championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.03hb1rs .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1957 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrisbane: m.01b8jj | location.location : area, time_zones, people_born_here, contains, containedby | kg.object_profile : prominent_type | type.object : type | time.event : end_date | common.topic : notable_types | symbols.namesake : named_after | geography.river : origin\n\n\nquestion:\n\nWhere did the country whose capital is Brisbane get it name?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.administrative_division.capital ?k .\n?k ns:location.administrative_division_capital_relationship.capital ns:m.01b8jj .\n?c ns:symbols.namesake.named_after ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Queen Victoria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHank Baskett: m.0d81yf | Viktor the Viking: m.052tn0n | american_football.football_team : historical_coaching_staff, current_head_coach | american_football.football_historical_coach_position : coach | sports.professional_sports_team : draft_picks, owner_s | type.object : type | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start, career_end | sports.sports_league_draft_pick : player | common.topic : image, notable_types | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, fight_song, roster | sports.sports_team_roster : player, team, position | people.person : ethnicity, profession, nationality, gender | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat team with masccot Viktor the Viking did Hank Baskett play for in 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.team_mascot ns:m.052tn0n .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Minnesota Vikings"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nOrder of Saint Benedict: m.01cfj | Henry VIII of England: m.03p77 | religion.religion : deities, places_of_worship, types_of_places_of_worship, notable_figures, organizations, texts, is_part_of, beliefs, founding_figures | type.object : type | people.deceased_person : date_of_burial, place_of_burial, place_of_death | people.person : spouse_s, children, parents, religion | people.marriage : spouse, location_of_ceremony | music.composer : compositions | royalty.monarch : kingdom | government.politician : government_positions_held\n\n\nquestion:\n\nWhat religion with religious organization named Order of Saint Benedict was King Henry's VIII's religion?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03p77 ns:people.person.religion ?x .\n?x ns:religion.religion.organizations ns:m.01cfj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUtah Attorney General: m.0hzbyr1 | Utah: m.07srw | location.location : contains | tv.tv_location : tv_shows_filmed_here | government.politician : government_positions_held | people.person : profession, nationality, place_of_birth | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office | government.political_district : representatives | government.government_office_or_title : office_holders | type.object : type\n\n\nquestion:\n\nWho was the Attorney General of Utah and was the first to previously hold a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07srw ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.0hzbyr1 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mark Shurtleff"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDoug Williams: m.0443ql | 1942 NFL Championship Game: m.0266mjg | sports.sports_team : arena_stadium, founded, colors, location, fight_song, sport, previously_known_as, championships, roster | sports.sports_team_roster : player, team, position | people.person : children, profession, nationality, ethnicity, gender | kg.object_profile : prominent_type | sports.professional_sports_team : owner_s | sports.pro_athlete : teams, sports_played_professionally | common.topic : image, notable_types | sports.pro_sports_played : sport | american_football.football_team : current_head_coach | type.object : type | organization.organization : leadership | organization.leadership : person | american_football.football_player : position_s | sports.sports_championship_event : champion, runner_up\n\n\nquestion:\n\nWhat team that won the 1942 NFL Championship Game championship did Doug Williams play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0443ql ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.0266mjg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington Redskins"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nthe eternal city: m.06c62 | type.object : type | location.location : area, time_zones, people_born_here, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : construction_started | location.mailing_address : citytown | book.book_subject : works | aviation.airport : focus_city_for | people.person : place_of_birth, gender | media_common.netflix_title : netflix_genres | location.country : official_language\n\n\nquestion:\n\nWhat are the major languages of the country where Rome is?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.contains ?k .\n?k ns:location.mailing_address.citytown ns:m.06c62 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAudi of America: m.06zwtz0 | type.object : type | kg.object_profile : prominent_type | education.educational_institution : students_graduates, colors | education.education : student | location.location : containedby | organization.organization : date_founded | sports.sports_team : sport, roster | sports.sports_team_roster : position | common.topic : notable_types | government.governmental_body : members | government.government_position_held : office_holder | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | government.political_party : politicians_in_this_party | government.political_party_tenure : politician\n\n\nquestion:\n\nWho owned Audi of America in 2011?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.06zwtz0 .\n?c ns:organization.organization.parent ?y .\n?y ns:organization.organization_relationship.parent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Volkswagen Group"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDe divina proportione: m.06pqb_7 | book.written_work : subjects, date_of_first_publication, author, copyright_date | book.illustrator : books_illustrated | common.topic : notable_types | book.book : genre | people.person : gender | military.military_conflict : commanders | military.military_command : military_commander | people.deceased_person : place_of_death | influence.influence_node : influenced_by\n\n\nquestion:\n\nThe illustrator of the book DeDivina Proportione made what inventions?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:book.illustrator.books_illustrated ns:m.06pqb_7 .\n?c ns:base.argumentmaps.innovator.original_ideas ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Viola organista"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnthony A. Williams: m.03cjzz | Theodore Roosevelt: m.07hyk | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, from | government.political_appointer : appointees | government.politician : government_positions_held | location.country : administrative_divisions | type.object : type | location.statistical_region : part_time_employment_percent | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nWhere did Teddy Roosevelt live in the place that appointed Anthony A. Williams to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07hyk ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.03cjzz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington, D.C."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLance Leigh: m.010rv2r5 | Matt Dallas: m.0dfyw6 | film.actor : film | film.performance : character, actor, film | people.person : profession, nationality, height_meters, place_of_birth, gender | film.film_character : portrayed_in_films | kg.object_profile : prominent_type | common.topic : notable_types | film.film : language, release_date_s, costume_design_by, initial_release_date, country, genre, starring | film.film_regional_release_date : film_release_distribution_medium, release_date | type.object : type | tv.tv_program : episode_running_time, air_date_of_first_episode\n\n\nquestion:\n\nWhat film with character named Lance Leigh does Matt Dallas play in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0dfyw6 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.010rv2r5 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Naughty or Nice"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCook Islands: m.020p1 | location.location : time_zones, people_born_here, containedby | location.country : administrative_divisions | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | protected_sites.protected_site : date_established | architecture.structure : opened | people.person : profession\n\n\nquestion:\n\nWhich countries does the country containing Cook Islands export to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.020p1 .\n?c ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Japan, Kiribati, Tuvalu, United Kingdom, United States of America, Australia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | location.location : time_zones, people_born_here, contains, containedby | type.object : type | government.politician : government_positions_held | government.government_position_held : from, jurisdiction_of_office | people.deceased_person : cause_of_death, date_of_death | geography.mountain : prominence | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat city belongs to the country with the National Anthem Hen Wlad Fy Nhadau?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:g.121k3jd3 .\n?c ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United Kingdom, United Kingdom, with Dependencies and Territories"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrasília: m.01hy_ | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type | location.location : adjoin_s, time_zones, partially_containedby, contains, containedby | location.adjoining_relationship : adjoins | location.country : official_language, capital\n\n\nquestion:\n\nWhat is the official language of the country where Brasilia is the capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.01hy_ .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Portuguese Language"
    }
]