[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJerry Jones: m.016b9c | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | type.object : type | government.politician : government_positions_held | government.government_position_held : legislative_sessions, from, jurisdiction_of_office | sports.professional_sports_team : owner_s | people.deceased_person : date_of_death, place_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | common.topic : notable_types | baseball.baseball_player : position_s | kg.object_profile : prominent_type | sports.sports_championship_event : champion | sports.sports_team : championships\n\n\nquestion:\n\nWhen was the last time Jerry Jones' team win the Superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.016b9c .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.champion ?c .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XXX"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nitalian: m.02bjrlw | Amazon Time Zone: m.0y496y2 | type.object : type | location.location : adjoin_s, time_zones, people_born_here, contains, partially_contains | location.country : currency_formerly_used, administrative_divisions, capital, second_level_divisions, languages_spoken | language.human_language : countries_spoken_in | location.adjoining_relationship : adjoins | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | time.time_zone : locations_in_this_time_zone\n\n\nquestion:\n\nWhich italian speaking country uses Amazon Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02bjrlw ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.location.time_zones ns:m.0y496y2 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brazil"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSharia: m.074hw | common.topic : notable_types | people.person : religion, profession, nationality, parents, date_of_birth, place_of_birth, gender | government.politician : government_positions_held | government.government_position_held : basic_title, office_position_or_title, from, jurisdiction_of_office | type.object : type | religion.religion : beliefs, holidays | book.written_work : date_of_first_publication | kg.object_profile : prominent_type | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.political_appointer : appointees | film.film_subject : films\n\n\nquestion:\n\nWhat are the major holidays of the Sharia religion?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.beliefs ns:m.074hw .\n?c ns:religion.religion.holidays ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lailat al Mi'raj, Nuzul Al-Quran, Eid al-Fitr, Eid al-Adha, Day of Arafat, Day of Ashura, Mourning of Muharram, Laylat al-Qadr, Barat Night, Mawlid, Ramadan, Islamic New Year, Eid al-Fitr Eve, Eid-Ul-Adha Eve, Night of Wishes"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJazz: m.08_cpc | common.topic : notable_types | book.written_work : subjects, date_of_first_publication, author | book.book : genre | influence.influence_node : influenced_by, influenced | film.film_subject : films | visual_art.visual_artist : art_forms | book.illustrator : books_illustrated\n\n\nquestion:\n\nWhat type of artist is the person who illustrated the book \"Jazz\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:book.illustrator.books_illustrated ns:m.08_cpc .\n?c ns:visual_art.visual_artist.art_forms ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Collage, Drawing, Painting, Sculpture, Printmaking"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNordic countries: m.0140mf | Country: m.01mp | Lejre Municipality: m.010v_j8w | location.country : administrative_divisions, languages_spoken, form_of_government, second_level_divisions | location.location : containedby, events, time_zones, people_born_here, contains, partially_contains | type.object : name, type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | common.topic : notable_types\n\n\nquestion:\n\nWhat Nordic country has Lejre Municipality?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0140mf ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.010v_j8w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Denmark"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nState Elementary School Menteng 01: m.0280qps | common.topic : notable_types | location.location : time_zones, containedby, contains, people_born_here | type.object : type | kg.object_profile : prominent_type | architecture.structure : height_meters | people.person : place_of_birth\n\n\nquestion:\n\nWhat is the birthplace of the individual who attended State Elementary School Menteng 01?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0280qps .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Honolulu"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1996 NBA Finals: m.08x9jj | type.object : type | organization.organization_sector : organizations_in_this_sector | influence.influence_node : influenced_by, peers | influence.peer_relationship : peers | location.location : containedby, contains, people_born_here | base.culturalevent.event : entity_involved | film.film_subject : films | people.person : date_of_birth, gender | book.book_subject : works | common.topic : notable_types | law.inventor : inventions | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, appointed_by | basketball.basketball_team : head_coach | military.military_combatant : casualties | military.casualties : lower_estimate, military_conflict | film.film_genre : films_in_this_genre | sports.sports_championship_event : champion | military.military_conflict : casualties | sports.sports_team : championships | time.event : end_date, start_date, locations, instance_of_recurring_event | book.author : book_editions_published | book.book : genre | government.politician : government_positions_held | organization.organization_founder : organizations_founded | biology.animal_breed : place_of_origin\n\n\nquestion:\n\nWho is the head coach of the 1996 NBA Finals Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.08x9jj .\n?c ns:basketball.basketball_team.head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tom Thibodeau"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGerman Language: m.04306rv | Kleve (district): m.01b98m | location.location : events, adjoin_s, people_born_here, contains, partially_contains | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, governmental_body | location.country : official_language, form_of_government | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | language.human_language : countries_spoken_in | government.political_district : representatives | location.adjoining_relationship : adjoins | media_common.netflix_genre : titles\n\n\nquestion:\n\nWhich countries have German as the official language, that is the location contains and airport that serves the location of Kleve district ?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04306rv ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.official_language ns:m.04306rv .\n?x ns:location.location.contains ?c .\n?c ns:aviation.airport.serves ns:m.01b98m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Germany"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBenny the Bull: m.067z_k | people.person : nationality, height_meters | type.object : type | location.location : contains, people_born_here | sports.sports_team : team_mascot, championships | kg.object_profile : prominent_type | time.event : start_date | film.film_subject : films | location.place_with_neighborhoods : neighborhoods | sports.pro_athlete : teams | sports.sports_team_roster : team | sports.sports_championship_event : championship | basketball.basketball_player : position_s | sports.sports_facility : teams | film.film_location : featured_in_films\n\n\nquestion:\n\nWhat was the last championship won by the team whose mascot is Benny the Bull?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.067z_k .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1998 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAuburn Tigers men's basketball: m.02qg5nd | sports.sports_team : founded, colors, team_mascot, sport, championships, roster | type.object : type | american_football.football_team : current_head_coach | people.person : religion, profession, height_meters, place_of_birth, gender | media_common.netflix_genre : titles | kg.object_profile : prominent_type | location.location : containedby | sports.sports_team_roster : team, position | common.topic : notable_types | sports.pro_athlete : teams, sports_played_professionally | sports.defunct_sports_team : later_known_as | sports.pro_sports_played : sport | sports.professional_sports_team : draft_picks | sports.sports_league_draft_pick : player | education.educational_institution : sports_teams\n\n\nquestion:\n\nWHat location includes the university that has the Auburn Tigers men's basketball team located at?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.02qg5nd .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Auburn University Historic District, United States of America, Alabama, Auburn"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nnixon: m.06c97 | type.object : type | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, appointed_by, to, governmental_body | people.ethnicity : languages_spoken | people.person : religion, profession, gender | government.political_appointer : appointees | government.us_president : vice_president | government.governmental_body : members | government.politician : government_positions_held | government.government_office_category : officeholders | film.film : subjects | education.school : nces_school_id | time.event : includes_event, locations | organization.organization_sector : organizations_in_this_sector | people.marriage : spouse | location.location : contains\n\n\nquestion:\n\nWho were Vice-President for Nixon that held his government position from 1965?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06c97 ns:government.us_president.vice_president ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Spiro Agnew, Gerald Ford"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUtah Attorney General: m.0hzbyr1 | Gary Herbert: m.0dbg7w | government.politician : government_positions_held | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | film.film : release_date_s | type.object : type | people.person : religion, profession, nationality, gender | finance.currency : countries_used | government.government_office_category : officeholders | government.government_office_or_title : office_holders | location.location : partially_containedby, contains, people_born_here | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | people.deceased_person : cause_of_death | location.location_symbol_relationship : Kind_of_symbol | religion.religion : texts\n\n\nquestion:\n\nWho won attorney general at the location that appointed Gary Herbert to govermental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0dbg7w .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.0hzbyr1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "John Swallow, Mark Shurtleff, Sean Reyes"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBenjamin Netanyahu: m.0fm2h | people.person : profession, nationality, parents, date_of_birth, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | type.object : type | government.government_position_held : basic_title, from, governmental_body | location.religion_percentage : religion | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.political_party_tenure : party | location.statistical_region : religions | american_football.football_player : position_s | military.military_person : participated_in_conflicts | people.deceased_person : date_of_death\n\n\nquestion:\n\nWhat are the major religions where Benjamin Netanyahu is in a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0fm2h .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAegukka: m.01qmpp | location.location : people_born_here, contains, containedby | people.person : religion, profession, nationality, place_of_birth, gender | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, to | biology.animal_breed : place_of_origin | government.form_of_government : countries | type.object : name, type | finance.currency : countries_used, countries_formerly_used | kg.object_profile : prominent_type | government.government_office_category : officeholders | architecture.structure : construction_started | location.country : form_of_government | film.film : genre | government.government_office_or_title : office_holders | time.time_zone : locations_in_this_time_zone | time.event : start_date | base.culturalevent.event : entity_involved | government.government : government_for\n\n\nquestion:\n\nWhat type of government system does the country with National Anthem Aegukka have?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01qmpp .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Juche, Socialist state, Single-party state"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMurray River: m.04_4l | Kevin Rudd: m.021l9k | government.governmental_jurisdiction : governing_officials | location.location : people_born_here, contains, containedby | government.government_position_held : office_holder | geography.body_of_water : bridges | military.military_combatant : casualties | military.casualties : military_conflict | type.object : type | people.person : religion, gender | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | common.topic : notable_types | measurement_unit.dated_integer : number | location.country : administrative_divisions\n\n\nquestion:\n\nWhere is the Murray River located where they appointed Kevin Rudd to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04_4l ns:location.location.containedby ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.021l9k .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Australia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNigerian naira: m.018cg3 | location.location : time_zones, area, contains, containedby | government.politician : government_positions_held | government.government_position_held : office_position_or_title | people.person : profession, nationality, date_of_birth, place_of_birth, gender | government.form_of_government : countries | common.topic : notable_types | type.object : type | location.country : official_language, currency_used | location.administrative_division : country | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat main language is used in the country that uses Nigerian Naira?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.018cg3 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Abkhazia: m.011jw | Country: m.01mp | location.location : partially_contains, adjoin_s, people_born_here, partially_containedby, contains, containedby | government.government_office_category : officeholders | government.government_position_held : office_holder | location.country : national_anthem, administrative_divisions, form_of_government | government.national_anthem_of_a_country : anthem | government.governmental_jurisdiction : governing_officials | common.topic : notable_types | type.object : name, type | people.person : nationality | location.adjoining_relationship : adjoins | time.time_zone : locations_in_this_time_zone | finance.currency : countries_used\n\n\nquestion:\n\nWhich former USSR country shares a border with Russia also has a region called Abkhazia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.011jw .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Georgia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1994 Stanley Cup Finals: m.026km3d | people.person : children, profession, nationality, ethnicity, spouse_s, gender | type.object : type | language.human_language : countries_spoken_in | sports.sports_championship_event : championship | location.location : contains, containedby | biology.animal_breed : place_of_origin | government.politician : government_positions_held | government.government_position_held : basic_title | sports.sports_team : arena_stadium, championships | kg.object_profile : prominent_type | book.book_subject : works | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | time.event : includes_event, start_date | film.actor : film | film.performance : film | organization.membership_organization : members | organization.organization_membership : member\n\n\nquestion:\n\nWhere does the champion of the 1994 Stanley Cup Finals play at?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.026km3d .\n?c ns:sports.sports_team.arena_stadium ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Madison Square Garden"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1970 World Series: m.04jg7y | sports.sports_championship : events | time.recurring_event : instances | sports.sports_team : arena_stadium, colors, team_mascot, location, championships, roster | sports.sports_team_roster : position | type.object : type | sports.sports_championship_event : runner_up\n\n\nquestion:\n\nWhat years has the team that won the 1970 World Series Championship go to the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04jg7y .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1983 World Series, 1970 World Series, 1966 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPink Floyd: m.01wv9xn | Radio K.A.O.S.: m.02vxm3d | Lead Vocals: m.0_sv_90 | Vocals: m.0290ngj | music.lyricist : lyrics_written | people.person : religion, profession, nationality, date_of_birth, height_meters, gender | music.artist : genre, label, concert_tours | film.music_contributor : film | film.writer : film | type.object : type | film.film_story_contributor : film_story_credits | book.author : works_written | music.group_member : instruments_played\n\n\nquestion:\n\nWhich musical artist had a tour called K.A.O.S and was once a part of Pink Floyd?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.01wv9xn ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x ;\nns:music.group_membership.role ns:m.0290ngj . #vocals\n}\nUNION\n{\nns:m.01wv9xn ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x ;\nns:music.group_membership.role ns:m.0_sv_90 . #lead vocals\n}?x ns:music.artist.concert_tours ns:m.02vxm3d .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Roger Waters"
    }
]