[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBookkeeping: m.01h5g | people.person : profession | type.object : type | common.topic : notable_types | language.human_language : language_family, main_country, countries_spoken_in | influence.influence_node : influenced | automotive.company : make_s | law.invention : inventor | film.film_genre : films_in_this_genre | book.book_subject : works | media_common.netflix_genre : titles | music.artist : genre | kg.object_profile : prominent_type | music.genre : albums | location.country : form_of_government | language.language_family : languages | religion.religion : places_of_worship\n\n\nquestion:\n\nA person who studies Bookkeping is best known to be in what educational major field?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.major_field_of_study ns:m.01h5g .\n?c ns:people.person.profession ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Businessperson, Business magnate, Industrialist, Inventor, Engineer, Entrepreneur"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nButler Blue: m.0j3dg_1 | Kurt Vonnegut: m.049gc | book.author : book_editions_published, works_written | influence.influence_node : influenced_by, influenced | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | common.topic : notable_types | people.deceased_person : date_of_death, place_of_death | type.object : type | media_common.dedicator : dedications | media_common.dedication : work_dedicated | location.location : containedby | education.educational_institution : mascot, sports_teams, colors | people.person : religion, quotations, profession, nationality, education, gender | award.award_nominee : award_nominations | award.award_nomination : nominated_for | education.education : institution | kg.object_profile : prominent_type | organization.organization : date_founded | military.military_person : participated_in_conflicts\n\n\nquestion:\n\nWhat school with the mascot Butler Blue did Kurt Vonnegut attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.049gc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.mascot ns:m.0j3dg_1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Butler University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral Western Time Zone: m.0y498v7 | government.politician : government_positions_held | government.government_position_held : from, appointed_by, jurisdiction_of_office | people.deceased_person : cause_of_death, date_of_death | type.object : type | people.person : profession, nationality, date_of_birth, place_of_birth, gender | film.film : country | architecture.building : floors | location.country : languages_spoken | architecture.structure : height_meters | location.location : time_zones, containedby | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat languages are used in the place which uses the Central Western Time ZOne?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.time_zones ns:m.0y498v7 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language, Esperanto Language, Lojban"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLila Tretikov: m.010gpl04 | people.person : religion, profession, nationality, parents, place_of_birth, gender | type.object : type | location.location : contains, containedby | government.politician : government_positions_held, party | government.government_position_held : basic_title, jurisdiction_of_office, to, governmental_body | people.deceased_person : cause_of_death, place_of_death | common.topic : notable_types | kg.object_profile : prominent_type | government.political_party_tenure : party | people.ethnicity : geographic_distribution\n\n\nquestion:\n\nLila Tretikov is a person in the organization owned by whom?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.010gpl04 .\n?c ns:organization.organization.board_members ?y .\n?y ns:organization.organization_board_membership.member ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jan-Bart de Vreede, Frieda Brioschi, Stuart West, Domas Mituzas, Michael Snow, Florence Devouard, Jimmy Wales, Ting Chen, Kat Walsh"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1995 World Series: m.04j712 | time.recurring_event : instances | sports.sports_team : arena_stadium, founded, colors, team_mascot, location, championships, roster | sports.sports_championship : events | type.object : type | sports.sports_championship_event : championship | sports.sports_team_roster : player | kg.object_profile : prominent_type | location.location : events | time.event : locations\n\n\nquestion:\n\nWhen did the team who won the 1995 World Series championship win the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04j712 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1995 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nManny Ramirez: m.06tjlc | Slider: m.02w_rtq | sports.pro_athlete : teams, career_start | sports.sports_team_roster : player, team, position | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, previously_known_as, championships, roster | type.object : type | people.person : profession, nationality, place_of_birth, gender | sports.professional_sports_team : owner_s | kg.object_profile : prominent_type | baseball.baseball_team : current_manager | sports.defunct_sports_team : later_known_as | common.topic : notable_types\n\n\nquestion:\n\nWhat team with a mascot named Slider did Manny Ramirez play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06tjlc ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.team_mascot ns:m.02w_rtq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Cleveland Indians"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVietnam: m.01crd5 | Country: m.01mp | Lao kip: m.04k4j1 | location.location : contains, people_born_here | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | type.object : name, type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | finance.currency : countries_used | royalty.kingdom : rulers | location.country : currency_used, languages_spoken | food.beer_country_region : beers_from_here\n\n\nquestion:\n\nWhat country bordering Vietnam that uses Lao Kip as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01crd5 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.04k4j1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Laos"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJacob Zuma: m.0466k4 | government.politician : government_positions_held, party | type.object : type | common.topic : notable_types | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.government_position_held : basic_title, jurisdiction_of_office, from, governmental_body | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | kg.object_profile : prominent_type | film.director : film | government.political_party_tenure : party | music.artist : genre | people.deceased_person : cause_of_death, date_of_death\n\n\nquestion:\n\nThe location that appointed Jacob Zuma to govermental position is part of what continent?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0466k4 .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Africa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nServicos Internacionais Ltda: m.09mn48l | type.object : type | organization.organization : headquarters, date_founded | location.location : containedby | education.educational_institution : school_type | kg.object_profile : prominent_type | sports.sports_team : sport, founded | common.topic : notable_types | business.business_operation : industry | government.governmental_body : members | government.government_position_held : basic_title\n\n\nquestion:\n\nWhat city is the barch company from Servicos Internacionais located at?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.09mn48l .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAustin: m.0vzm | location.location : contains, people_born_here | location.statistical_region : population, gdp_real | measurement_unit.adjusted_money_value : adjusted_value | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | book.book_subject : works | travel.travel_destination : tourist_attractions | travel.tourist_attraction : near_travel_destination | fictional_universe.fictional_setting : fictional_characters_born_here | architecture.museum : established | government.political_district : representatives | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat museum was established in 1994 and there is to see in Austin, Texas?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0vzm ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:architecture.museum.established \"1994\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Texas Department of Public Safety Historical Museum and Research Center"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGerman Language: m.04306rv | East Berlin: m.02lcc | language.human_language : countries_spoken_in, language_family, dialects, iso_639_1_code, main_country | location.country : currency_formerly_used, currency_used, calling_code, official_language, capital, languages_spoken, form_of_government | fictional_universe.fictional_language : where_spoken | type.object : type | media_common.netflix_genre : titles | kg.object_profile : prominent_type | location.location : containedby, contains, people_born_here | book.book_subject : works | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : basic_title, office_holder | common.topic : notable_types\n\n\nquestion:\n\nWhat country has the german speaking capital city of East Berlin?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04306rv ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.official_language ns:m.04306rv .\n?x ns:location.country.capital ns:m.02lcc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "East Germany"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAutonomous Province of Kosovo and Metohija: m.03qd00g | location.location : time_zones, area, containedby | type.object : type | location.country : official_language, administrative_divisions | kg.object_profile : prominent_type | geography.river : basin_countries | common.topic : notable_types | architecture.structure : height_meters | location.mailing_address : citytown\n\n\nquestion:\n\nThe country that contains Autonomous Province of Kosovo and Metohija uses what language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03qd00g .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Serbian language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral Africa Time Zone: m.0gsrfj | s. africa: m.0hzlz | kg.object_profile : prominent_type | type.object : type | location.location : time_zones, contains, containedby | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder\n\n\nquestion:\n\nWith which Central Africa Time Zone country does South Africa trade with?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0hzlz ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.0hzlz ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.location.time_zones ns:m.0gsrfj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mozambique, Zimbabwe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nnfl super bowl: m.06x5s | Jerry Jones: m.016b9c | award.award_nominee : award_nominations | award.award_nomination : nominated_for | government.governmental_body : members | government.government_position_held : basic_title, office_holder, to, from | people.person : religion, profession, nationality, ethnicity, education, date_of_birth, gender | education.education : degree | book.author : works_written | kg.object_profile : prominent_type | common.topic : notable_types | sports.sports_team : founded, championships | location.location : time_zones, contains, people_born_here | type.object : type | film.actor : film | film.performance : film | sports.professional_sports_team : owner_s | time.event : included_in_event | government.political_appointer : appointees | influence.influence_node : influenced_by, influenced | government.politician : government_positions_held | base.culturalevent.event : entity_involved | music.artist : genre | fictional_universe.fictional_character : gender | film.film : featured_film_locations | symbols.name_source : namesakes | visual_art.visual_artist : art_forms | sports.sports_championship_event : championship | people.deceased_person : place_of_death\n\n\nquestion:\n\nWhat was the last Superbowl won by the team owned by Jerry Jones?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.016b9c .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.championship ns:m.06x5s .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XXX"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1980 NBA Finals: m.08x9_6 | Lamar Odom: m.02_nkp | sports.sports_team : arena_stadium, founded, colors, sport, championships, roster | type.object : type | sports.pro_athlete : teams | sports.sports_team_roster : player, team, position | sports.professional_sports_team : owner_s | people.person : spouse_s, nationality, gender | basketball.basketball_player : player_statistics, position_s | award.award_nominee : award_nominations | award.award_nomination : award, nominated_for | kg.object_profile : prominent_type | organization.organization : leadership | organization.leadership : person | time.event : start_date | people.marriage : location_of_ceremony | common.topic : image, notable_types | sports.sports_championship_event : championship, runner_up\n\n\nquestion:\n\nWho were the 1980 NBA Finals champions that Lamar Odom is now playing for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02_nkp ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.08x9_6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Los Angeles Lakers"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMary Todd Lincoln: m.01ypl0 | The Bible: m.015j7 | religion.religion : deities, places_of_worship, types_of_places_of_worship, notable_figures, organizations, texts, is_part_of, beliefs, founding_figures | people.deceased_person : place_of_death | people.person : spouse_s, religion, height_meters, gender | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title, from, to | film.film_subject : films | book.book : genre | common.topic : notable_types | medicine.notable_person_with_medical_condition : condition | people.marriage : spouse, location_of_ceremony\n\n\nquestion:\n\nWhat religion was Mary Todd Lincoln that uses the Bible?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01ypl0 ns:people.person.religion ?x .\n?x ns:religion.religion.texts ns:m.015j7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBursa: m.0160d | Mother Teresa: m.01yv6p | location.location : time_zones, containedby, contains, people_born_here | location.statistical_region : religions | location.religion_percentage : religion | type.object : type | location.country : currency_formerly_used, currency_used, administrative_divisions, national_anthem, official_language, capital, form_of_government | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | people.person : religion, quotations, profession, nationality, height_meters, place_of_birth, gender | base.activism.activist : area_of_activism | kg.object_profile : prominent_type | people.deceased_person : date_of_death, place_of_death | award.award_winner : awards_won | award.award_honor : award | common.topic : notable_types | film.film_subject : films | influence.influence_node : influenced_by, influenced | military.military_combatant : casualties | military.casualties : military_conflict | government.national_anthem_of_a_country : anthem | symbols.namesake : named_after\n\n\nquestion:\n\nWhat is the country that Mother Teresa come from that has the capital is Bursa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01yv6p ns:people.person.nationality ?x .\n?x ns:location.country.capital ns:m.0160d .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ottoman Empire"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBenjamin Netanyahu: m.0fm2h | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | location.country : official_language | government.politician : government_positions_held, party | type.object : type | government.government_position_held : basic_title, from, appointed_by, to, governmental_body | people.deceased_person : date_of_death, place_of_death | government.political_party_tenure : party | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | fictional_universe.fictional_character : gender | american_football.football_player : position_s | architecture.structure : opened\n\n\nquestion:\n\nThe location that appointed Benjamin Netanyahu to governmental position has what dominant language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0fm2h .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hebrew Language, Arabic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQaumi Taranah: m.029dkf | influence.influence_node : influenced_by | language.human_language : main_country, countries_spoken_in | common.topic : notable_types | people.person : religion, profession, nationality, parents, gender | government.politician : government_positions_held | type.object : name, type | architecture.structure : opened, height_meters | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.government_position_held : office_holder, basic_title, office_position_or_title, from, governmental_body | government.government_office_category : officeholders | people.ethnicity : languages_spoken | location.location : contains, people_born_here | location.country : official_language | kg.object_profile : prominent_type | government.form_of_government : countries | government.government_office_or_title : office_holders | military.military_person : participated_in_conflicts | government.governmental_body : members\n\n\nquestion:\n\nWhat languages are used in the country that has national anthem Qaumi Taranah?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.029dkf .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language, Urdu Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAfrikaans Language: m.0x82 | Kavango Region: m.029l0m | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.country : administrative_divisions | location.location : partially_contains, adjoin_s, time_zones, contains, containedby | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | common.topic : notable_types | location.adjoining_relationship : adjoins | language.human_language : iso_639_1_code, main_country, countries_spoken_in | location.administrative_division : country\n\n\nquestion:\n\nThe Kavango Region is part of what Afrikaans speaking country?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0x82 ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.administrative_divisions ns:m.029l0m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Namibia"
    }
]