[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAdly Mansour: m.0w5nf92 | government.politician : government_positions_held, party | government.political_party_tenure : party | music.group_member : instruments_played | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.government_position_held : basic_title, from, jurisdiction_of_office | common.topic : notable_types | fictional_universe.fictional_character : place_of_birth | people.deceased_person : cause_of_death, date_of_death, place_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | type.object : type | music.artist : genre | american_football.football_player : position_s | location.country : official_language | kg.object_profile : prominent_type | time.event : includes_event\n\n\nquestion:\n\nWhat is the language spoken where Adly Mansour holds a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0w5nf92 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Modern Standard Arabic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrazilian real: m.03385m | type.object : name, type | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | government.politician : government_positions_held | government.government_position_held : basic_title, to, from, jurisdiction_of_office | location.country : currency_used, languages_spoken | architecture.structure : height_meters | common.topic : notable_types | location.location : containedby, contains, people_born_here | people.deceased_person : date_of_death, place_of_death | government.form_of_government : countries | finance.currency : countries_used\n\n\nquestion:\n\nWhich language is spoken, where the currency used in the country is the Brazilian real, utilize?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.03385m .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Brazilian Portuguese, Portuguese Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nH D Tomahawk Kaphaem Road LLC: m.09mqm6y | location.location : containedby | type.object : type | organization.organization : headquarters, founders, parent, date_founded | common.topic : notable_types | sports.sports_team : founded | kg.object_profile : prominent_type | travel.tourist_attraction : near_travel_destination | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | location.mailing_address : citytown | organization.organization_relationship : parent | fictional_universe.school_in_fiction : students_graduates | basketball.basketball_team : head_coach | education.educational_institution : school_type, students_graduates, colors | education.education : student\n\n\nquestion:\n\nWhat state is the headquarters of H D Tomahawk Kaphaem Road LLC?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.09mqm6y .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Milwaukee"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nside chapel: m.0173tc | Canada: m.0d060g | location.location : time_zones, adjoin_s, contains, people_born_here | location.statistical_region : population, consumer_price_index, cpi_inflation_rate, gdp_real, religions, long_term_unemployment_rate, size_of_armed_forces, co2_emissions_per_capita, part_time_employment_percent, net_migration | measurement_unit.dated_integer : number | sports.sports_team_location : teams | measurement_unit.adjusted_money_value : adjusted_value | religion.religion : beliefs, places_of_worship, types_of_places_of_worship | location.adjoining_relationship : adjoins | measurement_unit.dated_percentage : rate | book.book_subject : works | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : office_holder | location.religion_percentage : religion | location.country : administrative_divisions | architecture.building_function : buildings\n\n\nquestion:\n\nWhat major religion in Canada has the Chapel as a place of worship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d060g ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.types_of_places_of_worship ns:m.0173tc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPresident of the European Parliament: m.039h0j | government.politician : government_positions_held | type.object : name, type | location.location : partially_contains, contains, people_born_here | government.government_position_held : office_holder, district_represented, basic_title, legislative_sessions, to, governmental_body | location.country : form_of_government | people.person : profession, nationality, parents, date_of_birth, place_of_birth | location.mailing_address : country | government.governmental_body : members, jurisdiction | language.human_language : main_country, countries_spoken_in | government.political_district : representatives | royalty.kingdom : rulers | common.topic : image | fictional_universe.fictional_setting : fictional_characters_born_here | government.government_office_or_title : office_holders\n\n\nquestion:\n\nWhat languages are officially spoken in the organization that includes a leadership role called President of the European Parliament?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.role ns:m.039h0j .\n?c ns:user.ktrueman.default_domain.international_organization.official_language_s ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Dutch Language, English Language, Greek Language, German Language, Polish Language, Portuguese Language, French, Swedish Language, Spanish Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSaint Mary's Gaels men's basketball: m.0dlk29f | people.person : nationality, ethnicity, places_lived, spouse_s, place_of_birth | people.place_lived : location | type.object : type | sports.sports_team : arena_stadium, founded, colors, location, sport, venue, roster | education.educational_institution : mascot, sports_teams, students_graduates, colors | education.education : student | organization.organization : date_founded | kg.object_profile : prominent_type | people.deceased_person : place_of_death | common.topic : notable_types | award.award_nominee : award_nominations | award.award_nomination : award | american_football.football_team : current_head_coach | sports.pro_athlete : teams | sports.sports_team_roster : player, team | sports.team_venue_relationship : venue | people.marriage : location_of_ceremony\n\n\nquestion:\n\nWhat is the mascot of the school that has Saint Mary's Gaels men's basketball?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.0dlk29f .\n?c ns:education.educational_institution.mascot ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Saint Mary's College of California Gael"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAyman al-Zawahiri: m.01vcb_ | location.location : contains | religion.religion : notable_figures, sacred_sites, places_of_worship, texts | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, governmental_body | base.culturalevent.event : entity_involved | people.person : profession, gender | food.beer_country_region : beers_from_here | location.country : administrative_divisions | type.object : type | film.film_subject : films | common.topic : notable_types\n\n\nquestion:\n\nWhere did the group who has someone in leadership named Ayman al-Zawahiri attack?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.01vcb_ .\n?c ns:base.disaster2.attacker.attack_s ?y .\n?y ns:base.disaster2.attack_process.attack_event ?x .\n?y ns:base.disaster2.attack_process.attacker ?c .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Taliban insurgency, September 11 attacks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2011 NFL draft: m.05sys3j | 2013 AFC Championship Game: m.0_gtz8t | sports.sports_team : arena_stadium, founded, colors, team_mascot, location, fight_song, championships, roster | sports.sports_team_roster : player | type.object : type | time.event : start_date, locations, instance_of_recurring_event | film.film_subject : films | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | sports.sports_league_draft_pick : draft, player | american_football.football_team : current_head_coach, division | sports.professional_sports_team : draft_picks, owner_s | common.topic : notable_types | people.person : profession, nationality | sports.drafted_athlete : drafted | kg.object_profile : prominent_type\n\n\nquestion:\n\nWho was drafted in 2011 by the football squad that claimed the 2013 AFC Championship Game championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gtz8t .\n?c ns:sports.professional_sports_team.draft_picks ?y .\n?y ns:sports.sports_league_draft_pick.player ?x .\n?y ns:sports.sports_league_draft_pick.draft ns:m.05sys3j .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jimmy Smith"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBetty Rizzo: m.0fqbs6 | Girl Fixing Hair in Mirror at Drive-in: m.0y5cjv4 | location.location : contains, people_born_here | film.film_genre : films_in_this_genre | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | kg.object_profile : prominent_type | film.performance : character, actor, film | media_common.netflix_genre : titles | film.film_character : portrayed_in_films | film.film : starring | people.person : profession, gender | location.statistical_region : population | measurement_unit.dated_integer : number | fictional_universe.fictional_character : gender | language.human_language : countries_spoken_in | people.deceased_person : cause_of_death\n\n\nquestion:\n\nIn the movie that has a girl fixing a mirror at the drive in as a character, who played Betty Rizzo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0y5cjv4 .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0fqbs6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Stockard Channing"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1969 World Series: m.04jg9_ | World Series: m.0fjp3 | time.recurring_event : date_of_first_occurance, current_frequency, instances | sports.sports_championship : events | sports.sports_championship_event : championship\n\n\nquestion:\n\nIn what year did the team that won the 1969 World Series championship win their first World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04jg9_ .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.championship ns:m.0fjp3 .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1969 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCarlos Santana: m.01304j | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally, career_start | film.film : genre | kg.object_profile : prominent_type | government.politician : government_positions_held, party | government.government_position_held : basic_title, from | government.political_party_tenure : party | sports.pro_sports_played : sport | type.object : type | people.deceased_person : cause_of_death | american_football.football_player : position_s | location.location : containedby | film.music_contributor : film\n\n\nquestion:\n\nWhere does Carlos Santana live, and who's the pro athlete born here, that began his career in 2007?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01304j ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:location.location.people_born_here ?c .\n?c ns:sports.pro_athlete.career_start \"2007\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "San Francisco"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nvirgin birth: m.012lvl | people.person : religion, children, profession, nationality, places_lived, date_of_birth, place_of_birth, gender | people.deceased_person : cause_of_death, place_of_death | type.object : type | people.place_lived : location | government.politician : government_positions_held, party | religion.religion : beliefs, texts | common.topic : notable_types | government.political_party_tenure : party\n\n\nquestion:\n\nWhich bibles go according to the religious belief in the Virgin birth of Jesus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.beliefs ns:m.012lvl .\n?c ns:religion.religion.texts ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "The Bible, Book of Nehemiah, New Testament, Old Testament"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Tartan: m.02z3cj | Kurt Vonnegut: m.049gc | influence.influence_node : influenced_by, influenced | organization.organization : founders | common.topic : notable_types | type.object : type | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | people.person : religion, quotations, profession, education, gender | education.educational_institution : students_graduates, colors, newspaper | people.deceased_person : date_of_death | education.education : institution, student | kg.object_profile : prominent_type | award.award_nominee : award_nominations | award.award_nomination : nominated_for | symbols.namesake : named_after | book.author : book_editions_published, works_written | film.film_story_contributor : film_story_credits | location.location : containedby | medicine.cancer_center_constituent : cancer_center\n\n\nquestion:\n\nWhat college did Kurt Vonnegut attend that has the newspaper The Tartan?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.049gc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.newspaper ns:m.02z3cj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Carnegie Mellon University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAir Force Falcons men's basketball: m.05cf7kb | organization.organization : headquarters, date_founded | type.object : type | education.educational_institution : school_type, sports_teams | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, roster | sports.sports_team_roster : player, team, position | location.location : containedby | kg.object_profile : prominent_type | sports.defunct_sports_team : later_known_as | basketball.basketball_player : position_s | american_football.football_team : division | people.person : gender | sports.school_sports_team : school | sports.pro_athlete : teams, sports_played_professionally, career_start | location.mailing_address : state_province_region | sports.pro_sports_played : sport | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nWhat state was the institution that has the Air Force Falcon's men's basketball team established?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.05cf7kb .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.state_province_region ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colorado"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAuburn Tigers football: m.086hg9 | people.person : height_meters, profession, nationality, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | influence.influence_node : influenced | sports.sports_team : roster | sports.sports_team_roster : position | kg.object_profile : prominent_type | type.object : type | location.location : containedby | award.award_nominee : award_nominations | award.award_nomination : award | education.educational_institution : sports_teams | organization.organization : date_founded | american_football.football_player : position_s\n\n\nquestion:\n\nWhat city and state is the University that is home to the Auburn Tigers football team?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.086hg9 .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Auburn University Historic District, United States of America, Alabama, Auburn"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRobert G. Cole Junior-Senior High School: m.04r1zr | organization.organization : headquarters, date_founded | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | sports.sports_team : founded, colors | location.location : containedby | type.object : type | sports.pro_athlete : teams | common.topic : notable_types | kg.object_profile : prominent_type | education.educational_institution : colors | sports.sports_team_roster : team | sports.sports_league : teams | sports.sports_league_participation : team | government.governmental_body : members | government.government_position_held : office_holder | fictional_universe.school_in_fiction : students_graduates\n\n\nquestion:\n\nWhat was the first team that the the famous athlete who went to Cole Junior-Senior High School play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.04r1zr .\n?c ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?y ns:sports.sports_team_roster.from ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "LSU Tigers men's basketball"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCarlton the Bear: m.078gsn | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.sports_team_roster : player, team, position | sports.pro_sports_played : sport, career_start, career_end | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.sports_championship_event : champion, runner_up | type.object : type | time.event : start_date | sports.sports_team : team_mascot, roster\n\n\nquestion:\n\nWhat is the sport played by the team with a mascot known as Carlton the Bear?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.078gsn .\n?c ns:base.events.event_presenting_organisation.event_feed ?y .\n?y ns:base.events.event_feed.type_of_event ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ice Hockey"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLast Girl on Earth: m.09ghb6b | music.album : release_date | film.film : language, genre, release_date_s | film.film_regional_release_date : film_release_distribution_medium, release_date | time.event : start_date | people.person : nationality, place_of_birth | music.artist : album, origin, concert_tours | type.object : type | music.genre : albums | award.award_category : date_established | film.film_character : portrayed_in_films | film.performance : actor | people.deceased_person : place_of_death\n\n\nquestion:\n\nThe artist of the concert tour the Last Girl on Earth came from where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.09ghb6b .\n?c ns:music.artist.origin ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barbados, Saint Michael Parish"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBarack Obama: m.02mjmr | Tendangan Si Madun: m.0vb3kp7 | location.location : contains, people_born_here | government.political_appointer : appointees | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to | type.object : type | tv.tv_location : tv_shows_filmed_here | government.politician : government_positions_held | people.person : education, places_lived, height_meters, quotations | government.governmental_jurisdiction : governing_officials | kg.object_profile : prominent_type | people.place_lived : location | book.author : book_editions_published, works_written | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : speech_topic, event | education.education : institution | film.film_subject : films\n\n\nquestion:\n\nWhere is the location that the tv show Tendangan Si Madun was filmed and also where ex-President Obama lives?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02mjmr ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\nEXISTS {?y ns:people.place_lived.end_date ?sk1 .\nEXISTS {?y ns:people.place_lived.start_date ?sk3 .\n?x ns:tv.tv_location.tv_shows_filmed_here ns:m.0vb3kp7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jakarta"
    }
]