[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nElliot Lake Secondary School: m.026kj1c | kg.object_profile : prominent_type | location.location : containedby | sports.sports_team : founded | education.educational_institution : students_graduates, colors, newspaper | education.education : student | type.object : type | music.composer : compositions | government.governmental_body : members | government.government_position_held : office_holder | organization.organization : leadership, date_founded, parent | organization.leadership : role | exhibitions.exhibition_venue : exhibitions_at_this_venue | exhibitions.exhibition_run : opened_on | common.topic : notable_types | organization.organization_relationship : parent | sports.sports_team_owner : teams_owned\n\n\nquestion:\n\nWhat well known songs are written the a famous alumni of Elliott Lake Secondary School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.026kj1c .\n?c ns:music.composer.compositions ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Facts of Life, The Facts of Life, Hockey Sock Rock, It Takes Diff'rent Strokes, Arnold & Willy (Diff'rent Strokes), Big Wheels"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArgentina Time Zone: m.043wffn | Country: m.01mp | South America: m.06n3y | location.location : containedby, adjoin_s, time_zones, people_born_here, contains, partially_contains | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : office_holder | type.object : name, type | food.beer_country_region : beers_from_here | common.topic : notable_types | location.country : official_language, administrative_divisions | time.time_zone : locations_in_this_time_zone | location.statistical_region : co2_emissions_per_capita | media_common.netflix_genre : titles | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat part of South American is made up of the Argentina Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06n3y ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.time_zones ns:m.043wffn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Suriname, Argentina"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBulawayo: m.01zsfx | s. africa: m.0hzlz | location.statistical_region : places_imported_from | location.imports_and_exports : imported_from | location.location : adjoin_s, time_zones, people_born_here, contains, containedby | periodicals.newspaper_circulation_area : newspapers | people.person : religion, gender | location.country : administrative_divisions, languages_spoken, form_of_government | common.topic : image, notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | symbols.coat_of_arms_bearer : coat_of_arms_used | symbols.armorial_grant : coat_of_arms | location.adjoining_relationship : adjoins | type.object : type | time.time_zone : locations_in_this_time_zone | film.film_location : featured_in_films\n\n\nquestion:\n\nWhat country borders South America and contains Bulawayo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hzlz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:location.country.administrative_divisions ns:m.01zsfx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Zimbabwe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLeo Howard: m.05sqlp_ | Heavy Duty: m.02676f9 | film.film : release_date_s, country, sequel, genre, directed_by, language, film_production_design_by, runtime, produced_by, film_art_direction_by, edited_by, written_by, initial_release_date, subjects, story_by, executive_produced_by, featured_film_locations, costume_design_by, starring | film.film_regional_release_date : film_release_distribution_medium, release_date | type.object : type | film.actor : film | film.performance : character, actor, film | fictional_universe.fictional_character : occupation, gender | common.topic : notable_types | people.person : profession, height_meters | kg.object_profile : prominent_type | film.film_character : portrayed_in_films | award.award_nominated_work : award_nominations | film.film_cut : runtime\n\n\nquestion:\n\nIn what film with character named Heavy Duty doe Leo Howard play in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05sqlp_ ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.02676f9 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "G.I. Joe: The Rise of Cobra"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Lantern: m.06b_06 | Jesse Owens: m.0cmr3 | common.topic : notable_types | people.person : profession, nationality, ethnicity, education, places_lived, height_meters, place_of_birth, gender | people.place_lived : location | education.educational_institution : school_type, colors, newspaper, sports_teams, students_graduates | education.education : institution, student | location.location : containedby | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | type.object : type | people.deceased_person : cause_of_death, place_of_death | kg.object_profile : prominent_type | organization.organization : headquarters, date_founded | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical\n\n\nquestion:\n\nWhere college did Jesse Owens attend that publishes newspaper The Lantern?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0cmr3 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.newspaper ns:m.06b_06 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ohio State University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHeard and McDonald Islands Time Zone: m.0y49btq | people.person : religion, profession, nationality, date_of_birth, gender | architecture.structure : opened, height_meters | base.culturalevent.event : entity_involved | location.country : calling_code, form_of_government | government.politician : government_positions_held | type.object : type | location.location : time_zones, containedby | government.government_office_or_title : office_holders | government.government_position_held : office_holder, from | common.topic : notable_types | film.actor : film | influence.influence_node : influenced | military.military_person : participated_in_conflicts | kg.object_profile : prominent_type | location.statistical_region : places_exported_to | location.imports_and_exports : exported_to\n\n\nquestion:\n\nWhat type of government system does Heard and McDonald currently have?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.time_zones ns:m.0y49btq .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Constitutional monarchy, Federal monarchy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBilly the Marlin: m.0952r6 | type.object : type | location.location : contains, people_born_here | time.event : start_date | travel.travel_destination : tourist_attractions | people.person : nationality | sports.sports_team : team_mascot, arena_stadium, championships | interests.hobby : people_with_this_hobby | sports.sports_team_owner : teams_owned | location.citytown : postal_codes | baseball.baseball_team : team_stats | sports.sports_championship_event : champion | sports.sports_team_location : teams | periodicals.newspaper_circulation_area : newspapers\n\n\nquestion:\n\nWhen did the team whose mascot is Billy the Marlin win the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.0952r6 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2003 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMexican peso: m.012ts8 | people.person : profession, nationality, parents, place_of_birth, gender | government.government_position_held : basic_title | type.object : type | kg.object_profile : prominent_type | location.location : time_zones, events, containedby | government.government_office_or_title : office_holders | common.topic : notable_types | architecture.structure : height_meters | film.film : country | location.country : currency_used | people.deceased_person : date_of_death, place_of_death | language.human_language : countries_spoken_in | government.politician : party | government.political_party_tenure : party | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nIn which continent would you find the ocuntry where the mexician peso is used as currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.012ts8 .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "North America"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMae Hong Son Province: m.01jb47 | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, contains, containedby | type.object : type | common.topic : notable_types | architecture.venue : capacity | location.country : official_language, administrative_divisions | architecture.structure : opened\n\n\nquestion:\n\nWhich language do they speak in the country, that includes the location of Mae Hong Son Province?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01jb47 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thai Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDarth Vader: m.0f2y0 | film.film_genre : films_in_this_genre | film.actor : film | film.performance : character, actor, film | film.music_contributor : film | location.location : contains, people_born_here | fictional_universe.fictional_character : occupation, gender | film.film_character : portrayed_in_films | people.deceased_person : date_of_death | tv.tv_actor : starring_roles | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | film.film : starring | media_common.netflix_genre : titles | media_common.media_genre : child_genres | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value | type.object : type | language.human_language : countries_spoken_in\n\n\nquestion:\n\nWho was the voice for Anakin in the movie with character named Rotta the Huttlet?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:g.1233lv8s .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0f2y0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Matt Lanter"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMyelodysplastic syndrome: m.019gky | award.award_nominee : award_nominations | award.award_nomination : nominated_for | influence.influence_node : influenced_by, influenced | type.object : type | people.deceased_person : cause_of_death, place_of_death | film.film_story_contributor : film_story_credits | people.person : profession, nationality, ethnicity, date_of_birth, languages, place_of_birth, gender | medicine.notable_person_with_medical_condition : condition | military.military_person : participated_in_conflicts | kg.object_profile : prominent_type | film.writer : film | book.author : book_editions_published, works_written\n\n\nquestion:\n\nWhat is another name for medical condition Myelodysplastic syndrome?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:medicine.notable_person_with_medical_condition.condition ns:m.019gky .\n?c ns:medicine.notable_person_with_medical_condition.condition ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Myelodysplastic syndrome, Breast cancer"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Oriole Bird: m.052tmns | sports.sports_team : team_mascot, championships, roster | location.location : contains, people_born_here | baseball.baseball_league : teams | film.film_location : featured_in_films | type.object : type | people.person : nationality | sports.sports_championship_event : championship, champion | travel.tourist_attraction : near_travel_destination | sports.sports_team_roster : position | time.event : end_date, start_date, locations | common.topic : notable_types | film.film_subject : films | sports.sports_facility : teams\n\n\nquestion:\n\nIn what years has the sports team whose team mascot is called The Oriole Bird gone to the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.052tmns .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1983 World Series, 1970 World Series, 1966 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1960 Summer Olympics: m.0lbd9 | Airport: m.01xpjyz | government.political_district : representatives | government.government_position_held : office_holder, from | location.location : events, time_zones, people_born_here, contains, partially_contains | government.governmental_jurisdiction : governing_officials | common.topic : notable_types | olympics.olympic_host_city : olympics_hosted | people.person : nationality | type.object : type | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | location.statistical_region : size_of_armed_forces | location.place_with_neighborhoods : neighborhoods | time.time_zone : locations_in_this_time_zone | location.administrative_division : country | government.political_appointer : appointees\n\n\nquestion:\n\nWhen I go visit the site of the 1960 Summer Olympics, which airport should I pick as my destination?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:olympics.olympic_host_city.olympics_hosted ns:m.0lbd9 .\n?c ns:travel.travel_destination.how_to_get_here ?y .\n?y ns:travel.transportation.transport_terminus ?x .\n?x ns:common.topic.notable_types ns:m.01xpjyz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leonardo da Vinci–Fiumicino Airport, Ciampino–G. B. Pastine International Airport"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Mexican peso: m.012ts8 | language.human_language : countries_spoken_in | people.person : religion, profession, nationality, ethnicity, place_of_birth, gender | geography.geographical_feature : category | people.deceased_person : cause_of_death | location.location : people_born_here, area, contains, containedby | common.topic : notable_types | kg.object_profile : prominent_type | government.politician : government_positions_held | type.object : type | meteorology.tropical_cyclone : affected_areas | film.film : language | people.marriage : location_of_ceremony | architecture.structure : height_meters | government.government_position_held : office_holder | government.governmental_body : members | location.country : currency_used\n\n\nquestion:\n\nWhich three countries, does the currency used in the country where the Mexican peso is utilized, border?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.012ts8 .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belize, Guatemala, United States of America"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSouth Asia: m.06nn1 | Country: m.01mp | Maldivian rufiyaa: m.02gsxf | type.object : name, type | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, appointed_by | location.country : currency_used, languages_spoken, form_of_government | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | kg.object_profile : prominent_type | common.topic : notable_types | measurement_unit.dated_integer : number | finance.currency : countries_used\n\n\nquestion:\n\nWhat country in South Asia uses the Maldivian rufiyaa as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06nn1 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.02gsxf .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Maldives"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRed Sea Governorate: m.02d5mf | location.location : time_zones, contains, containedby | architecture.structure : opened, height_meters | common.topic : notable_types | type.object : type | location.country : administrative_divisions, languages_spoken | architecture.building : floors | kg.object_profile : prominent_type\n\n\nquestion:\n\nPeople from the country where the Red Sea Governorate is located speak what languages?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02d5mf .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Siwi Language, Modern Standard Arabic, Egyptian Arabic, Sa'idi Arabic, Arabic, Sudanese Spoken Language, Bedawi Arabic, Nobiin Language, Domari Language, Arabic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nContinent: m.01mh | George Town, Cayman Islands: m.02h775 | type.object : type | location.location : partially_containedby, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | common.topic : notable_types | geography.river : mouth, basin_countries | kg.object_profile : prominent_type | geography.mountain : prominence | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | architecture.structure : height_meters\n\n\nquestion:\n\nWHat continent is the the country capital of Georgetown Cayman Islands located in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.administrative_division.capital ?k .\n?k ns:location.administrative_division_capital_relationship.capital ns:m.02h775 .\n?c ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "North America, Americas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nState Elementary School Menteng 01: m.0280qps | location.location : time_zones, events, containedby | type.object : type | kg.object_profile : prominent_type | government.government_position_held : office_holder, office_position_or_title, to | common.topic : notable_types | government.politician : government_positions_held | government.governmental_jurisdiction : governing_officials | architecture.building : floors\n\n\nquestion:\n\nWhat governmental positions were held by a notable personage who attended the educational institution State Elementary School Menteng 01?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0280qps .\n?c ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.office_position_or_title ?x ;\nns:government.government_position_held.to ?d .  # the position has ended; not the current position\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United States Senator, Illinois State Senator"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEastern Catholic Churches: m.01fgks | kg.object_profile : prominent_type | people.person : profession, nationality, date_of_birth, place_of_birth, gender | geography.river : discharge, basin_countries | finance.currency : countries_formerly_used | religion.religion : deities, founding_figures, is_part_of | government.politician : government_positions_held | government.government_position_held : office_position_or_title, jurisdiction_of_office | type.object : type | architecture.structure : opened, height_meters | location.location : containedby, people_born_here | people.deceased_person : cause_of_death, place_of_death | government.political_appointer : appointees | common.topic : notable_types | language.language_family : languages | sports.pro_athlete : teams | sports.sports_team_roster : team | tv.tv_series_episode : episode_number\n\n\nquestion:\n\nWhat type of religion does the Eastern Catholic Church have?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.01fgks .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism, Protestantism, Catholicism"
    }
]