[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArabic Language: m.0jzc | Central European Time Zone: m.02llzg | time.time_zone : locations_in_this_time_zone | type.object : type | location.country : official_language | location.location : time_zones, contains | language.human_language : countries_spoken_in\n\n\nquestion:\n\nWhat large city is in the Central European Time Zone and has Arabic as a primary language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jzc ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.official_language ns:m.0jzc .\n?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tunisia, Algeria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMessenia: m.01db23 | Knossos: m.0ksnn | location.location : area, events, adjoin_s, partially_contains, people_born_here, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : places_imported_from, size_of_armed_forces | measurement_unit.dated_integer : number | location.country : administrative_divisions, capital, languages_spoken | location.adjoining_relationship : adjoins | location.imports_and_exports : imported_from\n\n\nquestion:\n\nMessenia is a location in what country with the Palace of Knossos?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0ksnn ns:location.location.containedby ?x .\n?x ns:location.country.administrative_divisions ns:m.01db23 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Greece"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPanama Canal: m.066rl | UTC−05:00: m.02_37z | time.time_zone : locations_in_this_time_zone | location.location : time_zones, events, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | location.country : currency_used, form_of_government | location.statistical_region : co2_emissions_per_capita | type.object : type | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhere does the Panama Canal run through in the UTC-05:00 time zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.066rl ns:location.location.containedby ?x .\n?x ns:location.location.time_zones ns:m.02_37z .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Panama"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDwight Schar: m.0421j4g | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | sports.professional_sports_team : owner_s | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title | american_football.football_player : position_s | music.featured_artist : recordings | people.deceased_person : place_of_burial, date_of_death | sports.sports_team : previously_known_as | military.military_person : participated_in_conflicts\n\n\nquestion:\n\nWho was the first team that Dwight Schar owned?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.0421j4g .\n?c ns:sports.sports_team.previously_known_as ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston Redskins"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFrombork: m.0hvz8 | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, partially_containedby, contains, containedby | type.object : type | common.topic : notable_types | travel.tourist_attraction : near_travel_destination | architecture.structure : opened, height_meters | location.country : form_of_government | people.person : nationality\n\n\nquestion:\n\nWhat discoveries were made by the person who once lived in Frombork?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.0hvz8 .\n?c ns:base.argumentmaps.innovator.original_ideas ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Heliocentrism, Copernican heliocentrism, Copernican Revolution"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBlue Cliff Monastery: m.0472hkb | type.object : type | location.location : time_zones, containedby, people_born_here | common.topic : notable_types | kg.object_profile : prominent_type | religion.religion : organizations, texts | organization.organization : date_founded | architecture.structure : height_meters | people.person : profession | geography.river : mouth | location.mailing_address : citytown | location.statistical_region : co2_emissions_per_capita | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title\n\n\nquestion:\n\nWhat is the holy book of the Blue Cliff Monastery?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.organizations ns:m.0472hkb .\n?c ns:religion.religion.texts ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Pāli Canon, Dhammapada, Mahāyāna sūtras, Vimalakirti Sutra, Tibetan Buddhist canon, Chinese Buddhist canon, Śrīmālādevī Siṃhanāda Sūtra, Mahāvastu, Amitabha Sutra, Āgama, Gangōji Garan Engi, Uṣṇīṣa Vijaya Dhāraṇī Sūtra, Longchen Nyingthig, Nīlakaṇṭha Dhāraṇī"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nStarbucks Coffee Canada Inc: m.09n7z2j | type.object : type | education.educational_institution : students_graduates, colors | education.education : student | organization.organization : date_founded, founders, parent, place_founded, leadership | dining.restaurant : cuisine | organization.leadership : person | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | sports.sports_team : sport, founded, roster | sports.sports_team_roster : player, position | architecture.museum : established | location.location : time_zones, containedby | organization.organization_relationship : parent | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat is the market the organization Starbucks Coffee Canada Inc operates in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.09n7z2j .\n?c ns:dining.restaurant.cuisine ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Delicatessen, Bagel, Coffeehouse, American food, Bakery"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJamaica, Land We Love: m.01f58t | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | government.government_office_category : officeholders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office | location.location : contains | type.object : name, type | people.deceased_person : cause_of_death, date_of_death | time.time_zone : locations_in_this_time_zone | government.politician : government_positions_held | travel.tourist_attraction : near_travel_destination | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport | finance.currency : countries_used | location.country : official_language | time.event : start_date | sports.sports_team : founded | fictional_universe.fictional_character : gender | government.form_of_government : countries\n\n\nquestion:\n\nThe nation where the national anthem is Jamaica, Land We Love has what as its official language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01f58t .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jamaican English"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nvirgin birth: m.012lvl | Argentina: m.0jgd | religion.religion : deities, places_of_worship, types_of_places_of_worship, notable_figures, beliefs | biology.breed_origin : breeds_originating_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | location.country : official_language, currency_used, languages_spoken, form_of_government | location.location : people_born_here, contains, partially_contains | type.object : type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | measurement_unit.dated_percentage : rate | religion.religious_leadership_jurisdiction : leader | religion.religious_organization_leadership : start_date\n\n\nquestion:\n\nWhat is a religion practiced in Argentina that has as one of its beliefs the Virgin birth of Jesus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jgd ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.beliefs ns:m.012lvl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBill Neukom: m.03cyzbv | Deion Sanders: m.03n69x | Baseball: m.018jz | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | location.location : contains, people_born_here | sports.sports_team : location, team_mascot, sport, roster | people.person : profession | location.statistical_region : co2_emissions_per_capita, gdp_real | sports.professional_sports_team : owner_s | measurement_unit.adjusted_money_value : adjusted_value | sports.sports_team_roster : player | location.country : second_level_divisions, form_of_government | media_common.netflix_genre : titles\n\n\nquestion:\n\nBill Neukom is the team owner of which sports team Deion Sanders played for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03n69x ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.sport ns:m.018jz .\n?x ns:sports.professional_sports_team.owner_s ns:m.03cyzbv .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "San Francisco Giants"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSouthern Leyte: m.01kn62 | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type | sports.sports_team_location : teams | travel.tourist_attraction : near_travel_destination | location.country : administrative_divisions\n\n\nquestion:\n\nThe country that contains the Southern Leyte has what different sports?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01kn62 .\n?c ns:sports.sports_team_location.teams ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Philippines national football team, Philippines men's national volleyball team, Laos FC"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIsabelle Lightwood: m.0j1d0yb | Clary Fray: m.0h4qzxv | location.location : contains, people_born_here | media_common.netflix_genre : titles | film.film_character : portrayed_in_films | film.performance : character, actor, film | language.human_language : countries_spoken_in | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film_genre : films_in_this_genre | location.country : second_level_divisions, form_of_government | film.film : starring | location.statistical_region : population, consumer_price_index | measurement_unit.dated_integer : number | people.person : place_of_birth, gender | type.object : type | film.actor : film\n\n\nquestion:\n\nIn the film with the character Isabelle Lightwood, who will play Clary?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0j1d0yb .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0h4qzxv .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lily Collins"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Oriole Bird: m.052tmns | location.location : contains, people_born_here | baseball.baseball_league : teams | sports.sports_team : team_mascot, championships | fictional_universe.fictional_setting : characters_that_have_lived_here | type.object : type | time.event : start_date | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film_subject : films | location.hud_county_place : county | sports.sports_championship_event : championship, runner_up | people.person : nationality | sports.sports_team_location : teams\n\n\nquestion:\n\nWhen did the team with mascot The Oriole Bird win the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.052tmns .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1983 World Series, 1970 World Series, 1966 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJohn Lynch: m.041gm | US State: m.0kpys4 | Connecticut River: m.01ldvs | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : basic_title, office_holder, governmental_body | location.administrative_division : country | location.location : partially_containedby, contains, people_born_here | people.person : gender | government.political_district : representatives | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | common.topic : notable_types\n\n\nquestion:\n\nWhat State that appointed John Lynch to governmental position does the Connecticut River flow through?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01ldvs ns:location.location.partially_containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.041gm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Hampshire"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSalem: m.0d23k | Mount Jefferson: m.0238w8 | government.governmental_jurisdiction : governing_officials | location.location : events, adjoin_s, people_born_here, contains, containedby | government.government_position_held : office_holder | location.us_state : capital | location.adjoining_relationship : adjoins | location.country : second_level_divisions\n\n\nquestion:\n\nWith a capital named Salem, in which state is Mount Jefferson located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0238w8 ns:location.location.containedby ?x .\n?x ns:location.us_state.capital ns:m.0d23k .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Oregon"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBRG Steyr: m.01064jg9 | type.object : type | common.topic : notable_types | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | education.educational_institution : school_type, students_graduates | education.education : student | government.governmental_body : members | government.government_position_held : office_holder | organization.organization : date_founded | location.location : containedby | time.event : includes_event | sports.sports_team : arena_stadium, sport, founded, colors | kg.object_profile : prominent_type | government.political_party : politicians_in_this_party | government.political_party_tenure : politician\n\n\nquestion:\n\nWhat groups was person out of the education place BRG Steyr a part of?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.01064jg9 .\n?c ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nazi Party, German Workers' Party"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSelena Gomez: m.0gs6vr | film.actor : film | film.performance : character, actor, film | film.film_character : portrayed_in_films | film.film : language, release_date_s, written_by, country, genre, prequel, starring | people.person : profession, nationality, gender | kg.object_profile : prominent_type | type.object : type | music.artist : genre, label, origin | film.film_regional_release_date : film_release_distribution_medium, release_date | tv.tv_series_episode : episode_number | fictional_universe.fictional_character : gender | common.topic : image | award.award_nominee : award_nominations | award.award_nomination : nominated_for | tv.tv_actor : starring_roles | music.group_member : instruments_played | tv.regular_tv_appearance : series\n\n\nquestion:\n\nWhat film that includes the role of Theresa Russo is a flick in which Selena Gomez acted?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0gs6vr ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:g.121sxjvg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wizards of Waverly Place: The Movie, Wizards on Deck with Hannah Montana"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Noddfa, Treorchy: m.0_gw15p | location.location : containedby | common.topic : notable_types | kg.object_profile : prominent_type | type.object : type | people.deceased_person : place_of_death | education.educational_institution : school_type, sports_teams, colors | organization.organization : child, date_founded | people.person : nationality | organization.organization_relationship : child\n\n\nquestion:\n\nWhere is the city with the religious organization led by Noddfa, Treorchy?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.0_gw15p .\n?c ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United Kingdom, United Kingdom, with Dependencies and Territories"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Country: m.01mp | Euro: m.02l6h | location.location : containedby, events, adjoin_s, contains, partially_contains | location.country : capital, iso3166_1_alpha2, currency_used, form_of_government | kg.object_profile : prominent_type | film.film_subject : films | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | common.topic : notable_types | type.object : name, type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | finance.currency : countries_used | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhich Russian bordering countries use the Euro currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.02l6h .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Estonia, Finland, Latvia, Lithuania"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJerry Richardson: m.063kwx | type.object : type | people.person : religion, profession, nationality, date_of_birth, height_meters, gender | government.politician : government_positions_held, party | government.government_position_held : basic_title, office_position_or_title, from | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_end | people.deceased_person : place_of_death | government.political_party_tenure : party | american_football.football_team : current_head_coach | sports.professional_sports_team : owner_s | common.topic : notable_types | location.location : time_zones, containedby | fictional_universe.fictional_character : appears_in_these_fictional_universes | sports.sports_team_owner : teams_owned\n\n\nquestion:\n\nIn 2013, who was the coach of the sports team whose owner is Jerry Richardson?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.063kwx .\n?c ns:american_football.football_team.current_head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ron Rivera"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUTC±00:00: m.0frmgl | Niger River: m.05csx | Country: m.01mp | Sahel: m.0l5_l | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, partially_containedby, contains, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, appointed_by | common.topic : notable_types | location.country : administrative_divisions | type.object : name, type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | geography.river : cities | time.time_zone : locations_in_this_time_zone | film.film_location : featured_in_films\n\n\nquestion:\n\nWhich location which time zone is UTCÂ±00:00 is also a country wher the Niger River flows?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05csx ns:location.location.partially_containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.partially_contains ns:m.0l5_l .\n?x ns:location.location.time_zones ns:m.0frmgl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mali"
    }
]