[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of the Islamic Republic of Iran: m.02lwm6 | government.government_office_category : officeholders | government.government_position_held : office_holder, from | location.country : languages_spoken | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | biology.animal_breed : place_of_origin | government.politician : government_positions_held | language.human_language : iso_639_1_code, main_country, countries_spoken_in | people.deceased_person : cause_of_death, place_of_death, place_of_burial | type.object : name, type | kg.object_profile : prominent_type | common.topic : notable_types | location.location : contains, containedby | architecture.building : floors | finance.currency : countries_used\n\n\nquestion:\n\nWhich languages are used for communication the nation whose national anthem is National Anthem of the Islamic Republic of Iran?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.02lwm6 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Azerbaijani language, Turkmen Language, Persian Language, Qashqa'i Language, Luri language, Kumzari Language, Assyrian Neo-Aramaic Language, Khalaj, Turkic Language, Mazanderani Language, Gilaki Language, Kurdish languages, Talysh language, Afshar language, Khorasani Turkish Language, Balochi language, Arabic Language, Pashto language, Armenian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nColumbia Lions Softball: m.0vx41sj | Barack Obama: m.02mjmr | College/University: m.01y2hnl | people.person : education, places_lived | education.education : student, major_field_of_study | government.political_appointer : appointees | government.government_position_held : basic_title, office_position_or_title, from, to, governmental_body | education.educational_institution : students_graduates, sports_teams | location.location : containedby | sports.school_sports_team : school | government.politician : government_positions_held | people.place_lived : location | book.author : book_editions_published | common.topic : notable_types | influence.influence_node : influenced_by, influenced | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : event | type.object : type | kg.object_profile : prominent_type | education.university : number_of_postgraduates | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich university has the Columbia Lions Softball team representing them in sports and includes Barack Obama, as an alumni>?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.sports_teams ns:m.0vx41sj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Columbia University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nOlden C Lee: m.09tfms0 | people.person : religion, profession, nationality, parents, ethnicity, date_of_birth, place_of_birth, gender | type.object : type | government.politician : government_positions_held | government.government_position_held : district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, appointed_by, to, governmental_body | kg.object_profile : prominent_type | government.political_appointer : appointees | dining.restaurant : cuisine | people.deceased_person : cause_of_death | influence.influence_node : influenced_by\n\n\nquestion:\n\nIn which markets does an organization led by someone known as Olden C Lee work in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.09tfms0 .\n?c ns:dining.restaurant.cuisine ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Delicatessen, Bagel, Coffeehouse, American food, Bakery"
    },
    {
        "instruction": "Given a list of knowledge graph schema items, write the question as an s-expression that can be used to find the answer. schema:\n\nautomotive.engine : engine_type | computer.programming_language_developer | itsbyu: m.0102rjdr | olympics.olympic_event : sport\n\n\nquestion:\n\nwhat is the type of engine used by the automobile manufacturer that developed the programming language of itsbyu and what olympic event is it associated with?",
        "input": "",
        "output": "(AND computer.programming_language_developer (JOIN automotive.engine.engine_type (JOIN (R olympics.olympic_event.sport) (JOIN olympics.olympic_event.sport ns:m.0102rjdr))))",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "grailqa"
    },
    {
        "instruction": "Given a list of knowledge graph schema items, write the question as an s-expression that can be used to find the answer. schema:\n\nbajaritos | biology.genome : chromosome | interests.collection_category : name_of_collection_activity | nikita wu: m.05yqr_5\n\n\nquestion:\n\nwhat is the fewest number of collection categories that involve nikita wu?",
        "input": "",
        "output": "(COUNT (ARGMIN (AND bajaritos (JOIN interests.collection_category.name_of_collection_activity ns:m.05yqr_5)) biology.genome.chromosome))",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "grailqa"
    },
    {
        "instruction": "Given a list of knowledge graph schema items, write the question as an s-expression that can be used to find the answer. schema:\n\nancient temple: m.0cx45 | fictional_universe.character_species : found_in_fictional_universe | sports.multi_event_tournament : participating_countries | visual_art.artwork\n\n\nquestion:\n\nwhat artworks are in the same fictional universe as ancient temple?",
        "input": "",
        "output": "(AND visual_art.artwork (JOIN sports.multi_event_tournament.participating_countries (JOIN (R fictional_universe.character_species.found_in_fictional_universe) (JOIN fictional_universe.character_species.found_in_fictional_universe ns:m.0cx45))))",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "grailqa"
    },
    {
        "instruction": "Given a list of knowledge graph schema items, write the question as an s-expression that can be used to find the answer. schema:\n\nbasketball.basketball_division | digicams.camera_iso : cameras | freebase.user_profile : favorite_topics | sudan premier league: m.0263t4l\n\n\nquestion:\n\nwhen it comes to sudan premier league, which basketball division has the fewest cameras?",
        "input": "",
        "output": "(COUNT (ARGMIN (AND basketball.basketball_division (JOIN digicams.camera_iso.cameras ns:m.0263t4l)) freebase.user_profile.favorite_topics))",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "grailqa"
    },
    {
        "instruction": "Given a list of knowledge graph schema items, write the question as an s-expression that can be used to find the answer. schema:\n\nbook.book_edition : book | fictional_universe.fictional_organization : fictional_organization_founder | sandals emerald bay: m.0pw2xrd | sports.tournament_event_competition\n\n\nquestion:\n\nwhat tournament event competition is founded by the founder of a fictional organization?",
        "input": "",
        "output": "(AND sports.tournament_event_competition (JOIN book.book_edition.book (JOIN (R fictional_universe.fictional_organization.fictional_organization_founder) (JOIN fictional_universe.fictional_organization.fictional_organization_founder ns:m.0pw2xrd))))",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "grailqa"
    },
    {
        "instruction": "Your task is to convert the following question to an SQL query using the following database schema. schema:\n\nactor : musical_id | customers_cards | tracks : name, genre_id, media_type_id, Rock\n\n\nquestion:\n\nWhat are the different musical ids ordered by track name, genre id, media type id, and rock?",
        "input": "",
        "output": "select distinct actor.musical_id from customers_cards order by tracks.name, genre_id, media_type_id, Rock",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "spider_with_cell"
    },
    {
        "instruction": "Your task is to convert the following question to an SQL query using the following database schema. schema:\n\ncandidates | department : budget_in_billions | track : milliseconds, genreid, Pop\n\n\nquestion:\n\nWhat are the distinct budget sizes of departments, ordered by track length, genre ID, and Pop score?",
        "input": "",
        "output": "select distinct department.budget_in_billions from candidates order by track.milliseconds, genreid, Pop",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "spider_with_cell"
    },
    {
        "instruction": "Your task is to convert the following question to an SQL query using the following database schema. schema:\n\nfarm_competition : official_name, city_id, host_city_id | shop\n\n\nquestion:\n\nWhat is the average competition size, the size of the smallest competition, and the number of shops?",
        "input": "",
        "output": "select avg(farm_competition.official_name, city_id, host_city_id), min(farm_competition.official_name, city_id, host_city_id), count(*) from shop",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "spider_with_cell"
    },
    {
        "instruction": "Your task is to convert the following question to an SQL query using the following database schema. schema:\n\ncustomers_cards | status : id, lat, station_id, bikes_available\n\n\nquestion:\n\nWhat is the sum, average, and max of the bike availability from all the stations?",
        "input": "",
        "output": "select sum(status.id, lat, station_id, bikes_available), avg(status.id, lat, station_id, bikes_available), max(status.id, lat, station_id, bikes_available) from customers_cards",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "spider_with_cell"
    },
    {
        "instruction": "Your task is to convert the following question to an SQL query using the following database schema. schema:\n\ntrip : id, end_station_id | weather | weather : date, zip_code, max_temperature_f\n\n\nquestion:\n\nWhat are the different trip id and ending station ids for each day and zip code that had the highest max temperature?",
        "input": "",
        "output": "select distinct trip.id, end_station_id from weather order by weather.date, zip_code, max_temperature_f",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "spider_with_cell"
    }
]