[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Russia: m.01ptxd | Country: m.01mp | type.object : type | common.topic : notable_types | geography.river : basin_countries | location.administrative_division : country | location.location : people_born_here, containedby | people.person : profession | kg.object_profile : prominent_type\n\n\nquestion:\n\nThe location with the country that has National Anthem of Russia is next to which countries?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01ptxd .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belarus, Estonia, Finland, Kazakhstan, Latvia, Lithuania, Mongolia, Norway, North Korea, Poland, Ukraine, China, Georgia, Azerbaijan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaylor Lautner: m.07ldhs | film.film : produced_by, language, film_art_direction_by, release_date_s, runtime, film_set_decoration_by, written_by, music, featured_film_locations, sequel, film_series, initial_release_date, starring, prequel, genre | film.film_regional_release_date : film_release_distribution_medium, release_date | film.actor : film | film.performance : character, actor, film | award.award_nominee : award_nominations | award.award_nomination : nominated_for | type.object : type | film.film_character : portrayed_in_films | fictional_universe.fictional_character : place_of_birth | people.person : religion | media_common.netflix_title : netflix_genres | film.film_cut : film_release_region\n\n\nquestion:\n\nWhat movies with a film character named Jane have Taylor Lautner starred in ?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:g.120n34qq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "The Twilight Saga: New Moon, Eclipse, The Twilight Saga: Breaking Dawn - Part 1, The Twilight Saga: Breaking Dawn - Part 2"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrasília: m.01hy_ | type.object : type | common.topic : image, notable_types | location.country : capital, languages_spoken | kg.object_profile : prominent_type | government.politician : government_positions_held | government.government_position_held : to | location.location : time_zones, contains, containedby | geography.river : discharge, basin_countries | architecture.structure : opened\n\n\nquestion:\n\nWhat is the language where Brasilia is the capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.01hy_ .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Brazilian Portuguese, Portuguese Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Mosque: m.04_xn | location.location : adjoin_s, contains, partially_contains | religion.religion : types_of_places_of_worship, holidays | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | architecture.building_function : buildings | location.country : administrative_divisions | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat predominant religion in Russia that worships at mosque?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.types_of_places_of_worship ns:m.04_xn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Islam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1970 World Series: m.04jg7y | sports.sports_championship : events | time.recurring_event : instances | sports.sports_team : colors, championships, roster | sports.sports_team_roster : position | type.object : type | time.event : end_date, start_date | common.topic : notable_types\n\n\nquestion:\n\nWhat years did the champion of the 1970 World Series play in the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04jg7y .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1983 World Series, 1970 World Series, 1966 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral European Time Zone: m.02llzg | Germany: m.0345h | location.location : adjoin_s, time_zones, people_born_here, contains, containedby | type.object : type | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | common.topic : notable_types | location.adjoining_relationship : adjoins | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhich are the best places to go in Germany, where the location is in the Central European Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0345h ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tropical Islands Resort"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2014 Eurocup Finals: m.010wxwln | Spain: m.06mkj | location.location : contains | sports.sports_team : championships, roster | sports.sports_team_roster : position | sports.sports_team_location : teams | time.event : start_date\n\n\nquestion:\n\nWhat Spanish sporting team won the 2014 Eurocup Finals championship game?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mkj ns:sports.sports_team_location.teams ?x .\n?x ns:sports.sports_team.championships ns:m.010wxwln .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Valencia BC"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKick the Dust Up Tour: m.012ny397 | media_common.netflix_genre : titles | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.person : place_of_birth | music.artist : concert_tours | type.object : type | travel.travel_destination : tourist_attractions | music.composition : composer | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.country : second_level_divisions\n\n\nquestion:\n\nWhere did the artist that went on Kick the Dust Up Tour come from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.012ny397 .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leesburg"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGovernor: m.0fkvn | La Borinqueña: m.014mqd | type.object : name, type | time.event : start_date, locations | people.person : religion, profession, nationality, date_of_birth, height_meters, gender | finance.currency : countries_used | government.politician : government_positions_held, party | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, to | location.location : contains, people_born_here | language.human_language : main_country, countries_spoken_in | government.government_office_category : officeholders | biology.animal_breed : place_of_origin | government.governmental_jurisdiction : governing_officials | kg.object_profile : prominent_type | government.political_party_tenure : party | government.government_office_or_title : office_holders | music.artist : genre | meteorology.tropical_cyclone : affected_areas | location.country : national_anthem | government.national_anthem_of_a_country : anthem | people.deceased_person : cause_of_death, date_of_death\n\n\nquestion:\n\nIn the country with the national anthem La Borinquena, who was the winner of the election for governor?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.014mqd .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.0fkvn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Luis Fortuño, Alejandro García Padilla"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNBA Rookie of the Year Award: m.02yqnh | St. Dunstan's Episcopal High School: m.02x1ptp | government.governmental_jurisdiction : official_symbols, governing_officials | location.location_symbol_relationship : Kind_of_symbol | location.location : people_born_here, adjoin_s, contains, containedby | government.government_position_held : office_holder | sports.sports_award : award | common.topic : notable_types | type.object : type | organization.organization : date_founded | education.educational_institution : school_type | government.political_district : representatives | award.award_category : date_established | kg.object_profile : prominent_type | sports.sports_award_winner : awards | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat year did the person who went to St. Dunstan's Episcopal High School start in the NBA?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.02x1ptp .\n?c ns:sports.sports_award_winner.awards ?y .\n?y ns:sports.sports_award.season ?x .\n?y ns:sports.sports_award.award ns:m.02yqnh .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1997–98 NBA season"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrazilian real: m.03385m | location.location : people_born_here, contains, containedby | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, to, from | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.government_office_category : officeholders | common.topic : notable_types | type.object : type | government.form_of_government : countries | architecture.structure : opened, height_meters | business.consumer_company : products | business.company_product_relationship : consumer_product | finance.currency : countries_formerly_used | location.country : currency_used, administrative_divisions, languages_spoken | symbols.namesake : named_after | people.deceased_person : date_of_death | geography.river : mouth\n\n\nquestion:\n\nWhat are the languages used for communication in the nation where the Brazilian real is the unit of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.03385m .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Brazilian Portuguese, Portuguese Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNigerian naira: m.018cg3 | media_common.netflix_title : netflix_genres | type.object : type | location.location : area, time_zones, people_born_here, contains, containedby | common.topic : notable_types | government.politician : government_positions_held | government.government_position_held : governmental_body | location.country : currency_used, form_of_government | people.person : religion, nationality, gender | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | language.human_language : countries_spoken_in | location.administrative_division : country\n\n\nquestion:\n\nWHat form of government is used in the ciuntry that utilizes the Nigerian Naira as their currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.018cg3 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Federal republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLe Cateau-Cambrésis: m.03x_1j | type.object : type | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | travel.tourist_attraction : near_travel_destination | visual_art.visual_artist : associated_periods_or_movements | geography.river : basin_countries | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | education.educational_institution : colors\n\n\nquestion:\n\nThe person who once lived in Le Cateau-Cambresis belongs to what artistic movement?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.03x_1j .\n?c ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Modern art, Impressionism, Neo-impressionism, Fauvism, Modernism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIsla de la Juventud: m.01rj40 | President: m.060c4 | government.governmental_jurisdiction : governing_officials | type.object : type | location.country : administrative_divisions | location.location : time_zones, area, containedby | common.topic : notable_types | government.government_position_held : basic_title, office_holder | location.administrative_division : country | kg.object_profile : prominent_type\n\n\nquestion:\n\nWho was the president in year 2009 of the country that has Isla de la Juventud?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01rj40 .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Raúl Castro"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | State Elementary School Menteng 01: m.0280qps | organization.organization : date_founded | education.educational_institution : school_type, students_graduates | education.education : institution, student | location.location : people_born_here, partially_contains, contains, containedby | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | location.administrative_division : country | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : languages_spoken | people.person : education\n\n\nquestion:\n\nWhat institutions of higher learning were attended by a person who also attended State Elementary School Menteng 01?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0280qps .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Harvard Law School, Columbia University, Occidental College"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nnfl super bowl: m.06x5s | Seven Nation Army: m.07fpnw | type.object : type | kg.object_profile : prominent_type | sports.sports_championship_event : championship | location.location : contains, people_born_here | sports.sports_team : fight_song, championships | religion.religion : founding_figures | film.film_subject : films | film.film : costume_design_by, genre, production_companies, country | law.invention : inventor | time.event : start_date, locations, instance_of_recurring_event | location.statistical_region : consumer_price_index | people.person : place_of_birth | location.country : second_level_divisions | tv.tv_program : episode_running_time | music.genre : albums | interests.hobby : people_with_this_hobby | government.governmental_jurisdiction : governing_officials | time.recurring_event : instances | government.election : campaigns\n\n\nquestion:\n\nWhen was the last time did the team with the fight song Seven Nation Army won the Superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.07fpnw .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.championship ns:m.06x5s .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XLVII"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTamil Nadu Thowheed Jamath: m.010ffmhn | kg.object_profile : prominent_type | type.object : type | people.person : religion, profession, nationality | common.topic : notable_types | exhibitions.exhibition_venue : exhibitions_at_this_venue | exhibitions.exhibition_run : opened_on | organization.organization : date_founded, parent, founders | religion.religion : deities, organizations | business.business_operation : industry | organization.organization_relationship : parent | location.location : street_address, containedby | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder | education.educational_institution : school_type, colors | sports.sports_team : sport, founded, championships | government.political_party : ideology | government.governmental_body : members\n\n\nquestion:\n\nWhat are the gods of Tamil Nadu Thowheed Jamath?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.organizations ns:m.010ffmhn .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ramdev Pir, God, Allah"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral European Summer Time: m.03q7hb | Johann Sebastian Bach: m.03_f0 | location.location : time_zones, containedby, contains, people_born_here | influence.influence_node : influenced | people.person : children, profession, nationality, ethnicity, places_lived, height_meters, place_of_birth, gender | people.place_lived : location | time.time_zone : locations_in_this_time_zone | type.object : type | music.composer : compositions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.deceased_person : place_of_death\n\n\nquestion:\n\nWhere in Central European Time Zone did Johann Sabastian Bach live?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03_f0 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:location.location.time_zones ns:m.03q7hb .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leipzig"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUtah Attorney General: m.0hzbyr1 | Utah: m.07srw | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, legislative_sessions, appointed_by | government.governmental_jurisdiction : government_bodies, governing_officials, official_symbols | government.politician : government_positions_held | location.location : containedby, contains, people_born_here | people.person : nationality | location.location_symbol_relationship : Kind_of_symbol | type.object : type | tv.tv_location : tv_shows_filmed_here\n\n\nquestion:\n\nWho held his governmental position form January 2001 and won Utah Attorney General?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07srw ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.0hzbyr1 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"2001-01\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mark Shurtleff"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral European Time Zone: m.02llzg | Baltic Sea: m.01522 | Country: m.01mp | location.location : events, adjoin_s, time_zones, people_born_here, contains, partially_contains | time.time_zone : locations_in_this_time_zone | common.topic : notable_types | location.country : currency_used, administrative_divisions, iso3166_1_alpha2, second_level_divisions, languages_spoken, form_of_government | type.object : name, type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat European Union country within the Central European Time Zone borders the Baltic Sea?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01522 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sweden"
    }
]