[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Brussels: m.0177z | Germany: m.0345h | location.country : calling_code, capital, second_level_divisions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | time.time_zone : locations_in_this_time_zone | location.location : containedby, events, people_born_here, contains, partially_contains | type.object : name | people.person : parents, nationality, place_of_birth | kg.object_profile : prominent_type | common.topic : notable_types | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat country that borders Germany has Brussels as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0345h ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.0177z .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belgium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaylor Lautner: m.07ldhs | people.person : religion, profession, nationality, place_of_birth, gender | film.actor : film | film.performance : character, actor, film | type.object : type | award.award_nominee : award_nominations | award.award_nomination : nominated_for | kg.object_profile : prominent_type | common.topic : image, notable_types | film.film : prequel, starring, sequel | tv.tv_series_episode : episode_number, season_number | tv.tv_program : episode_running_time\n\n\nquestion:\n\nWhat movie series has 0 seasons and featued taylor lautner as an actor?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:tv.tv_series_episode.season_number \"0\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "He's a Bully, Charlie Brown"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRick Scott: m.0btx2g | government.politician : government_positions_held, party | government.government_position_held : basic_title, office_position_or_title, from, legislative_sessions, governmental_body | kg.object_profile : prominent_type | people.person : profession, nationality, ethnicity, height_meters, place_of_birth, gender | type.object : type | location.location : time_zones, containedby | government.political_party_tenure : party | people.deceased_person : place_of_death | baseball.baseball_player : position_s | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport | influence.influence_node : influenced_by | film.film : genre\n\n\nquestion:\n\nWhat time zone is the country with Rick Scott in a government position in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0btx2g .\n?c ns:location.location.time_zones ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "UTC−05:00, Central Time Zone, Eastern Time Zone"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHIStory World Tour: m.09x1nf | type.object : type | music.genre : albums | people.person : sibling_s, children, profession, languages | film.film : subjects, release_date_s, executive_produced_by, country, genre, starring | kg.object_profile : prominent_type | people.sibling_relationship : sibling | medicine.notable_person_with_medical_condition : condition | media_common.netflix_genre : titles | music.artist : genre, concert_tours | award.award_category : date_established | film.performance : actor, film | influence.influence_node : influenced_by | music.composition : composer | music.composer : compositions | location.location : people_born_here | film.film_job : films_with_this_crew_job | film.film_crew_gig : crewmember | music.album : release_date | film.film_regional_release_date : release_date | film.film_character : portrayed_in_films | book.written_work : subjects\n\n\nquestion:\n\nWhat disease does the artist who went on the HIStory World Tour suffer from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.09x1nf .\n?c ns:medicine.notable_person_with_medical_condition.condition ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mysophobia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCanada: m.0d060g | St. Mary's Cathedral, Batticaloa: m.0100k8_q | religion.religion : beliefs, places_of_worship, organizations | location.location : contains, people_born_here | location.statistical_region : consumer_price_index, population, cpi_inflation_rate, gdp_real, long_term_unemployment_rate, size_of_armed_forces, co2_emissions_per_capita, net_migration | measurement_unit.dated_integer : number | measurement_unit.adjusted_money_value : adjusted_value | measurement_unit.dated_percentage : rate | common.topic : notable_types | location.country : languages_spoken, administrative_divisions | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | military.military_combatant : casualties | military.casualties : military_conflict | sports.sports_team_location : teams | book.book_subject : works | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhat major Canadian religion has a place of worship named St. Mary's Cathedral, Batticaloa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d060g ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.places_of_worship ns:m.0100k8_q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPrime minister: m.060bp | Wellington Region: m.015q4y | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, from | location.location : area, time_zones, people_born_here, partially_containedby, containedby | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | government.politician : government_positions_held | location.country : administrative_divisions | geography.river : basin_countries\n\n\nquestion:\n\nThe country that contains Wellington Region has what prime minister now?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.015q4y .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060bp .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "John Key"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | her majesty the queen: m.0d1_f | South America: m.06n3y | location.location : containedby, time_zones, people_born_here, contains, partially_contains | type.object : name, type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : second_level_divisions, form_of_government | kg.object_profile : prominent_type | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | common.topic : notable_types\n\n\nquestion:\n\nWhat country in South America is a aprt of the nation that appointed Elizabeth II as a member of their government?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06n3y ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.0d1_f .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Falkland Islands"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTabasco: m.01bkt4 | kg.object_profile : prominent_type | location.location : area, time_zones, people_born_here, contains, containedby | type.object : type | location.country : administrative_divisions | common.topic : notable_types | architecture.structure : height_meters\n\n\nquestion:\n\nThe country that contains Tabasco is located in what continent?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01bkt4 .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "North America"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCanton of Jura: m.01l8hj | type.object : type | location.location : time_zones, people_born_here, area, containedby | kg.object_profile : prominent_type | location.country : administrative_divisions, languages_spoken | architecture.structure : opened | common.topic : notable_types\n\n\nquestion:\n\nPeople from the country that contains Canton of Jura speak what languages?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01l8hj .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, German Language, French, Romansh language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMadrid: m.056_y | location.location : containedby, contains, people_born_here | exhibitions.exhibition_venue : exhibitions_at_this_venue | exhibitions.exhibition_run : opened_on | travel.travel_destination : tourist_attractions | periodicals.newspaper_circulation_area : newspapers | travel.tourist_attraction : near_travel_destination | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | architecture.museum : established | kg.object_profile : prominent_type | sports.sports_team_location : teams\n\n\nquestion:\n\nWhat museum in Madrid that was established in 1819?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.056_y ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:architecture.museum.established \"1819\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Museo Nacional Del Prado"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJim Irsay: m.0ff334 | people.person : religion, profession, nationality, parents, ethnicity, date_of_birth, place_of_birth, gender | type.object : type | government.politician : government_positions_held | people.deceased_person : cause_of_death | location.location : containedby, people_born_here | government.government_position_held : basic_title, governmental_body | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | sports.professional_sports_team : owner_s | kg.object_profile : prominent_type | architecture.structure : construction_started | time.event : end_date\n\n\nquestion:\n\nWho was the 2011 coach of the team owned by Jim Irsay?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.0ff334 .\n?c ns:american_football.football_team.historical_coaching_staff ?y .\n?y ns:american_football.football_historical_coach_position.coach ?x .\nEXISTS {?y ns:american_football.football_historical_coach_position.from ?sk1 .\nEXISTS {?y ns:american_football.football_historical_coach_position.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jim Caldwell"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nA Different Me Tour: m.05zw52r | Marriage: m.04ztj | people.person : religion, profession, nationality, parents, spouse_s, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | music.artist : label, concert_tours | type.object : type | location.location : events, contains, containedby | people.marriage : type_of_union, spouse | film.actor : film | film.performance : character | government.politician : government_positions_held | government.government_position_held : from, jurisdiction_of_office | people.deceased_person : cause_of_death | time.event : start_date, included_in_event | film.film_subject : films | education.educational_institution : sports_teams | law.judge : courts | law.judicial_tenure : court, title | symbols.name_source : namesakes | common.topic : image | base.culturalevent.event : entity_involved | influence.influence_node : influenced | organization.organization : founders\n\n\nquestion:\n\nWho is the husband of the artist who had a tour named A Different Me?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.05zw52r .\n?c ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\nEXISTS {?y ns:people.marriage.from ?sk1 .\nEXISTS {?y ns:people.marriage.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Daniel Gibson"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMexican peso: m.012ts8 | italian: m.02bjrlw | location.location : adjoin_s, contains, people_born_here | language.human_language : countries_spoken_in | location.statistical_region : population, energy_use_per_capita, cpi_inflation_rate, gdp_real, co2_emissions_per_capita, part_time_employment_percent | measurement_unit.dated_percentage : rate | measurement_unit.adjusted_money_value : adjusted_value | measurement_unit.dated_kgoe : number | government.governmental_jurisdiction : governing_officials | location.country : currency_used, administrative_divisions, form_of_government | measurement_unit.dated_integer : number | location.adjoining_relationship : adjoins | finance.currency : countries_used | meteorology.cyclone_affected_area : cyclones | government.government_position_held : office_holder\n\n\nquestion:\n\nWhich country uses the Mexican peso and Italian is spoken there?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02bjrlw ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.currency_used ns:m.012ts8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBuenos Aires: m.01ly5m | italian: m.02bjrlw | location.location : partially_contains, contains, people_born_here | language.human_language : main_country, countries_spoken_in | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | location.country : official_language, capital | type.object : type | film.film_location : featured_in_films | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat south American country speaking Italian is home to the capital City of Buenos Aires?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02bjrlw ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.capital ns:m.01ly5m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Argentina"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDu gamla, Du fria: m.0m6w8 | type.object : type | people.person : religion, profession, nationality, parents, place_of_birth, gender | location.location : time_zones, contains, containedby | people.deceased_person : cause_of_death, date_of_death | kg.object_profile : prominent_type | sports.pro_athlete : career_start | geography.river : discharge | government.politician : government_positions_held | government.government_position_held : jurisdiction_of_office | location.country : languages_spoken | common.topic : notable_types\n\n\nquestion:\n\nWhat languages are spoken in the country that has the national anthem \"Du gamla, Du fria\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.0m6w8 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Romani language, Finnish Language, Meänkieli, Swedish Sign Language, Turoyo Language, Swedish Language, Yiddish Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl I: m.076lp | type.object : type | film.film : genre | government.political_appointer : appointees | government.government_position_held : office_holder, to, appointed_by | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | kg.object_profile : prominent_type | location.country : capital, languages_spoken | law.court : judges | law.judicial_tenure : judge | people.person : religion, profession, nationality, ethnicity, gender | sports.professional_sports_team : owner_s | common.topic : notable_types | government.politician : government_positions_held | time.event : start_date, included_in_event | influence.influence_node : influenced_by, influenced | film.film_subject : films | sports.sports_team : championships | event.speech_topic : speeches_or_presentations_on_this_topic | event.speech_or_presentation : speaker_s | military.military_person : participated_in_conflicts | religion.religion : founding_figures | time.recurring_event : instances | people.deceased_person : place_of_death | language.human_language : countries_spoken_in\n\n\nquestion:\n\nThe Super Bowl I championship team was owned by whom?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.076lp .\n?c ns:sports.professional_sports_team.owner_s ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Green Bay Packers Board of Directors"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAdly Mansour: m.0w5nf92 | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | language.human_language : main_country | government.government_position_held : basic_title, to, office_position_or_title, from | location.country : languages_spoken | government.politician : government_positions_held, party | type.object : type | people.deceased_person : cause_of_death, date_of_death, place_of_death | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | military.military_person : participated_in_conflicts | influence.influence_node : influenced_by | government.political_party_tenure : party\n\n\nquestion:\n\nPeople from the location that appointed Adly Mansour to govermental position speak what languages?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0w5nf92 .\n?c ns:location.country.languages_spoken ?x .\n?x ns:language.human_language.main_country ?c .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Siwi Language, Egyptian Arabic, Sa'idi Arabic, Bedawi Arabic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBell Atlantic Network Integration, Inc.: m.02_8366 | education.educational_institution : school_type, students_graduates, colors | type.object : type | location.location : containedby | kg.object_profile : prominent_type | common.topic : notable_types | organization.organization : headquarters, date_founded, parent, founders | symbols.namesake : named_after | education.education : student | organization.organization_relationship : parent | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | sports.sports_team : founded\n\n\nquestion:\n\nBell Atlantic Network is the child organization with headquarters where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.02_8366 .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPortugal: m.05r4w | Emirate of Ajman: m.01430j | location.location : contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | location.country : official_language, calling_code, administrative_divisions | people.person : nationality, gender | kg.object_profile : prominent_type | type.object : type | government.politician : government_positions_held\n\n\nquestion:\n\nWho trades with Portugal that contains the Emirate of Ajman?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.05r4w ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.05r4w ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.country.administrative_divisions ns:m.01430j .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United Arab Emirates"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMy December Tour: m.02q_l60 | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | media_common.netflix_genre : titles | education.educational_institution : students_graduates | education.education : student | location.location : contains, people_born_here | common.topic : notable_types | music.composition : composer | type.object : type | film.film : genre, initial_release_date | music.artist : label, concert_tours | music.genre : albums | organization.organization : companies_acquired | business.acquisition : company_acquired | time.event : end_date | people.person : profession\n\n\nquestion:\n\nWith which record label did the artist of My December Tour sign with?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.02q_l60 .\n?c ns:music.artist.label ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "RCA Records, Sony BMG, Sony Music Entertainment, 19 Recordings"
    }
]