[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | Mitt Romney: m.0271_s | stanford daily: m.046b7w | people.person : education, children, religion | education.education : institution, student, degree | location.location : containedby | education.educational_institution : school_type, colors, newspaper, sports_teams, students_graduates | fictional_universe.school_in_fiction : students_graduates | type.object : type | government.politician : government_positions_held | government.government_position_held : office_position_or_title | organization.organization : headquarters, date_founded, child, founders, place_founded | organization.organization_relationship : child | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | book.author : works_written | common.topic : notable_types | organization.organization_founder : organizations_founded | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat educational institution with The Stanford Daily newspaper did Mitt Romney attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0271_s ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.newspaper ns:m.046b7w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Stanford University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIn his own write: m.06td1h2 | common.topic : notable_types | book.written_work : subjects, date_of_first_publication, author, copyright_date | book.illustrator : books_illustrated | people.person : date_of_birth, profession, nationality, gender | music.genre : albums | book.book : genre | people.deceased_person : place_of_burial, place_of_death | sports.pro_athlete : career_end | government.politician : government_positions_held, party | government.government_position_held : basic_title | government.political_party_tenure : party | type.object : type\n\n\nquestion:\n\nWhen the illustrator of the book \"In His Own Write\" was shot, where was he standing?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:book.illustrator.books_illustrated ns:m.06td1h2 .\n?c ns:people.deceased_person.place_of_death ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPanama Canal: m.066rl | location.location : time_zones, events, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.country : calling_code, currency_used, administrative_divisions, second_level_divisions | location.statistical_region : co2_emissions_per_capita | kg.object_profile : prominent_type | type.object : type | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nWhat country with CO2 emissions per capita was once of 2009 metric ton, does the Panama Canal run through?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.066rl ns:location.location.containedby ?x .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2009\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Panama"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaylor Lautner: m.07ldhs | type.object : type | people.person : religion, profession, nationality, place_of_birth, gender | common.topic : image, notable_types | film.actor : film | film.performance : character, actor, film | tv.tv_series_episode : episode_number, season_number | tv.tv_program : episode_running_time | award.award_nominee : award_nominations | award.award_nomination : nominated_for | film.film : prequel, starring, sequel | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat tv series that had 50 episodes was Taylor Lautner in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:tv.tv_series_episode.episode_number \"50\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "He's a Bully, Charlie Brown"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMediterranean Sea: m.04swx | Central European Time Zone: m.02llzg | Country: m.01mp | location.location : events, partially_contains, time_zones, people_born_here, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | geography.island : body_of_water | location.country : official_language, second_level_divisions, administrative_divisions | kg.object_profile : prominent_type | common.topic : notable_types | type.object : name, type | location.statistical_region : co2_emissions_per_capita | time.time_zone : locations_in_this_time_zone\n\n\nquestion:\n\nWhat European Union  countries are on the Mediterranean Sea are also located within the  Central European Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04swx ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Monaco, Spain, France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nZambezia Province: m.01g89l | Country: m.01mp | s. africa: m.0hzlz | location.country : currency_formerly_used, administrative_divisions, iso_alpha_3, official_language, languages_spoken | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.location : time_zones, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | common.topic : notable_types | type.object : name, type | kg.object_profile : prominent_type | film.film_subject : films\n\n\nquestion:\n\nWhat country borders South Africa that contains the Zambezia Province?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hzlz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.01g89l .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mozambique"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSkopje: m.07bbc | Balkans: m.01jjk | location.country : currency_used, administrative_divisions, iso_alpha_3, internet_tld, capital | location.location : containedby, events, adjoin_s, people_born_here, contains, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | type.object : type | common.topic : notable_types | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat Balkan Peninsula bordering Country calls Skopje its capital  city.?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01jjk ns:location.location.contains ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:location.country.capital ns:m.07bbc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Republic of Macedonia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSpain: m.06mkj | fifa 2010 world cup: m.016h2b | sports.sports_team_location : teams | location.location : contains | sports.sports_championship_event : champion | sports.sports_team : arena_stadium, championships | organization.organization_member : member_of | organization.organization_membership : organization | film.film_location : featured_in_films\n\n\nquestion:\n\nWhat Spain sports team that won the 2010 FIFA World Cup championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mkj ns:sports.sports_team_location.teams ?x .\n?x ns:sports.sports_team.championships ns:m.016h2b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Spain national football team"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nStung Treng: m.01cykp | Vietnam War: m.07_nf | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : office_holder | military.military_conflict : casualties, combatants | military.military_combatant_group : combatants | time.event : locations, included_in_event | location.location : events, adjoin_s, people_born_here, contains, containedby | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | military.military_combatant : casualties | military.casualties : lower_estimate, military_conflict | location.adjoining_relationship : adjoins | royalty.kingdom : rulers | type.object : type | location.country : currency_formerly_used, administrative_divisions, national_anthem, languages_spoken | film.film_subject : films | government.national_anthem_of_a_country : anthem | book.book_subject : works | base.culturalevent.event : entity_involved\n\n\nquestion:\n\nWhere was the Vietnam War located that contains Stung Treng?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07_nf ns:time.event.locations ?x .\n?x ns:location.country.administrative_divisions ns:m.01cykp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Cambodia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnkara: m.0jyw | location.location : area, time_zones, people_born_here, contains, containedby | type.object : type | kg.object_profile : prominent_type | location.country : currency_used, capital | government.politician : government_positions_held | common.topic : notable_types | geography.river : mouth\n\n\nquestion:\n\nWhat currency is used in the country with Ankara as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0jyw .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkish lira"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFair Warning Tour: m.03cq111 | architecture.structure : opened, height_meters | people.person : profession, nationality, date_of_birth, place_of_birth, gender | sports.pro_athlete : sports_played_professionally, career_start, career_end | music.album : release_date | music.artist : album, concert_tours | architecture.building : floors | people.deceased_person : cause_of_death, date_of_death | government.politician : government_positions_held | type.object : type | location.location : containedby | government.political_appointer : appointees | government.government_position_held : office_holder, from, to, governmental_body | sports.pro_sports_played : sport | book.book : genre | american_football.football_player : position_s | music.composition : composer | location.country : languages_spoken | government.government_office_or_title : office_holders\n\n\nquestion:\n\nWhat was the name of the debut album of the artist who went on a concert tour called Fair Warning Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.03cq111 .\n?c ns:music.artist.album ?x .\n?x ns:music.album.release_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ain't Talkin' 'Bout Love"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Oaxaca: m.014m1m | Country: m.01mp | location.location : adjoin_s, contains, people_born_here | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, legislative_sessions | time.time_zone : locations_in_this_time_zone | location.statistical_region : size_of_armed_forces, cpi_inflation_rate | measurement_unit.dated_integer : number | location.country : second_level_divisions, administrative_divisions | type.object : name, type | location.adjoining_relationship : adjoins | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nWhat bordering country of the US that has the town Oaxaca?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.014m1m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDes Moines: m.02j3w | Missouri River: m.04ykz | location.statistical_region : population | measurement_unit.dated_integer : number | location.us_state : capital | location.location : partially_containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : second_level_divisions | time.time_zone : locations_in_this_time_zone | common.topic : notable_types | geography.river : mouth\n\n\nquestion:\n\nWhich state has Des Moines as its capital and is touched by the Missouri River?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04ykz ns:location.location.partially_containedby ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:location.us_state.capital ns:m.02j3w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iowa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nReedy Creek Energy Services: m.095_3j | sports.sports_team : sport, founded, championships, roster | organization.organization : founders, date_founded, parent | film.film : genre, story_by | symbols.namesake : named_after | kg.object_profile : prominent_type | type.object : type | education.educational_institution : school_type, students_graduates | education.education : student | location.location : containedby | sports.sports_team_roster : position | organization.organization_relationship : parent | media_common.netflix_title : netflix_genres | film.film_subject : films | media_common.netflix_genre : titles\n\n\nquestion:\n\nWhat was the cartoon that the child organization Reedy Creek Energy Services first appeared in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.095_3j .\n?c ns:media_common.netflix_genre.titles ?x .\n?x ns:tv.tv_program.air_date_of_first_episode ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Walt Disney's Wonderful World of Color"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Juan Manuel Santos: m.02pqvmj | South America: m.06n3y | location.country : currency_formerly_used, currency_used, administrative_divisions, second_level_divisions, languages_spoken | location.location : events, adjoin_s, people_born_here, contains, containedby | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | type.object : name, type | location.adjoining_relationship : adjoins | people.person : religion\n\n\nquestion:\n\nThe location that appointed Juan Manuel Santos to govermental position is made up of what part of South America?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06n3y ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.02pqvmj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colombia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaylor Swift Fearless 2009 Tour: m.05v7c4l | government.politician : government_positions_held, party | government.government_position_held : basic_title, to, from, jurisdiction_of_office | people.person : religion, profession, nationality, parents, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | kg.object_profile : prominent_type | government.political_party_tenure : party | base.culturalevent.event : entity_involved | american_football.football_player : position_s | type.object : type | people.deceased_person : place_of_death | music.artist : concert_tours | location.location : containedby\n\n\nquestion:\n\nWhat is the hometown of the headliner of the Taylor Swift Fearless 2009 Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.05v7c4l .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Reading"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLuie the Tiger: m.0h7c0l3 | location.location : people_born_here, contains, containedby | government.governmental_jurisdiction : governing_officials | type.object : type | location.statistical_region : population | measurement_unit.dated_integer : number | government.government_position_held : office_holder | government.political_district : representatives | education.educational_institution : mascot\n\n\nquestion:\n\nWhere is the location of the school with the Luie the Tiger mascot?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.mascot ns:m.0h7c0l3 .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United States of America, Alabama, Livingston"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nOllanta Humala: m.0d2m0y | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | government.government_position_held : office_holder, from, jurisdiction_of_office, to, governmental_body | people.deceased_person : cause_of_death, place_of_burial, date_of_death, place_of_death | american_football.football_player : position_s | kg.object_profile : prominent_type | type.object : type | government.politician : government_positions_held, party | government.political_party_tenure : party | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | film.actor : film | film.performance : film | location.country : currency_used\n\n\nquestion:\n\nThe location that appointed Ollanta Humala to governmental position uses what type of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0d2m0y .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Peruvian nuevo sol"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPrime minister: m.060bp | Japan: m.03_3d | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to | government.politician : government_positions_held | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.governmental_jurisdiction : governing_officials | people.person : profession, nationality, gender | location.country : iso_alpha_3, languages_spoken | type.object : type | measurement_unit.dated_percentage : rate | government.government_office_category : officeholders | location.location : contains\n\n\nquestion:\n\nWhich prime minister from Japan held his governmental position the earliest from 2012?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03_3d ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060bp .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Shinzō Abe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGovernor: m.0fkvn | Georgia: m.0d0x8 | government.governmental_jurisdiction : official_symbols, governing_officials | government.government_office_category : officeholders | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, to, governmental_body | government.politician : government_positions_held | government.political_district : representatives | people.person : place_of_birth, gender | type.object : type | government.political_appointer : appointees | location.location : contains | government.us_president : presidency_number\n\n\nquestion:\n\nWho holds the position of Georgia governor and took that position after 2003-01-13?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d0x8 ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.0fkvn .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Nathan Deal"
    }
]