[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Mosque: m.04_xn | religion.religion : beliefs, types_of_places_of_worship, holidays, texts | location.location : contains | location.country : administrative_divisions, form_of_government | architecture.building_function : buildings | type.object : type\n\n\nquestion:\n\nWhich religion that has a Mosque as one of its worship places is a major religion in Russia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.types_of_places_of_worship ns:m.04_xn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Islam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nChief Rabbinate of Israel: m.0gyq6k | type.object : type | government.politician : government_positions_held | government.government_position_held : jurisdiction_of_office | travel.tourist_attraction : near_travel_destination | location.location : containedby | organization.organization : place_founded, date_founded | location.religion_percentage : religion | common.topic : notable_types | education.educational_institution : school_type, students_graduates, colors | education.education : student | symbols.namesake : named_after | location.statistical_region : religions | soccer.football_team : borrowed_players | soccer.football_player_loan : player | people.person : nationality | sports.sports_team : founded | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhich of the most popular religions has the religious organization leadership in Israel and is called the Chief Rabbinate?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.0gyq6k .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?y ns:location.religion_percentage.percentage ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTehran Province: m.01ct02 | location.location : time_zones, contains, containedby | type.object : type | common.topic : notable_types | location.country : administrative_divisions, form_of_government | kg.object_profile : prominent_type | architecture.structure : opened\n\n\nquestion:\n\nWhat form of government is used in the nation in which the Tehran Prince is found?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01ct02 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Presidential system, Islamic republic, Unitary state, Theocracy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSharia: m.074hw | religion.religion : deities, places_of_worship, notable_figures, texts, organizations, holidays, sacred_sites, beliefs, founding_figures | book.book_subject : works | type.object : type | common.topic : image | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat are some of the  religious tenants for the people with the sharia belief?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.beliefs ns:m.074hw .\n?c ns:religion.religion.beliefs ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mahdi, Tawhid, Prophets in Islam, Predestination in Islam, Entering Heaven alive, Monotheism, Islamic view of angels, Qiyamah, Sharia, Masih ad-Dajjal, Islamic holy books, God in Islam, Ṭūbā"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKandal Province: m.02h25w | location.location : time_zones, containedby | common.topic : notable_types | location.country : administrative_divisions, languages_spoken | type.object : type | education.educational_institution : school_type | kg.object_profile : prominent_type | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat do they speak in the country that contains the Kandal Province?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02h25w .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Khmer language, Cambodian French, French"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBuenos Aires: m.01ly5m | type.object : type | location.location : time_zones, people_born_here, contains, containedby | location.country : currency_used, administrative_divisions | time.event : locations | kg.object_profile : prominent_type | common.topic : notable_types | location.mailing_address : country | tv.tv_program : episode_running_time | government.politician : government_positions_held | government.government_position_held : from | people.person : profession | symbols.namesake : named_after\n\n\nquestion:\n\nThe country that contains Buenos Aires uses what type of money?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01ly5m .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Argentine peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRick Carlisle: m.02zxw4 | Steve Nash: m.01yqrk | people.person : profession, nationality, height_meters, place_of_birth, gender | sports.sports_team : arena_stadium, founded, colors, team_mascot, location, sport, championships, roster | basketball.basketball_player : player_statistics, position_s | award.award_nominee : award_nominations | award.award_nomination : award | sports.sports_team_roster : player, team, position | sports.pro_athlete : teams, career_start | common.topic : notable_types | sports.professional_sports_team : owner_s | basketball.basketball_team : head_coach | type.object : type | kg.object_profile : prominent_type | basketball.basketball_player_stats : team\n\n\nquestion:\n\nWhich basketball team owned by Rick Carlisle did Steve Nash play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01yqrk ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:basketball.basketball_team.head_coach ns:m.02zxw4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dallas Mavericks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral Western Time Zone: m.0y498v7 | government.politician : government_positions_held | government.government_position_held : basic_title, from, jurisdiction_of_office | people.person : profession, nationality, height_meters, place_of_birth, gender | type.object : type | common.topic : notable_types | location.location : time_zones, containedby | architecture.structure : opened | location.country : form_of_government | time.time_zone : locations_in_this_time_zone | time.event : start_date | media_common.netflix_title : netflix_genres | symbols.namesake : named_after\n\n\nquestion:\n\nWhat political system is practiced in the Central Western Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.time_zones ns:m.0y498v7 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Constitutional monarchy, Federal monarchy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPhilip Anschutz: m.02fzwl | kg.object_profile : prominent_type | people.person : religion, profession, nationality, parents, date_of_birth, height_meters, place_of_birth, gender | music.group_member : instruments_played | type.object : type | government.politician : government_positions_held | government.government_position_held : legislative_sessions, governmental_body | people.deceased_person : date_of_death, place_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | american_football.football_player : position_s | location.location : time_zones, containedby | sports.professional_sports_team : owner_s | sports.sports_team : championships | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nWhat was the last time the sports team owned by Phillip Anschutz win a playoff series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.02fzwl .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2014 Stanley Cup Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSeoul: m.0hsqf | location.country : administrative_divisions, form_of_government | kg.object_profile : prominent_type | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title | location.location : time_zones, area, containedby | common.topic : notable_types | geography.river : basin_countries | people.deceased_person : date_of_death | people.person : gender, ethnicity\n\n\nquestion:\n\nWhat type of government does the country where Seoul is have?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0hsqf .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Unitary state, Constitutional republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\njohn kennedy: m.0d3k14 | Marriage: m.04ztj | \n\n\nquestion:\n\nWho held his governmental position from earliest and was John F. Kennedy's family?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\n# Parents\nns:m.0d3k14 ns:people.person.parents ?x .\n}\nUNION\n{\n# Children\nns:m.0d3k14 ns:people.person.children ?x .\n}\nUNION\n{\n# Siblings\nns:m.0d3k14 ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n}\nUNION\n{\n# Spouse\nns:m.0d3k14 ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\n}?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Joseph P. Kennedy, Sr."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVietnamese dong: m.03ksl6 | Country: m.01mp | location.location : adjoin_s, contains, containedby | location.adjoining_relationship : adjoins | people.person : religion, profession, nationality, height_meters, gender | language.human_language : countries_spoken_in | type.object : name, type | people.deceased_person : place_of_death | architecture.structure : height_meters | common.topic : notable_types | government.government_office_category : officeholders | government.government_position_held : basic_title, office_holder, from, jurisdiction_of_office | government.politician : government_positions_held | government.form_of_government : countries | government.government_office_or_title : office_holders | kg.object_profile : prominent_type | location.country : currency_used | event.speech_topic : speeches_or_presentations_on_this_topic | event.speech_or_presentation : speaker_s | government.governmental_jurisdiction : governing_officials\n\n\nquestion:\n\nWhat countries border the country that uses Vietnamese dong?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.03ksl6 .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Cambodia, Laos, China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJeb Bush: m.019x9z | people.person : religion, profession, nationality, parents, ethnicity, places_lived, date_of_birth, height_meters, place_of_birth, gender | film.film : featured_film_locations | government.politician : government_positions_held, party | government.political_party_tenure : party | type.object : type | location.location : time_zones | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | military.military_person : participated_in_conflicts | government.government_position_held : appointed_by | organization.organization_founder : organizations_founded | people.place_lived : location | kg.object_profile : prominent_type | common.topic : notable_types\n\n\nquestion:\n\nWhat time zone is in the location where Jeb Bush was appointed to a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.019x9z .\n?c ns:location.location.time_zones ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "UTC−05:00, Central Time Zone, Eastern Time Zone"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKaduna State: m.06xjmb | location.country : administrative_divisions, form_of_government | location.location : time_zones, people_born_here, contains, containedby | type.object : type | common.topic : notable_types | education.educational_institution : school_type | kg.object_profile : prominent_type | architecture.structure : opened, height_meters | location.administrative_division : country\n\n\nquestion:\n\nThe nation where Kaduna State is located has which type of political system?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.06xjmb .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presidential system, Federal republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJohn J Tracy: m.03wxg8f | people.person : religion, children, profession, nationality, parents, height_meters, place_of_birth, gender | people.deceased_person : cause_of_death, date_of_death, place_of_death | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title, jurisdiction_of_office | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | kg.object_profile : prominent_type | organization.organization : headquarters\n\n\nquestion:\n\nWhere is the organization led by John J Tracy located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.03wxg8f .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Chicago"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Cherkasy Oblast: m.02h81c | Body Of Water: m.01y2jks | type.object : type | location.location : time_zones, area, containedby | common.topic : notable_types | travel.tourist_attraction : near_travel_destination | kg.object_profile : prominent_type | location.country : administrative_divisions\n\n\nquestion:\n\nWhich countries and seas have a border with the country where the Cherkasy Oblast is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02h81c .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n{ {?x ns:common.topic.notable_types ns:m.01mp .} UNION {?x ns:common.topic.notable_types ns:m.01y2jks .} }\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belarus, Hungary, Moldova, Poland, Russia, Romania, Slovakia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nZygi Wilf: m.07d8sx | Hank Baskett: m.0d81yf | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | sports.sports_team : roster | sports.sports_team_roster : team, position | location.country : second_level_divisions, administrative_divisions | sports.professional_sports_team : owner_s | people.person : nationality | sports.pro_athlete : teams | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat team owned by Zygi Wilf did Hank Baskett play on in 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.professional_sports_team.owner_s ns:m.07d8sx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Minnesota Vikings"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1973 NBA Finals: m.0cs1kg | book.author : works_written | type.object : type | time.event : end_date, locations, instance_of_recurring_event | sports.sports_championship_event : championship | location.location : time_zones, people_born_here, contains, containedby | travel.tourist_attraction : near_travel_destination | kg.object_profile : prominent_type | people.deceased_person : place_of_death | sports.pro_athlete : teams | common.topic : notable_types | people.person : religion, nationality, place_of_birth | government.political_district : representatives | government.government_position_held : basic_title, office_holder, governmental_body, district_represented | basketball.basketball_team : head_coach | government.government_office_category : officeholders | sports.sports_team : championships | book.book_subject : works | award.award_nominee : award_nominations | language.human_language : countries_spoken_in | government.politician : government_positions_held | religion.religion : holidays | music.lyricist : lyrics_written | education.educational_institution : students_graduates | education.education : student | film.film_genre : films_in_this_genre\n\n\nquestion:\n\nWhich man presently serves as head coach of the franchise that claimed the 1973 NBA Finals Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0cs1kg .\n?c ns:basketball.basketball_team.head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Derek Fisher"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMaria Theresa: m.0czh6 | location.location : partially_contains, contains, containedby | people.person : religion, profession, nationality | type.object : type | royalty.monarch : kingdom | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.country : administrative_divisions\n\n\nquestion:\n\nWhat empire did Maria Theresa rule that had CO2 emissions per capital of 2009 metric ton?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0czh6 ns:royalty.monarch.kingdom ?x .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2009\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hungary"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSan Jose: m.0f04v | Pacific Time Zone: m.02lcqs | location.location : time_zones, containedby, contains, people_born_here | travel.tourist_attraction : near_travel_destination | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | travel.travel_destination : tourist_attractions | location.country : second_level_divisions | time.time_zone : locations_in_this_time_zone\n\n\nquestion:\n\nWhat is there to do in the Pacific Time Zone in San Jose, CA?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f04v ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.02lcqs .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Winchester Mystery House, San Jose Museum of Art, Santana Row"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJames Franco: m.05bnp0 | ucla men's basketball: m.02pqcfz | education.educational_institution : school_type, students_graduates, sports_teams | education.education : institution, student | type.object : type | film.director : film | people.person : profession, nationality, education, languages, height_meters, place_of_birth, gender | basketball.basketball_team : head_coach | film.actor : film | film.performance : character, film | award.award_nominee : award_nominations | award.award_nomination : nominated_for | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | kg.object_profile : prominent_type | sports.school_sports_team : school | fictional_universe.school_in_fiction : students_graduates | tv.tv_actor : starring_roles | tv.regular_tv_appearance : series | location.location : events | sports.sports_team : location, sport, roster | sports.sports_team_roster : player | common.topic : notable_types | medicine.cancer_center_constituent : cancer_center | film.writer : film\n\n\nquestion:\n\nWhat educational institution with men's basketball sports team named UCLA Bruins did James Franco go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05bnp0 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.02pqcfz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of California, Los Angeles"
    }
]