[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAli: m.024c1p | people.person : religion, profession, nationality, ethnicity, date_of_birth, place_of_birth, gender | american_football.football_player : position_s | government.politician : government_positions_held, party | government.government_position_held : from, jurisdiction_of_office | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | religion.religion : notable_figures, holidays | type.object : type | government.political_party_tenure : party | influence.influence_node : influenced | people.deceased_person : cause_of_death, place_of_death | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nWHich holidays are celebrated by the religion that has Ali as a central character?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.notable_figures ns:m.024c1p .\n?c ns:religion.religion.holidays ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lailat al Mi'raj, Nuzul Al-Quran, Eid al-Fitr, Eid al-Adha, Day of Arafat, Day of Ashura, Mourning of Muharram, Laylat al-Qadr, Barat Night, Mawlid, Ramadan, Islamic New Year, Eid al-Fitr Eve, Eid-Ul-Adha Eve, Night of Wishes"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEastern Catholic Churches: m.01fgks | government.politician : government_positions_held | government.government_position_held : basic_title, office_position_or_title, jurisdiction_of_office | influence.influence_node : influenced_by | type.object : type | people.deceased_person : cause_of_death | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | finance.currency : countries_used, countries_formerly_used | location.country : languages_spoken | architecture.structure : opened, height_meters | media_common.netflix_genre : titles | location.location : containedby | geography.river : basin_countries | religion.religion : deities, organizations | government.political_appointer : appointees | biology.animal_breed : place_of_origin | organization.organization : founders\n\n\nquestion:\n\nWhat is the spoken language used in the country with Eastern Catholic Churches?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.01fgks .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Guaraní language, Quechuan languages, Spanish Language, Yiddish Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNordic countries: m.0140mf | Country: m.01mp | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | common.topic : notable_types | organization.organization_founder : organizations_founded | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.location : events, contains | location.country : official_language, currency_used, second_level_divisions, form_of_government | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat Nordic country had CO2 emissions capita once of 2010 metric ton?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0140mf ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2010\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Finland, Faroe Islands, Greenland, Iceland, Norway, Sweden, Denmark"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nchicago, illinois: m.01_d4 | people.person : children, profession, nationality, spouse_s, height_meters, gender | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : career_start | location.location : time_zones, contains, containedby | film.film : genre, country | type.object : type | people.deceased_person : cause_of_death, place_of_death, place_of_burial | architecture.structure : height_meters | government.politician : government_positions_held, party | government.political_party_tenure : party | government.government_position_held : jurisdiction_of_office, governmental_body | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat museum established before September 16, 1893 is a good hang out in Chicago?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:architecture.museum.established ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Art Institute of Chicago"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1957 NBA Finals: m.0cs2n0 | sports.sports_championship : events | sports.sports_team : arena_stadium, colors, sport, championships, roster | sports.sports_team_roster : player, position | type.object : type | common.topic : notable_types | sports.sports_championship_event : champion, runner_up | time.recurring_event : instances, date_of_first_occurance | kg.object_profile : prominent_type | time.event : start_date | sports.defunct_sports_team : later_known_as\n\n\nquestion:\n\nThe team that won the 1957 NBA Finals championship won their first championship in what year?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0cs2n0 .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1957 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Bible: m.015j7 | Madonna: m.01vs_v8 | book.book : genre | film.actor : film | film.performance : film | award.award_nominee : award_nominations | award.award_nomination : award, nominated_for | common.topic : image | religion.religion : deities, places_of_worship, types_of_places_of_worship, organizations, texts, founding_figures | people.person : religion, quotations, profession, ethnicity, languages | music.artist : genre, label, concert_tours | type.object : type | film.film_subject : films | influence.influence_node : influenced_by | music.lyricist : lyrics_written | music.featured_artist : recordings\n\n\nquestion:\n\nThe Bible and Madonna practice the same religion - name it.?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01vs_v8 ns:people.person.religion ?x .\n?x ns:religion.religion.texts ns:m.015j7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBoxers Tour: m.010f58dv | location.location : contains, people_born_here | type.object : type | music.genre : albums | location.country : internet_tld, currency_used, administrative_divisions | common.topic : notable_types | film.film_job : films_with_this_crew_job | film.film_crew_gig : crewmember | film.film : starring, subjects | kg.object_profile : prominent_type | influence.influence_node : influenced_by | film.performance : actor | organization.organization : date_founded | religion.religion : beliefs, types_of_places_of_worship | people.person : profession | time.event : end_date | music.artist : concert_tours\n\n\nquestion:\n\nThe artist who had the concert tour named Boxers Tour Live 2010 lives where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.010f58dv .\n?c ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\nEXISTS {?y ns:people.place_lived.end_date ?sk1 .\nEXISTS {?y ns:people.place_lived.start_date ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Manchester"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHoh River: m.039fqk | location.location : time_zones, partiallycontains, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | type.object : type | location.country : second_level_divisions, administrative_divisions | location.partial_containment_relationship : partially_contains | geography.river : mouth | geography.geographical_feature : category\n\n\nquestion:\n\nWhat location partially contain the Hoh River?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.039fqk .\n?c ns:base.usnationalparks.us_national_park.state ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRon Howard: m.0g2lq | film.actor : film | film.performance : character, actor, film | people.person : children, profession, ethnicity, languages, gender | film.film : language, film_art_direction_by, release_date_s, story_by, edited_by, music, executive_produced_by, film_casting_director, country, initial_release_date, genre, gross_revenue, starring, directed_by | type.object : type | film.producer : film | measurement_unit.dated_money_value : currency | film.director : film | film.film_story_contributor : film_story_credits | film.film_character : portrayed_in_films | film.film_regional_release_date : film_release_distribution_medium, release_date | common.topic : notable_types | fictional_universe.fictional_character : character_created_by | film.writer : film | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat movie directed by Ron Howard has a character named Bezu Fache?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0g2lq ns:film.director.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:g.1236mywd .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "The Da Vinci Code"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2013 AFC Championship Game: m.0_gtz8t | sports.sports_team : arena_stadium, founded, colors, location, fight_song, sport, team_mascot, championships, roster | sports.sports_championship : events | award.award_nominee : award_nominations | award.award_nomination : nominated_for | type.object : type | time.recurring_event : date_of_first_occurance, instances | sports.sports_team_roster : player | american_football.football_team : current_head_coach, division | architecture.structure : opened | time.event : end_date, start_date | film.film_subject : films | sports.professional_sports_team : draft_picks, owner_s | kg.object_profile : prominent_type | sports.sports_facility : teams | common.topic : notable_types | location.location : events | sports.sports_championship_event : championship | sports.sports_league_draft_pick : player\n\n\nquestion:\n\nWhen did the winning team of the 2013 AFC Championship win the superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gtz8t .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XLVII, Super Bowl XXXV, 2001 AFC Championship Game, 2013 AFC Championship Game"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJason Kidd: m.02cg2v | 2011 NBA Finals: m.0cm910t | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, championships, roster | sports.sports_team_roster : player, team, position | kg.object_profile : prominent_type | type.object : type | sports.pro_athlete : teams, career_start | sports.professional_sports_team : owner_s | people.person : religion, profession, nationality, ethnicity, education, place_of_birth, gender | basketball.basketball_team : head_coach | award.award_nominee : award_nominations | award.award_nomination : award | common.topic : notable_types | time.event : locations, instance_of_recurring_event | sports.sports_championship_event : championship, champion, runner_up | basketball.basketball_player : position_s | education.education : institution\n\n\nquestion:\n\nWhat team did Jason Kidd play for that won the 2011 NBA Final Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02cg2v ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.0cm910t .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dallas Mavericks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDear Land of Guyana, of Rivers and Plains: m.01pm62 | language.human_language : main_country, countries_spoken_in | geography.river : basin_countries | location.location : partially_containedby, contains, containedby | influence.influence_node : influenced_by | people.person : profession, ethnicity, height_meters, place_of_birth, gender | type.object : name, type | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, jurisdiction_of_office | common.topic : notable_types | location.country : form_of_government | government.form_of_government : countries | people.deceased_person : cause_of_death | government.government_office_category : officeholders | government.government_office_or_title : office_holders | government.governmental_jurisdiction : governing_officials | finance.currency : countries_used\n\n\nquestion:\n\nWhat is the governmental system of the country with the national anthem Dear Land of Guyana, of Rivers and Plains?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01pm62 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Semi-presidential system, Unitary state, Republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFood and Beverage: m.08080b | people.person : religion, profession, nationality, spouse_s, place_of_birth, gender | type.object : type | location.location : people_born_here, containedby, contains, partially_contains | kg.object_profile : prominent_type | architecture.structure : opened | government.politician : government_positions_held | government.government_position_held : office_holder, district_represented, basic_title, jurisdiction_of_office, to | location.country : official_language | book.book_subject : works | government.governmental_jurisdiction : governing_officials | people.deceased_person : date_of_burial, cause_of_death, place_of_death | common.topic : notable_types | time.event : end_date, included_in_event | film.film_subject : films | book.book : genre | government.political_appointer : appointees | language.human_language : iso_639_1_code | fictional_universe.fictional_setting : languages | government.governmental_body : members | people.marriage : spouse\n\n\nquestion:\n\nWhat language do people speak in the country that is the major exporter of Industry Food and Beverage?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.statistical_region.major_exports ?k .\n?k ns:location.imports_exports_by_industry.industry ns:m.08080b .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Portuguese Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUS State: m.0kpys4 | Saint Louis Billikens men's basketball: m.026c51k | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | education.educational_institution : mascot, school_type, colors, newspaper, sports_teams, students_graduates | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | location.location : containedby | sports.sports_team : arena_stadium, roster | sports.sports_team_roster : player | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | organization.organization : date_founded | education.education : student | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | american_football.football_team : division | fictional_universe.school_in_fiction : students_graduates | sports.school_sports_team : school\n\n\nquestion:\n\nWhat state is the education institution that has a basketball team called the Saint Louis Billikens?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.026c51k .\n?c ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Missouri"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nespa√±ol: m.06nm1 | Society of Jesus: m.04399 | biology.breed_origin : breeds_originating_here | location.statistical_region : size_of_armed_forces, religions | location.religion_percentage : religion | language.human_language : countries_spoken_in | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | location.location : partially_contains, adjoin_s, people_born_here, contains, containedby | measurement_unit.dated_integer : number | book.book_subject : works | location.adjoining_relationship : adjoins | type.object : type | media_common.netflix_genre : titles | organization.organization : founders | location.country : official_language, administrative_divisions | food.beer_country_region : beers_from_here\n\n\nquestion:\n\nWhat country's main language is Spanish and has a religious organization named Society of Jesus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06nm1 ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.official_language ns:m.06nm1 .\n?x ns:religion.religious_leadership_jurisdiction.leader ?c .\n?c ns:religion.religious_organization_leadership.organization ns:m.04399 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Argentina"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRepublika Srpska: m.01yw4d | common.topic : notable_types | location.location : time_zones, containedby | type.object : type | kg.object_profile : prominent_type | architecture.structure : opened | location.country : administrative_divisions\n\n\nquestion:\n\nThe Republika Srpska is part of the country located where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01yw4d .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Europe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBasra Governorate: m.01cfg7 | Gulf War: m.018w0j | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title, appointed_by | location.location : events, containedby, contains, people_born_here | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | military.military_conflict : combatants | military.military_combatant_group : combatants | location.country : administrative_divisions, iso3166_1_alpha2, capital, languages_spoken | type.object : type | base.culturalevent.event : entity_involved | time.event : locations | fictional_universe.fictional_setting : fictional_characters_born_here | common.topic : notable_types\n\n\nquestion:\n\nWhat country that was involved in the Gulf War and has Basra Governorate?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.018w0j ns:military.military_conflict.combatants ?y .\n?y ns:military.military_combatant_group.combatants ?x .\n?x ns:location.country.administrative_divisions ns:m.01cfg7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iraq"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPrime Minister of Canada: m.060m4 | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, jurisdiction_of_office, to | government.political_appointer : appointees | location.statistical_region : population, consumer_price_index, co2_emissions_per_capita, net_migration | measurement_unit.dated_integer : number | government.governmental_body : members | type.object : type | people.person : religion, profession, nationality, place_of_birth | location.location : partially_contains, adjoin_s, contains, people_born_here | government.politician : government_positions_held | people.deceased_person : cause_of_death | location.adjoining_relationship : adjoins | base.culturalevent.event : entity_involved\n\n\nquestion:\n\nWho held his governmental position from June 25, 1993 and was Canadian Prime Minister in 1993?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.060m4 ns:government.government_office_or_title.office_holders ?y .\n?y ns:government.government_position_held.office_holder ?x .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jean Chrétien"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTurkish people: m.0hb7h_z | Sulaymaniyah: m.02_wp3 | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, appointed_by | location.country : administrative_divisions, national_anthem, official_language, iso3166_1_alpha2, languages_spoken, form_of_government | location.location : people_born_here, events, contains, containedby | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | people.ethnicity : geographic_distribution, includes_groups | government.national_anthem_of_a_country : anthem | military.military_combatant : casualties | military.casualties : military_conflict | periodicals.newspaper_circulation_area : newspapers | type.object : type | fictional_universe.fictional_setting : fictional_characters_born_here\n\n\nquestion:\n\nWhere did the Turkish people originate, that's the location of Sulaymaniyah?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hb7h_z ns:people.ethnicity.geographic_distribution ?x .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.02_wp3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iraq"
    }
]