[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBruce Babbitt: m.018mts | United States Senator: m.02_7l8y | government.government_position_held : basic_title, office_holder, office_position_or_title, legislative_sessions | government.politician : government_positions_held, party | government.political_district : representatives | kg.object_profile : prominent_type | location.location : containedby | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.person : religion, nationality, place_of_birth, gender | people.deceased_person : place_of_burial, place_of_death | media_common.netflix_title : netflix_genres | type.object : type | government.political_party_tenure : party | film.film : initial_release_date | architecture.structure : height_meters | american_football.football_player : position_s\n\n\nquestion:\n\nWho is the State Senator in the location that appointed Bruce Babbitt to govermental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.018mts .\n?c ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.02_7l8y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barry Goldwater, Jon Kyl, Jeff Flake, Carl Hayden, Ernest McFarland, Dennis DeConcini, Paul Fannin, Henry F. Ashurst, Marcus A. Smith, Ralph H. Cameron, John McCain"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nContinent: m.01mh | Nuuk: m.0d_1m | type.object : type | location.location : time_zones, partially_containedby, contains, containedby | kg.object_profile : prominent_type | government.political_district : representatives | government.government_position_held : office_holder | geography.river : origin, basin_countries | common.topic : notable_types | location.country : capital\n\n\nquestion:\n\nWhat continent is the country with the capital of Nuuk located in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0d_1m .\n?c ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "North America"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThai baht: m.0mcb5 | location.location : contains, containedby | language.human_language : main_country, countries_spoken_in | time.event : start_date, included_in_event | people.deceased_person : date_of_death | government.form_of_government : countries | type.object : type | architecture.structure : opened, height_meters | religion.religion : types_of_places_of_worship | location.country : currency_used | film.film : starring | film.performance : actor | sports.sports_team : sport | biology.animal_breed : place_of_origin | government.politician : government_positions_held | government.government_position_held : office_holder, office_position_or_title, to | people.person : profession, nationality, place_of_birth | common.topic : notable_types | kg.object_profile : prominent_type | government.government_office_category : officeholders | government.governmental_jurisdiction : governing_officials | symbols.namesake : named_after | travel.travel_destination : tourist_attractions | architecture.building : floors\n\n\nquestion:\n\nWhat religion is in the country that uses the Thai baht?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.0mcb5 .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Christian, Buddhism, Islam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJohn C. Malone: m.04sjlv | kg.object_profile : prominent_type | architecture.structure : opened | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.sports_team : team_mascot | people.deceased_person : date_of_death, place_of_death | government.politician : government_positions_held, party | government.political_party_tenure : party | location.location : people_born_here, containedby | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.government_position_held : legislative_sessions, governmental_body | film.film : music | sports.professional_sports_team : owner_s | influence.influence_node : influenced_by\n\n\nquestion:\n\nWhat is the mascot of the sports team owned by John C. Malone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.04sjlv .\n?c ns:sports.sports_team.team_mascot ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Homer, Rally, Chief Noc-A-Homa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1995 World Series: m.04j712 | common.topic : notable_types | sports.sports_team : team_mascot, championships | people.person : religion, profession, nationality, gender | location.location : contains, people_born_here | type.object : type | kg.object_profile : prominent_type | people.deceased_person : place_of_death | base.culturalevent.event : entity_involved | sports.sports_championship_event : championship | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, to | event.speech_topic : speeches_or_presentations_on_this_topic | event.speech_or_presentation : speaker_s | education.educational_institution : students_graduates | education.education : student | government.politician : government_positions_held | time.event : end_date, locations, instance_of_recurring_event | organization.organization : child | organization.organization_relationship : child | media_common.netflix_genre : titles | influence.influence_node : influenced_by, influenced | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.country : iso_alpha_3, form_of_government | music.artist : genre | government.political_appointer : appointees | biology.animal_breed : place_of_origin | government.government_office_category : officeholders | film.film_story_contributor : film_story_credits\n\n\nquestion:\n\nWhat was the name of the mascot of the winner of the 1995 World Series Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04j712 .\n?c ns:sports.sports_team.team_mascot ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Homer, Rally, Chief Noc-A-Homa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMohamed Al-Fayed: m.051g0 | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | american_football.football_player : position_s | people.deceased_person : cause_of_death, place_of_death | government.politician : government_positions_held | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.government_position_held : district_represented, office_position_or_title, from, legislative_sessions, governmental_body | kg.object_profile : prominent_type | sports.professional_sports_team : owner_s | sports.sports_team : location\n\n\nquestion:\n\nWhat home city does the sports team owned by Mohammed Al-Fayed play in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.051g0 .\n?c ns:sports.sports_team.location ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Fulham"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGreece: m.035qy | Country: m.01mp | Tirana: m.07m_f | location.location : partially_contains, containedby, contains, people_born_here | location.statistical_region : consumer_price_index, population, gdp_real, places_imported_from, foreign_direct_investment_net_inflows, part_time_employment_percent, places_exported_to | location.imports_and_exports : exported_to, imported_from | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : basic_title, office_holder, appointed_by | event.speech_topic : speeches_or_presentations_on_this_topic | event.speech_or_presentation : speaker_s | kg.object_profile : prominent_type | type.object : name, type | location.country : official_language, capital, languages_spoken, form_of_government | common.topic : notable_types | measurement_unit.dated_integer : number | measurement_unit.adjusted_money_value : adjusted_value | film.film_location : featured_in_films | measurement_unit.dated_money_value : amount | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nOf the countries which Greece share borders with, which has the country capital of Tirana?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.035qy ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.07m_f .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Albania"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMcDonald's Polska Sp.zo.o.: m.09n79y3 | type.object : type | common.topic : notable_types | organization.organization : date_founded, founders, parent | organization.organization_relationship : parent | education.educational_institution : students_graduates, colors | education.education : student | location.location : containedby | sports.sports_team : sport, founded, colors | baseball.baseball_team : team_stats | kg.object_profile : prominent_type | government.governmental_body : members | government.government_position_held : office_holder | government.political_party : politicians_in_this_party | government.political_party_tenure : politician\n\n\nquestion:\n\nWho founded the organization McDonald's Polska Sp.zo.o?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.09n79y3 .\n?c ns:organization.organization.founders ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ray Kroc, Richard McDonald, Maurice McDonald"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Country: m.01mp | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value | location.location : partially_contains, partially_containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | meteorology.cyclone_affected_area : cyclones | media_common.netflix_genre : titles | common.topic : notable_types | location.administrative_division : country | type.object : name | location.country : second_level_divisions\n\n\nquestion:\n\nWhat bordering country of the US that once had the smallest population?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.population ?c .\n?c ns:measurement_unit.dated_integer.number ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Canada"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLyon: m.0dprg | Roman Empire: m.06cmp | type.object : type | kg.object_profile : prominent_type | location.location : area, time_zones, partially_containedby, contains, containedby | location.mailing_address : citytown | common.topic : notable_types | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nOn what continent that was part of the Roman Empire would you find the location where the city of Lyon is?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06cmp ns:location.location.partially_contained_by ?y .\n?y ns:location.partial_containment_relationship.partially_contained_by ?x .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0dprg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Europe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLiverpool College of Art: m.0cb3vj | kg.object_profile : prominent_type | common.topic : notable_types | people.person : place_of_birth | location.location : time_zones, events, containedby | government.government_office_or_title : office_holders | government.government_position_held : from | travel.tourist_attraction : near_travel_destination | type.object : type | music.artist : genre\n\n\nquestion:\n\nWhat type of music does the artist who educated at Liverpool College of Art sing?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0cb3vj .\n?c ns:music.artist.genre ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Soft rock, Blues rock, Experimental music, Pop rock, Psychedelic rock, Pop music, Rock music, Experimental rock, Art rock"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Avril Lavigne Tour: m.0z2ntbg | film.film_character : portrayed_in_films | film.performance : actor | language.human_language : countries_spoken_in | location.location : containedby, contains, people_born_here | sports.sports_team : location, arena_stadium, colors | sports.sports_team_location : teams | type.object : type | common.topic : notable_types | music.composition : composer | music.genre : albums | time.event : end_date, locations | music.artist : concert_tours | organization.organization : date_founded | ice_hockey.hockey_team : coach | people.person : profession | architecture.venue : capacity | award.award_category : date_established | music.instrument : family | media_common.netflix_genre : titles\n\n\nquestion:\n\nWhere does the artist who went on The Avril Lavigne Tour live?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0z2ntbg .\n?c ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\nEXISTS {?y ns:people.place_lived.end_date ?sk1 .\nEXISTS {?y ns:people.place_lived.start_date ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belleville, Greater Napanee"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRally Supporter #1: m.0vx6yrm | Howard Stern: m.0sx5w | location.location : contains, people_born_here | film.film_genre : films_in_this_genre | film.film : starring | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : second_level_divisions | media_common.netflix_genre : titles | people.person : profession | film.performance : actor, film | fictional_universe.fictional_language : found_in_fictional_universe | film.film_character : portrayed_in_films | type.object : type | location.place_with_neighborhoods : neighborhoods | celebrities.celebrity : sexual_relationships | celebrities.romantic_relationship : celebrity\n\n\nquestion:\n\nIn the film with the character named Rally Supporter #1, who played Howard Stern?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0vx6yrm .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.special_performance_type ?x .\n?y ns:film.performance.actor ns:m.0sx5w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Him/Herself"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1973 NBA Finals: m.0cs1kg | sports.sports_championship : events | sports.sports_team : colors, championships, roster | type.object : type | sports.sports_team_roster : player, position | organization.organization : leadership, date_founded | award.award_nominee : award_nominations | award.award_nomination : award | basketball.basketball_team : head_coach | kg.object_profile : prominent_type | sports.professional_sports_team : owner_s | sports.sports_championship_event : championship, runner_up | time.recurring_event : current_frequency | organization.leadership : person, role | common.topic : image\n\n\nquestion:\n\nIn what all years did the championship team who won the 1973 NBA Finals win the championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0cs1kg .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1973 NBA Finals, 1970 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nZulia: m.01hrr7 | type.object : type | location.location : time_zones, people_born_here, containedby | common.topic : notable_types | location.country : administrative_divisions | sports.sports_team_location : teams | travel.tourist_attraction : near_travel_destination | architecture.structure : height_meters | geography.island : body_of_water | government.form_of_government : countries | kg.object_profile : prominent_type\n\n\nquestion:\n\nWHat sports are played by residents of the country that incldues Zulia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hrr7 .\n?c ns:sports.sports_team_location.teams ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Venezuela women's national volleyball team, Venezuela men's national volleyball team, Venezuela national football team, Cocodrilos de Caracas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMichoacán: m.01btry | kg.object_profile : prominent_type | type.object : type | location.location : time_zones, area, contains, containedby | location.country : official_language, currency_used, administrative_divisions | common.topic : notable_types\n\n\nquestion:\n\nThe country that contains Michoacan would require me to bring what type of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01btry .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIsraeli–Palestinian conflict: m.0cj5y | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, to, governmental_body | organization.organization_founder : organizations_founded | people.person : religion, profession, nationality, place_of_birth, gender | time.event : people_involved, locations, start_date | government.politician : government_positions_held, party | type.object : type | location.location : partially_contains, events, contains, containedby | people.deceased_person : date_of_death | government.political_appointer : appointees | government.political_party_tenure : from\n\n\nquestion:\n\nWho are three of the most influential Palestinian relative to the  Israeli Palestinian conflict since 1981?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0cj5y ns:time.event.people_involved ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ariel Sharon, Mahmoud Abbas, Colin Powell, Hanan Ashrawi, Yasser Arafat, Yitzhak Rabin, Shimon Peres, Abdullah of Saudi Arabia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nunion of soviet socialist republics: m.05vz3zq | World War II: m.081pw | time.event : locations, start_date, includes_event, end_date, included_in_event | people.person : nationality | government.government_position_held : office_holder, office_position_or_title, from | common.topic : notable_types | government.government_office_or_title : office_holders | base.culturalevent.event : entity_involved | government.politician : government_positions_held | type.object : type | government.governmental_jurisdiction : governing_officials | people.deceased_person : place_of_death | military.military_person : participated_in_conflicts | location.location : contains\n\n\nquestion:\n\nWho held his govermental position from October 14, 1964 and was the Soviet leader during World War II?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05vz3zq ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?x ns:military.military_person.participated_in_conflicts ns:m.081pw .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1964-10-14\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leonid Brezhnev"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRegion: m.01nt | Ancash Region: m.01n194 | government.political_district : representatives | government.government_position_held : office_holder | location.location : containedby, adjoin_s, time_zones, people_born_here, partially_containedby, contains, partially_contains | type.object : type | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | location.country : calling_code, capital, administrative_divisions, form_of_government | common.topic : notable_types | transportation.bridge : locale | location.adjoining_relationship : adjoins | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat rainforest is in the country that has Ancash Region?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01n194 .\n?c ns:location.location.partially_contains ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Amazon rainforest"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrong-Ahafo Region: m.054mgp | common.topic : notable_types | location.location : time_zones, containedby, people_born_here | type.object : type | kg.object_profile : prominent_type | location.hud_county_place : county | location.country : official_language, administrative_divisions | architecture.structure : opened\n\n\nquestion:\n\nWhat language is spoken where Brong-Ahafo Region is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.054mgp .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language"
    }
]