[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAn Evening of the Bee Gees Greatest Hits Tour: m.0ryvw84 | type.object : type | music.genre : albums | location.location : containedby, contains, people_born_here | common.topic : notable_types | music.composition : composer | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | people.person : profession | location.country : administrative_divisions | organization.organization_founder : organizations_founded | music.group_member : instruments_played | media_common.netflix_genre : titles | kg.object_profile : prominent_type | food.diet_follower : follows_diet | organization.organization : date_founded | people.cause_of_death : parent_cause_of_death | music.artist : concert_tours\n\n\nquestion:\n\nThe artist who had a concert tour named An Evening of the Bee Gees Greatest Hits Tour played what instrument?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0ryvw84 .\n?c ns:music.group_member.instruments_played ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Piano, Violin"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDu gamla, Du fria: m.0m6w8 | government.politician : government_positions_held | government.government_position_held : governmental_body, jurisdiction_of_office | location.location : time_zones, area, contains, containedby | people.person : date_of_birth, religion, profession, nationality | location.country : form_of_government | type.object : name, type | kg.object_profile : prominent_type | government.form_of_government : countries | common.topic : notable_types | geography.river : basin_countries | architecture.building : floors\n\n\nquestion:\n\nWhat form of government is in the country with national anthem Du gamla, Du fria?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.0m6w8 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Unitary state, Hereditary monarchy, Constitutional monarchy, Representative democracy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNina Dobrev: m.027nwk2 | people.person : profession, nationality, gender | location.statistical_region : population, consumer_price_index, gdp_real, religions, foreign_direct_investment_net_inflows, size_of_armed_forces, co2_emissions_per_capita, part_time_employment_percent, net_migration | measurement_unit.dated_integer : number | measurement_unit.adjusted_money_value : adjusted_value | location.country : internet_tld, languages_spoken, administrative_divisions | type.object : type | location.location : containedby, contains, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | measurement_unit.dated_money_value : amount | measurement_unit.dated_percentage : rate | kg.object_profile : prominent_type | location.religion_percentage : religion | film.actor : film | film.performance : film\n\n\nquestion:\n\nWhich nation has a part time employment percent of 1.9 and is the country from which Nina Dobrev hails?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027nwk2 ns:people.person.nationality ?x .\n?x ns:location.statistical_region.part_time_employment_percent ?c .\n?c ns:measurement_unit.dated_percentage.rate \"1.9\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMaputo: m.0fqby | type.object : type | location.country : currency_used, administrative_divisions | kg.object_profile : prominent_type | location.location : time_zones, containedby | common.topic : notable_types | travel.tourist_attraction : near_travel_destination | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder\n\n\nquestion:\n\nThe country that contains Maputo uses what type of money?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0fqby .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mozambican metical"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nfrench republic: m.0f8l9c | Country: m.01mp | East Flanders: m.013v_g | location.location : people_born_here, events, contains, partially_contains | location.country : currency_formerly_used, currency_used, administrative_divisions, calling_code, official_language, form_of_government | type.object : name, type | measurement_unit.dated_percentage : rate | kg.object_profile : prominent_type | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | media_common.netflix_genre : titles\n\n\nquestion:\n\nWhat country that borders France contains East Flanders?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f8l9c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.013v_g .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belgium"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCoalition Provisional Authority: m.01dl9b | Nineveh: m.05fym | location.country : official_language, calling_code, languages_spoken, form_of_government | location.location : time_zones, events, contains, containedby | periodicals.newspaper_circulation_area : newspapers | government.governmental_jurisdiction : government_bodies, government, governing_officials | government.government_position_held : basic_title, office_holder, from, governmental_body | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | common.topic : notable_types | government.political_appointer : appointees | type.object : type | organization.organization_founder : organizations_founded | book.book_subject : works\n\n\nquestion:\n\nWhere is Nineveh City, which is the location that appointed, Coalition Provisional Authority to a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05fym ns:location.location.containedby ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.01dl9b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iraq"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIranian rial: m.034n11 | people.person : religion, profession, nationality, place_of_birth, gender | location.country : currency_used, languages_spoken | time.event : start_date | location.location : contains, containedby | government.government_office_category : officeholders | government.government_position_held : basic_title, office_holder, from | biology.animal_breed : place_of_origin | language.human_language : language_family, main_country, countries_spoken_in | type.object : name, type | music.artist : genre | time.time_zone : locations_in_this_time_zone | base.culturalevent.event : entity_involved | military.military_person : participated_in_conflicts | government.politician : government_positions_held | organization.organization : founders | government.form_of_government : countries | people.deceased_person : cause_of_death, place_of_death | architecture.structure : height_meters\n\n\nquestion:\n\nPeople from the country that uses the Iranian Rial currency speak what languages?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.034n11 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Azerbaijani language, Turkmen Language, Persian Language, Qashqa'i Language, Luri language, Kumzari Language, Assyrian Neo-Aramaic Language, Khalaj, Turkic Language, Mazanderani Language, Gilaki Language, Kurdish languages, Talysh language, Afshar language, Khorasani Turkish Language, Balochi language, Arabic Language, Pashto language, Armenian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEnvi: m.03b_br1 | organization.organization_relationship : child, parent | type.object : type | sports.sports_team : sport | kg.object_profile : prominent_type | people.person : profession, height_meters, gender | location.location : containedby | organization.organization : leadership, date_founded, founders | organization.leadership : role | common.topic : notable_types | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | travel.tourist_attraction : near_travel_destination | education.educational_institution : school_type\n\n\nquestion:\n\nWho owned Envi in 2012?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.03b_br1 .\n?c ns:organization.organization.parent ?y .\n?y ns:organization.organization_relationship.parent ?x .\n?y ns:organization.organization_relationship.child ?c .\nEXISTS {?y ns:organization.organization_relationship.to ?sk1 .\nEXISTS {?y ns:organization.organization_relationship.from ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Federal government of the United States, Government of Canada, Voluntary Employee Beneficiary Association, Fiat Chrysler Automobiles, Fiat S.p.A."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Bride with White Hair: m.0jkvl5n | tv.tv_location : tv_shows_filmed_here | type.object : type | location.location : containedby | location.country : currency_used | common.topic : notable_types | people.person : gender | architecture.structure : opened, height_meters | media_common.netflix_title : netflix_genres | tv.tv_program : number_of_episodes, episode_running_time | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat is the form of currency where \"The Bride with White Hair\" show was filmed?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:tv.tv_location.tv_shows_filmed_here ns:m.0jkvl5n .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Renminbi"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Russia: m.01ptxd | location.location : area, contains, containedby | aviation.airport : serves | common.topic : notable_types | symbols.namesake : named_after | type.object : type | kg.object_profile : prominent_type | government.politician : government_positions_held | government.government_position_held : jurisdiction_of_office | architecture.structure : opened | education.educational_institution : school_type\n\n\nquestion:\n\nIn which area do most of the people in the country with the National Anthem of Russia live?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01ptxd .\n?c ns:location.location.contains ?x .\n?x ns:topic_server.population_number ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Central Federal District"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIranian rial: m.034n11 | type.object : name, type | government.governmental_body : members | government.government_position_held : basic_title, office_holder, from, jurisdiction_of_office | government.politician : government_positions_held | language.human_language : language_family, main_country, countries_spoken_in | people.person : religion, profession, nationality, parents, date_of_birth, place_of_birth, gender | government.government_office_category : officeholders | location.country : currency_used, languages_spoken | government.government_office_or_title : office_holders | kg.object_profile : prominent_type | finance.currency : countries_used | film.film : country | common.topic : notable_types | people.deceased_person : cause_of_death | location.location : contains, containedby | government.form_of_government : countries | geography.river : cities\n\n\nquestion:\n\nWhat language is spoken in the country where the currency is the Iranian Rial?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.034n11 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Azerbaijani language, Turkmen Language, Persian Language, Qashqa'i Language, Luri language, Kumzari Language, Assyrian Neo-Aramaic Language, Khalaj, Turkic Language, Mazanderani Language, Gilaki Language, Kurdish languages, Talysh language, Afshar language, Khorasani Turkish Language, Balochi language, Arabic Language, Pashto language, Armenian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Zola Levitt Presents: m.07chkxq | Egypt: m.02k54 | location.location : adjoin_s, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.adjoining_relationship : adjoins | location.country : second_level_divisions, administrative_divisions, form_of_government | location.statistical_region : co2_emissions_per_capita | kg.object_profile : prominent_type | type.object : name | tv.tv_location : tv_shows_filmed_here | common.topic : notable_types\n\n\nquestion:\n\nWhich country near Egypt was \"Zola Levitt Presents\" filmed in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02k54 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:tv.tv_location.tv_shows_filmed_here ns:m.07chkxq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Israel"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCoalition Provisional Authority: m.01dl9b | Gulf War: m.018w0j | type.object : type | base.culturalevent.event : entity_involved | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : office_holder, basic_title, jurisdiction_of_office, to, governmental_body | location.country : iso_alpha_3, iso3166_1_alpha2, languages_spoken, form_of_government | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | time.event : locations | location.location : containedby, events, contains, people_born_here | military.military_conflict : casualties, combatants | military.military_combatant_group : combatants | government.political_appointer : appointees | periodicals.newspaper_circulation_area : newspapers | military.casualties : lower_estimate | common.topic : notable_types\n\n\nquestion:\n\nWhere was the first Gulf War fought that appointed the Coalition Provisional Authority?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.018w0j ns:time.event.locations ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.01dl9b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iraq"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWilliam DeWitt, Jr.: m.05qblx | sports.professional_sports_team : owner_s | government.politician : government_positions_held | government.government_position_held : jurisdiction_of_office, legislative_sessions, from, governmental_body | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | kg.object_profile : prominent_type | common.topic : notable_types | royalty.monarch : kingdom | people.deceased_person : cause_of_death, date_of_death, place_of_death | location.location : containedby\n\n\nquestion:\n\nWho is the owner of the sports team that William DeWitt, Jr. coaches?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.05qblx .\n?c ns:baseball.baseball_team.current_coaches ?y .\n?y ns:baseball.current_coaching_tenure.baseball_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Joe Pettini, Marty Mason, Hal McRae, Dave Duncan, José Oquendo, Dave McKay"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational League Rookie of the Year: m.04yny9t | Fort Osage High School: m.0bvjtn | people.person : education, nationality, place_of_birth, gender | sports.pro_athlete : teams | sports.sports_team_roster : team | type.object : type | sports.sports_award_winner : awards | award.award_nominee : award_nominations | common.topic : notable_types | sports.sports_award : season, award | education.educational_institution : school_type, students_graduates, colors | education.education : institution, student | baseball.baseball_player : position_s\n\n\nquestion:\n\nWhat was the rookie season of the person who attended Fort Osage High School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0bvjtn .\n?c ns:sports.sports_award_winner.awards ?y .\n?y ns:sports.sports_award.season ?x .\n?y ns:sports.sports_award.award ns:m.04yny9t .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2001 Major League Baseball Season"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRyan Gosling: m.03m6_z | people.person : profession, nationality, languages, height_meters, place_of_birth, gender | film.actor : film | film.performance : character, actor, film | film.film : language, starring, directed_by, initial_release_date | type.object : type | film.producer : films_executive_produced | tv.tv_series_episode : episode_number, season_number | music.artist : genre | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat movie was Ryan Gosling in that is a TV series with 0 seasons?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03m6_z ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:tv.tv_series_episode.season_number \"0\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Drunk History Christmas - Feat. Ryan Gosling, Jim Carrey & Eva Mendes"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nchicago, illinois: m.01_d4 | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | type.object : type | location.location : contains, containedby | government.politician : government_positions_held | american_football.football_player : position_s | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.government_position_held : from, jurisdiction_of_office | people.deceased_person : cause_of_death, place_of_death | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : opened | travel.travel_destination : tourist_attractions | fictional_universe.fictional_character : gender\n\n\nquestion:\n\nWhich museum that was founded before 1893-09-16 is a good place to visit in downtown Chicago?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.containedby ns:m.01_d4 .\n?x ns:architecture.museum.established ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Art Institute of Chicago"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Cardiff: m.01s3v | United Kingdom: m.07ssc | location.location : events, adjoin_s, time_zones, people_born_here, contains | people.person : profession, nationality, place_of_birth, gender | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, governmental_body | people.deceased_person : date_of_death, place_of_death | time.time_zone : locations_in_this_time_zone | government.politician : government_positions_held | type.object : name, type | common.topic : notable_types | award.award_nominee : award_nominations | award.award_nomination : award | location.administrative_division : country | location.adjoining_relationship : adjoins | location.country : capital\n\n\nquestion:\n\nCardiff is capital of what country from the United Kingdom?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.01s3v .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wales"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nB.U. Exposure: m.03c3zb3 | Martin Luther King, Jr.: m.051cc | influence.influence_node : influenced_by, influenced | type.object : type | symbols.name_source : namesakes | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | people.person : quotations, children, profession, nationality, parents, ethnicity, education, place_of_birth | education.education : institution, student, major_field_of_study, degree | symbols.namesake : named_after | education.educational_institution : school_type, newspaper, students_graduates | common.topic : image | base.activism.activist : area_of_activism | award.award_nominee : award_nominations | award.award_nomination : nominated_for | fictional_universe.person_in_fiction : representations_in_fiction | organization.organization : date_founded | kg.object_profile : prominent_type | film.film_subject : films | music.featured_artist : recordings | people.deceased_person : place_of_burial | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : event\n\n\nquestion:\n\nWhat college did Martin Luther King Jr attend that publishes B.U. Exposure?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.051cc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.newspaper ns:m.03c3zb3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston University"
    }
]