[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPerspective: m.021hz5 | time.event : includes_event, included_in_event | people.ethnicity : includes_groups | type.object : type | organization.organization_founder : organizations_founded | location.location : containedby, contains, people_born_here | influence.influence_node : influenced_by | kg.object_profile : prominent_type | organization.organization : founders | common.topic : notable_types | government.form_of_government : countries | music.artist : genre | people.person : religion, profession, nationality, height_meters, gender | location.country : administrative_divisions | base.culturalevent.event : entity_involved | government.politician : government_positions_held | government.government_position_held : office_holder, jurisdiction_of_office | people.deceased_person : cause_of_death, place_of_burial, place_of_death | religion.religion : founding_figures | government.government_office_or_title : office_holders | biology.animal_breed : place_of_origin | military.military_person : participated_in_conflicts | visual_art.visual_artist : art_forms | sports.sports_championship_event : championship | government.governmental_jurisdiction : governing_officials\n\n\nquestion:\n\nWho was influential in inspiring Perspective work as a field of study?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.major_field_of_study ns:m.021hz5 .\n?c ns:influence.influence_node.influenced_by ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Eugène Delacroix, Claude Monet, Jean-François Millet, Jozef Israëls, Anton Mauve, Paul Cézanne, Fernand Cormon, Rembrandt, Willem Roelofs, Peter Paul Rubens"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMopti Region: m.042x2c | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, containedby | common.topic : notable_types | location.country : administrative_divisions, form_of_government | type.object : type | architecture.structure : height_meters | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nWhich system of government did the country that included the Mopti Region empire, utilize?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.042x2c .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Semi-presidential system, Unitary state, Republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGoogle Cloud Platform: m.0105pbj4 | base.schemastaging.organization_extra : phone_number | location.location : containedby | type.object : type | organization.organization : date_founded, parent | common.topic : notable_types | kg.object_profile : prominent_type | government.governmental_body : members | government.government_position_held : office_holder | organization.organization_relationship : parent | sports.sports_team : roster | sports.sports_team_roster : position | education.educational_institution : sports_teams, students_graduates, colors, school_type | education.education : student | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nWhat are all the things that Google Cloud Platform has?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.0105pbj4 .\n?c ns:base.schemastaging.organization_extra.phone_number ?y .\n?y ns:base.schemastaging.phone_sandbox.product_or_service ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Google Apps for Business, Google Chrome, Google AdWords, Google Maps Engine, Google Earth Enterprise, Google Maps API for Business"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHank Baskett: m.0d81yf | Fly, Eagles Fly: m.0c7r_z | people.person : ethnicity, profession, nationality, gender | type.object : type | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, fight_song, championships, roster | kg.object_profile : prominent_type | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start, career_end | sports.sports_team_roster : player, team, position | organization.organization : leadership, founders | award.award_nominee : award_nominations | award.award_nomination : award | organization.leadership : person | common.topic : notable_types | sports.professional_sports_team : owner_s | american_football.football_team : current_head_coach | business.employer : employees\n\n\nquestion:\n\nWhat team with the fight song Fly, Eagles Fly had Hank Baskett in 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.fight_song ns:m.0c7r_z .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Philadelphia Eagles"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Country: m.01mp | location.location : partially_containedby, contains, people_born_here | location.statistical_region : population, net_migration, gdp_real | measurement_unit.adjusted_money_value : adjusted_value | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | sports.sports_team_location : teams | common.topic : notable_types | type.object : name | measurement_unit.dated_integer : number | media_common.netflix_genre : titles | location.country : official_language, currency_used, second_level_divisions\n\n\nquestion:\n\nWhat country that once had a GDP real adjusted value of 103696598044.0 borders the U.S.?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.gdp_real ?c .\n?c ns:measurement_unit.adjusted_money_value.adjusted_value \"103696598044.0\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLincoln College The Lincoln Imp: m.0115jjvn | Theodore Lesieg: m.02g3w | book.author : works_written | people.person : education, profession, nationality, place_of_birth | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | kg.object_profile : prominent_type | type.object : type | award.award_nominee : award_nominations | award.award_nomination : nominated_for | common.topic : notable_types | film.film_story_contributor : film_story_credits | education.educational_institution : mascot | people.deceased_person : place_of_death | book.illustrator : books_illustrated | education.education : institution | music.lyricist : lyrics_written | film.film_subject : films\n\n\nquestion:\n\nWhat college has the Lincoln Imp as a mascot and had Dr Seuss as an alumni?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02g3w ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.mascot ns:m.0115jjvn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lincoln College, Oxford"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGreenwich Mean Time Zone: m.03bdv | HSBC: m.01vq1f | type.object : name, type | location.location : time_zones, containedby | sports.sports_team : sport, colors | kg.object_profile : prominent_type | location.mailing_address : citytown | education.educational_institution : school_type, colors | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, jurisdiction_of_office | common.topic : notable_types | organization.organization : headquarters, date_founded | sports.school_sports_team : school | people.deceased_person : place_of_death | symbols.namesake : named_after | government.governmental_body : members | government.political_appointer : appointees\n\n\nquestion:\n\nWhat European Union country within the Greenwich Mean Time Zone is home to the HSBC Bank head office?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01vq1f ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n?x ns:location.location.time_zones ns:m.03bdv .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "London"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTom Garfinkel: m.0j7mk90 | government.politician : government_positions_held, party | government.government_position_held : basic_title, to | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | type.object : type | sports.sports_team : roster | film.film : release_date_s, initial_release_date | film.film_regional_release_date : release_date | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : cause_of_death, date_of_death, place_of_death | architecture.structure : height_meters | government.political_party_tenure : party | american_football.football_player : position_s\n\n\nquestion:\n\nWho is number 22 in Tom Garfinkel's organization?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0j7mk90 .\n?c ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.number ?sk0 .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk2 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jamar Taylor"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nher majesty the queen: m.0d1_f | Kevin Rudd: m.021l9k | government.government_office_category : officeholders | government.government_position_held : office_holder, to, jurisdiction_of_office, from | location.location : time_zones, contains, people_born_here | type.object : type | government.governmental_jurisdiction : governing_officials | government.politician : government_positions_held | location.country : administrative_divisions | religion.religion : beliefs, places_of_worship | government.political_appointer : appointees\n\n\nquestion:\n\nWhat country over which Queen Elizabeth II reigns is the location in which Kevin Rudd was appointed to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d1_f ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.jurisdiction_of_office ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.021l9k .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Australia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nitalian: m.02bjrlw | location.location : events, adjoin_s, partially_contains, contains, containedby | location.country : internet_tld, administrative_divisions | language.human_language : countries_spoken_in | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | type.object : type | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhich country where Dobrna is speaks Italian?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02bjrlw ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.administrative_divisions ns:g.11xgqbdrw .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Slovenia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2009 AFC Championship Game: m.0_gt_lv | type.object : type | common.topic : notable_types | sports.sports_team : arena_stadium, founded, colors, fight_song, team_mascot, venue, championships, roster | sports.sports_team_roster : player, position | sports.team_venue_relationship : venue, team | time.recurring_event : current_frequency, instances | sports.sports_facility : teams, home_venue_for | time.event : end_date | sports.sports_championship : events | american_football.football_team : historical_coaching_staff | american_football.football_historical_coach_position : coach | architecture.structure : opened | sports.sports_championship_event : championship | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat years did the champion of the 2009 AFC Championship Game win the superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gt_lv .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XL, Super Bowl XLIII, Super Bowl IX, Super Bowl X, Super Bowl XIII, Super Bowl XIV, 2011 AFC Championship Game, 2009 AFC Championship Game, 2006 AFC Championship Game, 1996 AFC Championship Game"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThai National Anthem: m.01b8l3 | common.topic : notable_types | language.human_language : main_country, countries_spoken_in | people.person : profession, nationality, gender | government.government_office_category : officeholders | government.government_position_held : office_holder, to, jurisdiction_of_office | government.government : government_for | sports.sports_team : venue | sports.team_venue_relationship : venue | location.location : contains, containedby | architecture.structure : opened, height_meters | type.object : type | government.politician : government_positions_held | base.culturalevent.event : entity_involved | kg.object_profile : prominent_type | location.country : currency_used | location.administrative_division : country | government.government_office_or_title : office_holders | film.film : initial_release_date | symbols.namesake : named_after | people.deceased_person : cause_of_death\n\n\nquestion:\n\nThe country with the Thai National Anthem uses what type of currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01b8l3 .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thai baht"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSociety of Jesus: m.04399 | sports.sports_team : arena_stadium, sport | type.object : type | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, governmental_body, district_represented | common.topic : notable_types | people.person : religion, profession, nationality, place_of_birth, gender | kg.object_profile : prominent_type | travel.travel_destination : tourist_attractions | sports.sports_team_owner : teams_owned | location.location : containedby | ice_hockey.hockey_team : captain | time.event : end_date | location.country : official_language | award.award_nominee : award_nominations | award.award_nomination : nominated_for | influence.influence_node : influenced_by, influenced | government.governmental_jurisdiction : governing_officials | religion.religion : texts | people.deceased_person : cause_of_death, place_of_death | organization.organization : date_founded | base.culturalevent.event : entity_involved\n\n\nquestion:\n\nWHat language is most often used the the religious group \"Society of Jesus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.04399 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Spanish Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Bride with White Hair: m.0jkvl5n | russian: m.06bnz | Country: m.01mp | type.object : name, type | location.location : partially_contains, adjoin_s, partially_containedby, contains, containedby | location.country : official_language, form_of_government | common.topic : notable_types | tv.tv_program : air_date_of_first_episode | government.governmental_jurisdiction : governing_officials | location.adjoining_relationship : adjoins | kg.object_profile : prominent_type | tv.tv_location : tv_shows_filmed_here\n\n\nquestion:\n\nWhat country close to Russia is where the TV show The Bridge with White Hair was filmed?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:tv.tv_location.tv_shows_filmed_here ns:m.0jkvl5n .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1917 World Series: m.04tg71 | sports.sports_championship : events | sports.sports_team : arena_stadium, colors, team_mascot, championships, roster | time.recurring_event : instances | kg.object_profile : prominent_type | type.object : type | sports.sports_team_roster : player | sports.sports_championship_event : champion, runner_up | sports.sports_facility : teams, home_venue_for | sports.team_venue_relationship : team | location.location : events | time.event : start_date, instance_of_recurring_event\n\n\nquestion:\n\nWhere does the champion of the 1917 World Series play their home games?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04tg71 .\n?c ns:sports.sports_team.arena_stadium ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Comiskey Park, U.S. Cellular Field"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHama: m.02kmjv | location.location : time_zones, contains, containedby | type.object : type | kg.object_profile : prominent_type | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | common.topic : notable_types | location.country : administrative_divisions | architecture.structure : height_meters | government.political_district : representatives | government.government_position_held : office_holder\n\n\nquestion:\n\nThe country that contains Hama is located in what continent?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02kmjv .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Asia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Pinkprint Tour: m.012fz8bs | award.award_category : date_established | type.object : type | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | music.genre : albums | music.artist : concert_tours | media_common.netflix_genre : titles | music.composition : composer | film.film_job : films_with_this_crew_job | film.film_crew_gig : crewmember | people.person : place_of_birth | music.composer : compositions | location.statistical_region : consumer_price_index | book.book_subject : works\n\n\nquestion:\n\nWhere is the birthplace of the artist whose concert tour was called The Pinkprint Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.012fz8bs .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Saint James, Trinidad and Tobago"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDennis: m.05_52vy | Tupac Shakur: m.07pzc | people.person : profession, nationality, education, places_lived, languages, gender | film.actor : film | people.deceased_person : cause_of_death, place_of_death | award.award_nominee : award_nominations | award.award_nomination : nominated_for | type.object : type | film.film : language, release_date_s, written_by, costume_design_by, genre, directed_by | music.artist : album, label, track | book.author : book_editions_published | film.performance : character, actor, film | award.award_nominated_work : award_nominations | music.composer : compositions | film.film_character : portrayed_in_films | education.education : institution | people.place_lived : location | film.film_regional_release_date : film_release_distribution_medium, release_date | kg.object_profile : prominent_type | music.featured_artist : recordings | music.lyricist : lyrics_written | music.producer : releases_produced | film.film_subject : films\n\n\nquestion:\n\nWhich movie did Tupac star in, where the film has a character with the name of Dennis?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07pzc ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.05_52vy .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nothing but Trouble"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl XLI: m.04k5qm | Hank Baskett: m.0d81yf | sports.sports_team : arena_stadium, founded, league, colors, team_mascot, location, sport, championships, roster | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.sports_team_roster : player, team, position | sports.professional_sports_team : draft_picks, owner_s | american_football.football_team : current_head_coach, division, historical_coaching_staff | people.person : gender, profession, nationality, ethnicity | type.object : type | american_football.football_historical_coach_position : coach | sports.pro_sports_played : sport, career_start, career_end | common.topic : image, notable_types | time.event : end_date, start_date, instance_of_recurring_event | sports.sports_league_participation : league | sports.sports_championship_event : championship, champion, runner_up | sports.sports_league_draft_pick : player | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat team won Super Bowl XLI and had Hank Baskett as a team member in 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.championships ns:m.04k5qm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Indianapolis Colts"
    }
]