[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThai National Anthem: m.01b8l3 | location.location : contains, containedby | type.object : type | architecture.structure : height_meters | architecture.building : floors | people.deceased_person : cause_of_death | kg.object_profile : prominent_type | film.film : featured_film_locations | finance.currency : countries_used | symbols.namesake : named_after | people.person : date_of_birth, profession, nationality, gender | location.statistical_region : places_exported_to | location.imports_and_exports : exported_to | location.country : currency_used, languages_spoken | government.politician : government_positions_held | government.government_position_held : office_holder, jurisdiction_of_office | geography.river : cities | language.human_language : main_country, countries_spoken_in | government.form_of_government : countries | time.event : included_in_event | biology.animal_breed : place_of_origin | travel.tourist_attraction : near_travel_destination | common.topic : notable_types | government.government_office_category : officeholders\n\n\nquestion:\n\nWhat is the currency in the nation where Thai National Anthem is used as the national anthem?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01b8l3 .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thai baht"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Shulchan Aruch: m.0134k1 | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : consumer_price_index, population | religion.religion : places_of_worship, texts | measurement_unit.dated_integer : number | common.topic : notable_types\n\n\nquestion:\n\nWhich religion has a large practicing population in the US and has Sulchan Aruch as a part of their text?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.texts ns:m.0134k1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHenry VIII of England: m.03p77 | virgin birth: m.012lvl | religion.religion : deities, places_of_worship, types_of_places_of_worship, organizations, texts, beliefs, founding_figures | people.person : religion, children, spouse_s, place_of_birth, gender | type.object : type | people.marriage : spouse, location_of_ceremony | common.topic : notable_types | people.deceased_person : date_of_burial, place_of_burial, place_of_death | music.composer : compositions | government.politician : government_positions_held\n\n\nquestion:\n\nWhich religion believes that Jesus was born of a Virgin and was also King Henry VIII's religion?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03p77 ns:people.person.religion ?x .\n?x ns:religion.religion.beliefs ns:m.012lvl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDe divina proportione: m.06pqb_7 | common.topic : notable_types | book.written_work : subjects, date_of_first_publication, author, copyright_date | visual_art.visual_artist : art_forms | book.book : genre | type.object : type | book.illustrator : books_illustrated | media_common.netflix_genre : titles\n\n\nquestion:\n\nWhich types of art were made by the person who illustrated the book De divina proportione?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:book.illustrator.books_illustrated ns:m.06pqb_7 .\n?c ns:visual_art.visual_artist.art_forms ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Drawing, Painting, Sculpture"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArmy Black Knights men's basketball: m.02qbl9j | Douglas MacArthur: m.0c_jc | people.person : quotations, profession, nationality, parents, ethnicity, height_meters, gender | education.educational_institution : mascot, sports_teams, students_graduates, colors | type.object : type | kg.object_profile : prominent_type | education.education : student | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | people.deceased_person : cause_of_death, place_of_death | film.film_subject : films | location.location : contains, containedby | sports.sports_team : sport, colors | organization.organization : date_founded, founders | basketball.basketball_team : head_coach | common.topic : notable_types | book.author : works_written | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | military.military_person : participated_in_conflicts | sports.school_sports_team : school | base.activism.activist : area_of_activism | fictional_universe.school_in_fiction : students_graduates\n\n\nquestion:\n\nWhat school did Douglas Macarthur go to where the sports team was called the Army Black Knights?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0c_jc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.02qbl9j .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United States Military Academy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1912 World Series: m.04tf98 | sports.sports_championship : events | location.location : time_zones, events | type.object : type | sports.sports_team : location, colors, championships | time.recurring_event : instances | sports.sports_championship_event : champion, runner_up | baseball.baseball_team : current_manager | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat other World Series won by the team that won the 1912 World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04tf98 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1903 World Series, 2007 World Series, 2004 World Series, 1918 World Series, 1912 World Series, 1916 World Series, 1915 World Series, 2013 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDr Fubalous: m.0k3br6q | Navajo people: m.08k5jg | location.location : people_born_here, contains, containedby | people.ethnicity : geographic_distribution, languages_spoken | government.political_district : representatives | government.governmental_jurisdiction : official_symbols, governing_officials | location.location_symbol_relationship : Kind_of_symbol | government.government_position_held : basic_title, office_holder, governmental_body | tv.tv_location : tv_shows_filmed_here | religion.religion : places_of_worship | location.us_state : capital | kg.object_profile : prominent_type | location.administrative_division : country\n\n\nquestion:\n\nWhat state does the Navajo Tribe live and was where the TV show Dr. Fubalous was filmed?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.08k5jg ns:people.ethnicity.geographic_distribution ?x .\n?x ns:tv.tv_location.tv_shows_filmed_here ns:m.0k3br6q .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Utah"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGavin Newsom: m.0264nv | government.politician : government_positions_held, party | government.government_position_held : office_holder, district_represented, basic_title, from, governmental_body | people.person : religion, profession, nationality, parents, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.political_party_tenure : party | type.object : type | travel.travel_destination : accommodation | kg.object_profile : prominent_type | location.location : containedby\n\n\nquestion:\n\nWhere are some places to stay at in the city where Gavin Newson is a government officer?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0264nv .\n?c ns:travel.travel_destination.accommodation ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "W San Francisco, Hostelling International, City Center, Palace Hotel, San Francisco, Clift"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArgentina: m.0jgd | Safed: m.01vtnc | location.location : containedby, events, adjoin_s, people_born_here, contains, partially_contains | type.object : type | religion.religion : places_of_worship, notable_figures, organizations, texts, sacred_sites, beliefs | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | media_common.netflix_genre : titles | location.adjoining_relationship : adjoins | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | religion.religious_leadership_jurisdiction : leader | religion.religious_organization_leadership : start_date | common.topic : image | biology.breed_origin : breeds_originating_here | location.country : currency_formerly_used, administrative_divisions, form_of_government | book.book_subject : works | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat region in Argentina that has the sacred site Safed?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jgd ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.sacred_sites ns:m.01vtnc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEmsley A. Laney High School: m.07qymj | people.person : profession, nationality, ethnicity, education, spouse_s, place_of_birth, gender | people.marriage : spouse, location_of_ceremony | type.object : type | education.educational_institution : school_type, students_graduates, colors | education.education : institution, student, major_field_of_study | film.actor : film | film.performance : film | business.sponsored_recipient : sponsorship | business.sponsorship : sponsored_by | sports.pro_athlete : teams, career_start, career_end | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : draft, school, team | organization.organization : date_founded | sports.sports_team_roster : team | film.film_subject : films | education.school : nces_school_id | sports.sports_team_owner : teams_owned | basketball.basketball_player : position_s | kg.object_profile : prominent_type | common.topic : notable_types\n\n\nquestion:\n\nWhat school did the famous person who went to Emsle A. Laney High School attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.07qymj .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Emsley A. Laney High School, University of North Carolina at Chapel Hill"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAjdovščina: m.01chh0 | italian: m.02bjrlw | location.location : area, events, time_zones, people_born_here, contains, partially_contains | type.object : type | location.country : currency_used, administrative_divisions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, governmental_body | organization.organization_member : member_of | organization.organization_membership : organization | language.human_language : main_country, countries_spoken_in\n\n\nquestion:\n\nWhat Italian speaking country has AjdovÅ¡Äina?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02bjrlw ns:language.human_language.main_country ?x .\n?x ns:location.country.administrative_divisions ns:m.01chh0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Slovenia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | James Franco: m.05bnp0 | The Yale Herald: m.0544pz | film.actor : film | film.performance : film | type.object : type | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | location.location : containedby | organization.organization : child, headquarters, leadership, date_founded | organization.leadership : person | education.educational_institution : school_type, colors, newspaper, sports_teams, students_graduates | people.person : education, languages | kg.object_profile : prominent_type | education.education : institution, student | medicine.cancer_center_constituent : cancer_center | film.director : film | fictional_universe.school_in_fiction : students_graduates | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | common.topic : notable_types | periodicals.newspaper_circulation_area : newspapers | organization.organization_relationship : child\n\n\nquestion:\n\nThe Yale Herald is the school paper of which university attended by James Franco?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05bnp0 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.newspaper ns:m.0544pz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University Yale"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTrelawny Parish: m.06qrc3 | type.object : type | location.location : time_zones, people_born_here, containedby | kg.object_profile : prominent_type | common.topic : notable_types | location.country : currency_used, administrative_divisions | architecture.structure : height_meters | architecture.building : floors\n\n\nquestion:\n\nWhat currency does the country with Trelawny Parish use?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.06qrc3 .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jamaican dollar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTegucigalpa: m.0ftld | common.topic : notable_types | type.object : type | location.location : time_zones, area, contains, containedby | kg.object_profile : prominent_type | architecture.structure : opened, height_meters, construction_started | location.country : capital | architecture.building : floors\n\n\nquestion:\n\nWhere in the world is the country with the capital of Tegucigalpa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0ftld .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Central America, Latin America, North America, Americas"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBurmese kyat: m.04r7gc | Burmese cat: m.01mvkt | biology.breed_origin : breeds_originating_here | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : office_holder | location.location : partially_contains, events, contains, containedby | location.country : currency_used, capital | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | biology.animal_breed : place_of_origin | meteorology.cyclone_affected_area : cyclones | type.object : type | finance.currency : countries_used\n\n\nquestion:\n\nWhat is the country that uses the Burmese kyat as its currency and is also the place of origin of Burmese cats?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01mvkt ns:biology.animal_breed.place_of_origin ?x .\n?x ns:location.country.currency_used ns:m.04r7gc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Myanmar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRick Carlisle: m.02zxw4 | Tyson Chandler: m.05j8c8 | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | basketball.basketball_team : head_coach | location.statistical_region : population | measurement_unit.dated_integer : number | people.person : profession | sports.sports_team : roster | sports.sports_team_roster : player\n\n\nquestion:\n\nWhich basketball team has head coach Rick Carlisle and Tyson Chandler played for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05j8c8 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:basketball.basketball_team.head_coach ns:m.02zxw4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dallas Mavericks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJeanie Buss: m.0r4zj_6 | people.person : profession, nationality, height_meters, place_of_birth, gender | sports.sports_team : championships | common.topic : notable_types | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : cause_of_death, date_of_death | education.educational_institution : colors | kg.object_profile : prominent_type | american_football.football_player : position_s | film.film : release_date_s | film.film_regional_release_date : release_date | government.politician : government_positions_held | government.government_position_held : from, to | architecture.structure : opened | visual_art.visual_artist : art_forms\n\n\nquestion:\n\nWhat year did the team led by Jeanie Buss win the championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0r4zj_6 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2009 NBA Finals, 1980 NBA Finals, 2002 NBA Finals, 2000 NBA Finals, 2001 NBA Finals, 1988 NBA Finals, 1987 NBA Finals, 1985 NBA Finals, 1982 NBA Finals, 2010 NBA Finals, 1972 NBA Finals, 1954 NBA Finals, 1953 NBA Finals, 1952 NBA Finals, 1950 NBA Finals, 1949 BAA Finals, 1948 NBL Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nShaquille O'Neal: m.012xdf | Brad Stevens: m.02qwvmq | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : population | measurement_unit.dated_integer : number | basketball.basketball_team : head_coach | people.person : gender | type.object : type | sports.sports_team : roster | sports.sports_team_roster : player\n\n\nquestion:\n\nWhat team head coached by Brad Stevens did Shaq play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:basketball.basketball_team.head_coach ns:m.02qwvmq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Boston Celtics"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBody Of Water: m.01y2jks | Country: m.01mp | Ukrainian hryvnia: m.035qkb | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, from, jurisdiction_of_office | type.object : type | location.location : people_born_here, contains, containedby | people.person : profession, nationality, place_of_birth, gender | government.politician : government_positions_held | language.human_language : language_family, countries_spoken_in | common.topic : notable_types | government.form_of_government : countries | government.government_office_or_title : office_holders | time.event : includes_event | geography.river : discharge, cities | location.country : currency_used, form_of_government | government.government_office_category : officeholders | people.deceased_person : place_of_death | people.ethnicity : geographic_distribution | architecture.structure : height_meters | time.time_zone : locations_in_this_time_zone\n\n\nquestion:\n\nWhich countries and seas share a border with a country that uses Ukrainian hryvnia as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.035qkb .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n{ {?x ns:common.topic.notable_types ns:m.01mp .} UNION {?x ns:common.topic.notable_types ns:m.01y2jks .} }\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belarus, Hungary, Moldova, Poland, Russia, Romania, Slovakia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nContinental Congress: m.09k5k | Mount Vernon: m.013v2f | travel.travel_destination : tourist_attractions | location.location : people_born_here, contains, containedby | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, governmental_body | government.politician : government_positions_held | type.object : type | government.government_office_category : officeholders | aviation.airport : serves | education.educational_institution : students_graduates | education.education : student | geography.river : mouth | kg.object_profile : prominent_type | people.person : religion, profession, nationality, place_of_birth, gender | travel.tourist_attraction : near_travel_destination | government.governmental_jurisdiction : governing_officials | architecture.architect : structures_designed | common.topic : notable_types | education.university : number_of_postgraduates | measurement_unit.dated_integer : number\n\n\nquestion:\n\nIn the Constitutional Convention, what role did the architect who designed Mount Vernon serve?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:architecture.architect.structures_designed ns:m.013v2f .\n?c ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.office_position_or_title ?x .\n?y ns:government.government_position_held.governmental_body ns:m.09k5k .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Delegate to the Continental Congress"
    }
]