[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRoman Catholic Archdiocese of San Francisco: m.01xgk0 | Madonna: m.01vs_v8 | people.person : religion, quotations, profession, nationality, education, gender | religion.religion : deities, places_of_worship, types_of_places_of_worship, organizations, texts, is_part_of, beliefs, founding_figures | film.actor : film | film.performance : film | music.group_member : instruments_played | kg.object_profile : prominent_type | type.object : type | film.writer : film | award.award_nominee : award_nominations | music.artist : genre, concert_tours | music.featured_artist : recordings | music.composer : compositions | education.education : institution | influence.influence_node : influenced | film.producer : film | common.topic : image | award.award_nomination : nominated_for\n\n\nquestion:\n\nWhat religious practiced includes Roman Catholic Archdiocese of San Francisco as a place of worship and includes Madonna as a follower?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01vs_v8 ns:people.person.religion ?x .\n?x ns:religion.religion.organizations ns:m.01xgk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPhiladelphia Eagles Swoop: m.0hn2n8h | Owner: m.02kbqmz | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, fight_song, championships, roster | type.object : type | sports.sports_team_roster : player, position | business.employment_tenure : company, person, title | people.person : employment_history, profession, nationality, place_of_birth, gender | common.topic : notable_types | fictional_universe.fictional_character : gender | film.producer : films_executive_produced | award.award_nominee : award_nominations | award.award_nomination : award | business.employer : employees | sports.professional_sports_team : owner_s | kg.object_profile : prominent_type | sports.sports_team_owner : teams_owned | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | organization.organization : leadership, founders | organization.leadership : person | american_football.football_team : current_head_coach\n\n\nquestion:\n\nWho owned the team with mascot named Philadelphia Eagles swoop?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.0hn2n8h .\n?c ns:business.employer.employees ?y .\n?y ns:business.employment_tenure.person ?x .\n?y ns:business.employment_tenure.title ns:m.02kbqmz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jeffrey Lurie"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTimmins High and Vocational School: m.0dynx8 | Marriage: m.04ztj | type.object : type | music.genre : albums | kg.object_profile : prominent_type | common.topic : notable_types | people.marriage : type_of_union, spouse | american_football.football_team : division | organization.organization : founders, date_founded, child, companies_acquired | organization.organization_relationship : child | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | travel.tourist_attraction : near_travel_destination | people.person : spouse_s | sports.sports_team : championships | location.location : containedby | business.acquisition : company_acquired | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | language.human_language : countries_spoken_in | media_common.netflix_genre : titles | automotive.company : make_s | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | baseball.baseball_team : current_manager | education.educational_institution : students_graduates | education.education : student | government.governmental_body : members\n\n\nquestion:\n\nWho is the husband of the person who attended Timmins High and Vocational School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0dynx8 .\n?c ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\nEXISTS {?y ns:people.marriage.from ?sk1 .\nEXISTS {?y ns:people.marriage.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Frederic Thiebaud"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | Oxford University RFC: m.02677jr | clinton: m.0157m | location.location : time_zones, nearby_airports, containedby | organization.organization : date_founded | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | base.activism.activist : area_of_activism | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | government.political_appointer : appointees | government.government_position_held : basic_title, from, office_position_or_title, to | education.educational_institution : students_graduates, sports_teams, newspaper | type.object : type | government.politician : government_positions_held, election_campaigns | book.author : book_editions_published | education.education : institution, student, degree | people.person : education, religion | common.topic : notable_types | sports.school_sports_team : school | kg.object_profile : prominent_type | influence.influence_node : influenced\n\n\nquestion:\n\nWhat college did President Clinton attend that has the sports team named Oxford University RFC?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0157m ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.sports_teams ns:m.02677jr .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Oxford"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArgentine National Anthem: m.01dlgn | people.person : religion, profession, nationality, date_of_birth, height_meters, gender | location.location : partially_containedby, contains, containedby | type.object : type | food.beer_country_region : beers_from_here | people.deceased_person : cause_of_death, place_of_death | language.human_language : countries_spoken_in | government.politician : government_positions_held | government.government_position_held : basic_title, from, appointed_by, jurisdiction_of_office | common.topic : notable_types | architecture.structure : opened, height_meters | geography.river : basin_countries | finance.currency : countries_used | base.schemastaging.phone_sandbox : service_location\n\n\nquestion:\n\nThe country with the national anthem Argentine National Anthem has what type of religions?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01dlgn .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Judaism, Protestantism, Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nbritish pound sterling: m.01nv4h | s. africa: m.0hzlz | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : basic_title, office_holder, appointed_by, governmental_body | location.statistical_region : size_of_armed_forces, places_exported_to | measurement_unit.dated_integer : number | location.location : contains, people_born_here | location.imports_and_exports : exported_to | finance.currency : countries_used | location.country : currency_used, calling_code, official_language, internet_tld, capital, languages_spoken, form_of_government | film.film_location : featured_in_films | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat country bordering South Africa uses the Pound sterling as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hzlz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:location.country.currency_used ns:m.01nv4h .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Zimbabwe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDominican peso: m.04lt7_ | President: m.060c4 | people.person : religion, nationality, education, place_of_birth, gender | education.education : institution | common.topic : notable_types | government.government_position_held : basic_title, office_holder, office_position_or_title, jurisdiction_of_office | government.governmental_jurisdiction : governing_officials | award.award_nominee : award_nominations | government.government_office_category : officeholders | travel.tourist_attraction : near_travel_destination | type.object : type | location.location : containedby, people_born_here | government.government_office_or_title : office_holders | time.time_zone : locations_in_this_time_zone | people.deceased_person : place_of_death | government.politician : government_positions_held | finance.currency : countries_used | location.country : currency_used\n\n\nquestion:\n\nAs of the year 2010, who leads the nation which uses the Dominican Peso as currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.04lt7_ .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leonel Fernández"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTollcross Primary School: m.0266_18 | type.object : type | location.location : containedby | film.actor : film | film.performance : film | sports.sports_team : sport, colors, championships | kg.object_profile : prominent_type | organization.organization : place_founded, leadership, date_founded, parent | government.governmental_body : members | government.government_position_held : office_holder | education.educational_institution : school_type, students_graduates | education.education : student | common.topic : notable_types | organization.leadership : person | film.film : language | government.government_office_or_title : office_holders | aviation.airline : airports_served | aviation.airline_airport_presence : airport | organization.organization_relationship : parent\n\n\nquestion:\n\nWhat is the last movie that the famous person who went to Tollcross Primary School was in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0266_18 .\n?c ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.initial_release_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sir Billi"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDmitry Medvedev: m.08wdkk | people.person : religion, profession, nationality, parents, date_of_birth, height_meters, place_of_birth, gender | type.object : type | common.topic : notable_types | people.deceased_person : cause_of_death, place_of_death | government.politician : government_positions_held, party | government.government_position_held : legislative_sessions, from, governmental_body | film.actor : film | film.performance : character | kg.object_profile : prominent_type | government.political_party_tenure : party | american_football.football_player : position_s | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport\n\n\nquestion:\n\nThe location that appointed Dmitry Medvedev to govermental position is in which continent?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.08wdkk .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Europe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKim Kardashian: m.0261x8t | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : consumer_price_index, co2_emissions_per_capita | sports.pro_athlete : teams, career_start | sports.sports_team_roster : team | film.film_subject : films | location.country : administrative_divisions | people.person : profession\n\n\nquestion:\n\nWhat pro athlete started his career in 2005 and dated Kim Kardashian?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0261x8t ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n?x ns:sports.pro_athlete.career_start \"2005\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Reggie Bush"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nchicago, illinois: m.01_d4 | location.location : time_zones, contains, nearby_airports, people_born_here | type.object : type | travel.travel_destination : tourist_attractions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | zoos.zoo : opened | location.place_with_neighborhoods : neighborhoods\n\n\nquestion:\n\nWhich zoo in Chicago opened in 1868?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened \"1868\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lincoln Park Zoo"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMalaria: m.0542n | film.film_subject : films | military.military_commander : military_commands | military.military_command : military_conflict | people.person : religion, profession, nationality, parents, place_of_birth, gender | government.political_appointer : appointees | government.government_position_held : district_represented, from, jurisdiction_of_office, appointed_by, to | symbols.name_source : namesakes | government.politician : government_positions_held | military.military_person : participated_in_conflicts | people.deceased_person : place_of_burial, cause_of_death | kg.object_profile : prominent_type | type.object : type | medicine.notable_person_with_medical_condition : condition | architecture.architect : structures_designed | common.topic : notable_types\n\n\nquestion:\n\nWhat illnesses can person with notable malaria condition suffer from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:medicine.notable_person_with_medical_condition.condition ns:m.0542n .\n?c ns:medicine.notable_person_with_medical_condition.condition ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Malaria, Smallpox, Tuberculosis"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVirginia: m.07z1m | United States Senate: m.07t58 | people.person : profession, nationality, gender | government.political_district : representatives | government.politician : government_positions_held | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | type.object : type | military.military_person : participated_in_conflicts | government.governmental_jurisdiction : governing_officials | location.location : people_born_here, partially_contains | government.government_office_category : officeholders\n\n\nquestion:\n\nWho held his governmental position from January 14, 2006 and was senator of Virginia in 2013?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07z1m ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.governmental_body ns:m.07t58 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"2006-01-14\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tim Kaine"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArdabil Province: m.029mt3 | location.country : administrative_divisions, languages_spoken | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | travel.tourist_attraction : near_travel_destination | location.location : time_zones, containedby | government.politician : government_positions_held | government.government_position_held : to\n\n\nquestion:\n\nWhich language is spoken in the country that includes, the Ardabil Province?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.029mt3 .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Azerbaijani language, Turkmen Language, Persian Language, Qashqa'i Language, Luri language, Kumzari Language, Assyrian Neo-Aramaic Language, Khalaj, Turkic Language, Mazanderani Language, Gilaki Language, Kurdish languages, Talysh language, Afshar language, Khorasani Turkish Language, Balochi language, Arabic Language, Pashto language, Armenian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAfghan afghani: m.019vxc | United Kingdom: m.07ssc | location.country : official_language, currency_used, second_level_divisions, administrative_divisions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : co2_emissions_per_capita, religions | location.religion_percentage : religion | media_common.netflix_genre : titles | location.location : contains, people_born_here | finance.currency : countries_used | type.object : type\n\n\nquestion:\n\nWhere does the UK import from that uses the Aghan afghani as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n?x ns:location.country.currency_used ns:m.019vxc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Afghanistan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDe divina proportione: m.06pqb_7 | common.topic : notable_types | book.written_work : subjects, date_of_first_publication, author | book.book : genre | book.illustrator : books_illustrated | people.person : place_of_birth | location.location : contains | type.object : type\n\n\nquestion:\n\nWhich city was home to the illustrator known for the book De Divina?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:book.illustrator.books_illustrated ns:m.06pqb_7 .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Vinci"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDominican peso: m.04lt7_ | Hurricane Irene: m.02p70bg | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.location : containedby, contains, people_born_here | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.country : currency_used, national_anthem, official_language, second_level_divisions, languages_spoken | finance.currency : countries_used | government.national_anthem_of_a_country : anthem | meteorology.tropical_cyclone : affected_areas\n\n\nquestion:\n\nWhere did hurricane Irene hit that uses the Dominican peso?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02p70bg ns:meteorology.tropical_cyclone.affected_areas ?x .\n?x ns:location.country.currency_used ns:m.04lt7_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican Republic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nmt everest: m.0blbd | Gansu: m.013y46 | location.country : administrative_divisions | location.location : partially_containedby, contains | geography.geographical_feature : category | organization.organization_member : member_of | organization.organization_membership : organization\n\n\nquestion:\n\nWhat is the country where Gansu and Mount Everest are located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0blbd ns:location.location.partially_containedby ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:location.country.administrative_divisions ns:m.013y46 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNoelani Elementary School: m.0265r_n | type.object : type | kg.object_profile : prominent_type | location.location : containedby | government.government_office_or_title : office_holders | people.person : profession, place_of_birth | organization.leadership : person | government.politician : government_positions_held | government.government_position_held : office_holder, from, appointed_by, to, governmental_body | common.topic : notable_types | sports.sports_team : sport, roster | sports.sports_team_roster : player | education.educational_institution : students_graduates | education.education : student | government.political_party : ideology | organization.organization : date_founded | government.governmental_body : members | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nThe person who attended the Noelani Elementary School education institution was born where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0265r_n .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Honolulu"
    }
]