[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAl Sharqia Governorate: m.02d5r_ | kg.object_profile : prominent_type | type.object : name, type | architecture.structure : height_meters | location.location : area, time_zones, people_born_here, contains, containedby | common.topic : notable_types | location.country : currency_used, administrative_divisions\n\n\nquestion:\n\nThe country with Al Sharqia Governorate in it used what currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02d5r_ .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Egyptian pound"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNassau Weekly: m.08zwhp | John Forbes Nash, Jr.: m.0pyqh | College/University: m.01y2hnl | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | type.object : type | education.educational_institution : mascot, school_type, colors, newspaper, sports_teams, students_graduates | people.person : education, profession, nationality | symbols.namesake : named_after | kg.object_profile : prominent_type | organization.organization : date_founded, founders | common.topic : notable_types | fictional_universe.school_in_fiction : students_graduates | film.film_subject : films | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | location.location : containedby | education.education : institution, student, degree | fictional_universe.person_in_fiction : representations_in_fiction\n\n\nquestion:\n\nWhat educational institution with the Nassau Weekly newspaper did John Nash go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0pyqh ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.newspaper ns:m.08zwhp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Princeton University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWest Africa Time Zone: m.0gsrsm | s. africa: m.0hzlz | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | location.location : time_zones, contains, containedby\n\n\nquestion:\n\nWhat country does South Africa trade with that is in the West Africa Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0hzlz ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.0hzlz ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.location.time_zones ns:m.0gsrsm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Angola"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBursa: m.0160d | location.location : area, time_zones, people_born_here, contains, containedby | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | location.administrative_division : country | organization.organization : date_founded | location.country : capital | architecture.structure : opened\n\n\nquestion:\n\nWhere is the country based with the capital of Bursa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0160d .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Near East"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2010 AFC Championship Game: m.0_gt_kr | Hank Baskett: m.0d81yf | people.person : gender, nationality, ethnicity | sports.sports_team : arena_stadium, founded, league, colors, location, team_mascot, sport, championships, roster | sports.sports_team_roster : player, team, position | time.event : end_date, start_date, locations, instance_of_recurring_event | american_football.football_team : historical_coaching_staff, current_head_coach, division | american_football.football_historical_coach_position : coach | type.object : type | sports.professional_sports_team : draft_picks, owner_s | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start, career_end | sports.sports_league_participation : league | sports.sports_championship_event : championship, champion, runner_up | award.award_nominee : award_nominations | award.award_nomination : award | kg.object_profile : prominent_type | common.topic : notable_types | sports.sports_league_draft_pick : player\n\n\nquestion:\n\nWhat team for which Hank Baskett played in 2010 is the team that won the 2010 AFC Championship game?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.championships ns:m.0_gt_kr .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Indianapolis Colts"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFrank McCourt: m.05w2rj | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | government.government_position_held : basic_title, district_represented | location.location : containedby | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | type.object : type | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.political_party_tenure : party | american_football.football_player : position_s | sports.sports_team : championships | military.military_person : participated_in_conflicts | architecture.structure : opened | common.topic : notable_types | film.producer : film | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nWhen did sports team owner Frank McCourt's team last win the Championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.05w2rj .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1988 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSergey Brin: m.0gjq6 | kg.object_profile : prominent_type | base.schemastaging.organization_extra : phone_number | people.person : profession, nationality, date_of_birth, height_meters, place_of_birth, gender | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.politician : government_positions_held, party | government.political_party_tenure : party | american_football.football_player : position_s | people.deceased_person : date_of_death | government.government_position_held : basic_title, office_position_or_title | base.culturalevent.event : entity_involved\n\n\nquestion:\n\nWhat organizational divisions are under the leadership of Sergey Brin?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0gjq6 .\n?c ns:base.schemastaging.organization_extra.phone_number ?y .\n?y ns:base.schemastaging.phone_sandbox.product_or_service ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Google Apps for Business, Google Chrome, Google AdWords, Google Maps Engine, Google Earth Enterprise, Google Maps API for Business"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJeff Corwin: m.03xsv3 | College/University: m.01y2hnl | UMass Minutemen football: m.0gls3pl | people.person : profession, nationality, education, height_meters, gender | education.education : institution, student | type.object : type | kg.object_profile : prominent_type | location.location : contains, containedby | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | education.educational_institution : mascot, school_type, colors, sports_teams, students_graduates | sports.sports_team : colors | organization.organization : date_founded | common.topic : notable_types | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | sports.school_sports_team : school | american_football.football_team : current_head_coach, division\n\n\nquestion:\n\nWhat educational institution that has a football sports team named UMass Minutemen did Jeff Corwin go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03xsv3 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.sports_teams ns:m.0gls3pl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Massachusetts Amherst"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nYavuz Sultan Selim Mosque: m.02wb7r4 | religion.religion : deities, places_of_worship | education.educational_institution : colors | type.object : type | kg.object_profile : prominent_type | travel.tourist_attraction : near_travel_destination | aviation.airport : serves | location.location : time_zones, contains, containedby | common.topic : notable_types | location.country : calling_code | people.person : profession, place_of_birth | architecture.structure : opened, height_meters | people.deceased_person : cause_of_death | film.actor : film | film.performance : character\n\n\nquestion:\n\nIn the place of worship Yavuz Sultan Selim Mosque, who are the deities of their religion?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.places_of_worship ns:m.02wb7r4 .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ramdev Pir, God, Allah"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaylor Lautner: m.07ldhs | film.film : produced_by, language, subjects, release_date_s, story_by, film_set_decoration_by, cinematography, written_by, music, production_companies, costume_design_by, film_series, initial_release_date, country, genre, prequel, starring | film.actor : film | film.performance : character, actor, film | film.film_regional_release_date : release_date | type.object : type | people.person : religion, profession, nationality, place_of_birth, gender | film.film_character : portrayed_in_films | common.topic : image | award.award_nominee : award_nominations | award.award_nomination : nominated_for | kg.object_profile : prominent_type | fictional_universe.fictional_character : character_created_by\n\n\nquestion:\n\nWhat movie starring Taylor Lautner that has a character named Kate?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:g.11h1t_mtf .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "The Twilight Saga: Breaking Dawn - Part 2"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMarty Maraschino: m.0h5nhpx | Betty Rizzo: m.0fqbs6 | location.location : events, contains, people_born_here | fictional_universe.fictional_character : gender | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film_genre : films_in_this_genre | film.film_character : portrayed_in_films | film.performance : character, actor, film | location.country : second_level_divisions | type.object : type | location.statistical_region : consumer_price_index, population | media_common.netflix_genre : titles | people.person : date_of_birth, profession | language.human_language : countries_spoken_in | film.actor : film | film.film : starring | measurement_unit.dated_integer : number\n\n\nquestion:\n\nIn the movie with a character named Marty Maraschino who played Betty Rizzo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0h5nhpx .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0fqbs6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Stockard Channing"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSacatepéquez Department: m.0146yb | type.object : type | location.location : time_zones, people_born_here, partially_containedby, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : opened, height_meters | location.country : currency_used, administrative_divisions | geography.river : basin_countries | symbols.namesake : named_after\n\n\nquestion:\n\nWhat is the type of money used where Sacatepequez Department is?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0146yb .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Guatemalan quetzal"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRooney family: m.03nrwfz | type.object : type | location.location : people_born_here, events, contains, containedby | kg.object_profile : prominent_type | sports.sports_championship_event : championship, champion, runner_up | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | time.event : end_date, start_date, locations, instance_of_recurring_event | book.book_subject : works | people.deceased_person : place_of_burial, place_of_death | american_football.football_player : position_s | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, to | architecture.venue : capacity | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : coach, to | award.award_category : date_established | people.person : religion, profession, nationality, parents, place_of_birth | american_football.football_team : historical_coaching_staff | common.topic : notable_types | sports.professional_sports_team : owner_s | film.film_subject : films | government.political_appointer : appointees | sports.sports_team_owner : teams_owned\n\n\nquestion:\n\nThe Rooney Family are the owners of the sports team which plays at what stadium?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.03nrwfz .\n?c ns:sports.sports_team.venue ?y .\n?y ns:sports.team_venue_relationship.venue ?x .\nEXISTS {?y ns:sports.team_venue_relationship.from ?sk1 .\nEXISTS {?y ns:sports.team_venue_relationship.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Heinz Field"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMontagu House, Bloomsbury: m.05flxs | type.object : type | architecture.structure : opened, height_meters | location.location : time_zones, people_born_here, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | architecture.architect : structures_designed | law.inventor : inventions\n\n\nquestion:\n\nWhat scientific invention did the architect that designed Montagu House Bloomsbury's made?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:architecture.architect.structures_designed ns:m.05flxs .\n?c ns:law.inventor.inventions ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Universal joint, Diaphragm, Balance wheel"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPrime Minister of Canada: m.060m4 | government.political_appointer : appointees | government.government_position_held : office_holder, to, from, governmental_body | government.government_office_or_title : office_holders | people.person : religion | government.politician : government_positions_held, party | government.political_party_tenure : party | type.object : type\n\n\nquestion:\n\nWho held his governmental position from September 14, 1976 and was the Canadian Prime Minister in 1993?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.060m4 ns:government.government_office_or_title.office_holders ?y .\n?y ns:government.government_position_held.office_holder ?x .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1976-09-14\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Jean Chrétien"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPhoenix: m.0d35y | United States Senator: m.02_7l8y | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title, governmental_body | location.hud_county_place : county | people.person : place_of_birth | government.government_office_or_title : office_holders | location.statistical_region : population, gdp_real | measurement_unit.dated_integer : number | government.politician : government_positions_held | law.litigant : party_to_cases | law.legal_case_party_relationship : case | location.country : second_level_divisions | measurement_unit.adjusted_money_value : adjusted_value\n\n\nquestion:\n\nWho were the state senators for the state with Phoenix as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.us_state.capital ns:m.0d35y .\n?c ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.02_7l8y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barry Goldwater, Jon Kyl, Jeff Flake, Carl Hayden, Ernest McFarland, Dennis DeConcini, Paul Fannin, Henry F. Ashurst, Marcus A. Smith, Ralph H. Cameron, John McCain"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe 1989 World Tour: m.0127xmfr | location.location : contains, people_born_here | music.artist : genre, concert_tours | media_common.netflix_genre : titles | music.genre : albums | film.film : production_companies, release_date_s | film.film_regional_release_date : film_release_distribution_medium, release_date | people.person : profession, height_meters | location.statistical_region : population | measurement_unit.dated_integer : number | kg.object_profile : prominent_type | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | music.composition : composer | education.educational_institution : students_graduates | education.education : student | film.film_genre : films_in_this_genre | time.event : start_date, locations | award.award_category : date_established | language.human_language : countries_spoken_in | book.book_subject : works\n\n\nquestion:\n\nWho all dated the artist that went on The 1989 World Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0127xmfr .\n?c ns:celebrities.celebrity.sexual_relationships ?y .\n?y ns:celebrities.romantic_relationship.celebrity ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Joe Jonas, Harry Styles"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFootball League Cup: m.012dbw | Tom Werner: m.07jrjb | common.topic : notable_types | type.object : type | architecture.building : floors | american_football.football_player : position_s | location.location : containedby | people.person : date_of_birth, religion, nationality, children | kg.object_profile : prominent_type | sports.sports_team : championships, roster | government.politician : government_positions_held | sports.professional_sports_team : draft_picks | sports.sports_league_draft_pick : player | organization.organization : date_founded, founders | sports.sports_championship_event : championship | government.government_position_held : office_holder, jurisdiction_of_office | education.educational_institution : school_type, sports_teams | exhibitions.exhibition_venue : exhibitions_at_this_venue | exhibitions.exhibition_run : opened_on | sports.sports_team_roster : position | government.governmental_body : members | award.award_winner : awards_won | award.award_honor : award | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | symbols.namesake : named_after | people.deceased_person : cause_of_death\n\n\nquestion:\n\nWhen did the organization who Tom Werner is a member of win the champion league?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.07jrjb .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.championship ns:m.012dbw .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2012 Football League Cup Final"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNordic countries: m.0140mf | Mariehamn: m.01nm5c | Country: m.01mp | location.location : containedby, events, contains, people_born_here | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | royalty.kingdom : rulers | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title, governmental_body | location.country : official_language, capital, second_level_divisions | common.topic : notable_types | type.object : name\n\n\nquestion:\n\nWhat Nordic Country has a capital called Mariehamn?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0140mf ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.01nm5c .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Åland Islands"
    }
]