[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMark Harmon: m.037gjc | Dulcie Warren: m.0h0_y2y | film.film : language, runtime, country, initial_release_date, genre, starring, directed_by | film.film_cut : runtime | people.person : profession, nationality, parents, languages, height_meters, place_of_birth, gender | type.object : type | tv.tv_actor : starring_roles | tv.regular_tv_appearance : series, actor | kg.object_profile : prominent_type | american_football.football_player : position_s | common.topic : notable_types | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | film.film_character : portrayed_in_films | film.performance : character, film | tv.tv_program : air_date_of_first_episode, regular_cast, episode_running_time\n\n\nquestion:\n\nIn the film with the character named Dulcie Warren, what TV series did Mark Harmon star in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.037gjc ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.0h0_y2y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "The Dream Merchants"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl VI: m.076n1 | Emmitt Smith: m.01480y | type.object : type | sports.sports_team : colors, team_mascot, venue, championships, roster | people.person : profession, nationality, ethnicity, height_meters, gender | award.award_nominee : award_nominations | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : career_start, career_end | kg.object_profile : prominent_type | sports.sports_team_roster : player, team, position | american_football.football_team : historical_coaching_staff, current_head_coach | american_football.football_historical_coach_position : coach | american_football.football_player : position_s | film.actor : film | film.performance : film | sports.sports_championship_event : championship, champion, runner_up | sports.professional_sports_team : owner_s | time.event : start_date, instance_of_recurring_event | common.topic : image, notable_types | sports.team_venue_relationship : venue | award.award_nomination : award\n\n\nquestion:\n\nWhat American Football Team starring Emmitt Smith also won the Super Bowl VI championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01480y ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.076n1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dallas Cowboys"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDenver: m.0zw3029 | Kid in Jump-Jump: m.0h2z5vt | location.location : partially_contains, contains, people_born_here | film.performance : character, actor, film | film.film_character : portrayed_in_films | people.person : gender, profession, nationality, ethnicity | type.object : type | film.film : starring, subjects | kg.object_profile : prominent_type | film.film_story_contributor : film_story_credits | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film_genre : films_in_this_genre | media_common.netflix_genre : titles | people.ethnicity : includes_groups | film.film_subject : films\n\n\nquestion:\n\nWho played Denver in the film that have a character named Kid in Jump-Jump?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0h2z5vt .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0zw3029 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jon Favreau filmography"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nState flower: m.04627gn | Bruce Babbitt: m.018mts | people.person : profession, place_of_birth, gender | location.location : time_zones, contains, containedby | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, office_position_or_title, jurisdiction_of_office, to | government.governmental_jurisdiction : official_symbols | people.deceased_person : cause_of_death, date_of_death | location.location_symbol_relationship : Kind_of_symbol | education.university : number_of_undergraduates | measurement_unit.dated_integer : number\n\n\nquestion:\n\nThe location that appointed Bruce Babbitt to a governmental position has which state flower?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.018mts .\n?c ns:government.governmental_jurisdiction.official_symbols ?y .\n?y ns:location.location_symbol_relationship.symbol ?x .\n?y ns:location.location_symbol_relationship.Kind_of_symbol ns:m.04627gn .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Saguaro"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMuhammad in Islam: m.04s9n | religion.religion : deities, notable_figures | government.politician : government_positions_held, party | government.political_party_tenure : party | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | influence.influence_node : influenced | people.deceased_person : date_of_death | government.government_position_held : to, jurisdiction_of_office | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start | type.object : type\n\n\nquestion:\n\nWhat do the people whose religions figure is Muhammad in Islam follow?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.notable_figures ns:m.04s9n .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ramdev Pir, God, Allah"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNina Dobrev: m.027nwk2 | Sofia: m.0ftjx | type.object : type | location.location : adjoin_s, time_zones, people_born_here, contains, partially_contains | location.statistical_region : population, consumer_price_index, gdp_real, long_term_unemployment_rate, size_of_armed_forces, co2_emissions_per_capita, merchandise_trade_percent_of_gdp, net_migration, gdp_growth_rate | measurement_unit.adjusted_money_value : adjusted_value | location.country : administrative_divisions, official_language, iso3166_1_alpha2, capital, form_of_government | measurement_unit.dated_integer : number | measurement_unit.dated_metric_ton : number | award.award_nominee : award_nominations | award.award_nomination : award | film.actor : film | film.performance : film | measurement_unit.dated_percentage : rate | people.person : languages, nationality | government.governmental_jurisdiction : government_bodies, governing_officials | location.administrative_division : country | government.government_position_held : office_holder | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhere is Nina Dobrev from that has a capital called Sofia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027nwk2 ns:people.person.nationality ?x .\n?x ns:location.country.capital ns:m.0ftjx .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nbangkok, thailand: m.0fn2g | amusement_parks.park : opened | type.object : type | architecture.structure : opened, height_meters | location.location : containedby | people.deceased_person : cause_of_death, place_of_death | common.topic : notable_types | royalty.monarch : kingdom | government.politician : government_positions_held | government.government_position_held : basic_title | kg.object_profile : prominent_type | people.person : religion, profession, place_of_birth | travel.tourist_attraction : near_travel_destination | film.film : country, initial_release_date | travel.travel_destination : tourist_attractions | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich zoo opened before 1940 and is a tourist attraction in Bangkok?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0fn2g ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dusit Zoo"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAli: m.024c1p | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title, from, jurisdiction_of_office | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | religion.religion : notable_figures, holidays | award.award_nominee : award_nominations | fictional_universe.fictional_character : gender | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat are religious holidays for the religion with Ali as its notable figure?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.notable_figures ns:m.024c1p .\n?c ns:religion.religion.holidays ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lailat al Mi'raj, Nuzul Al-Quran, Eid al-Fitr, Eid al-Adha, Day of Arafat, Day of Ashura, Mourning of Muharram, Laylat al-Qadr, Barat Night, Mawlid, Ramadan, Islamic New Year, Eid al-Fitr Eve, Eid-Ul-Adha Eve, Night of Wishes"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSanto Domingo: m.0fthl | President: m.060c4 | people.person : religion, profession, nationality, date_of_birth, gender | government.government_office_category : officeholders | government.government_position_held : basic_title, office_holder, office_position_or_title, jurisdiction_of_office | government.politician : government_positions_held | type.object : type | government.governmental_jurisdiction : governing_officials | government.political_appointer : appointees | location.location : contains | people.deceased_person : place_of_death | location.country : capital\n\n\nquestion:\n\nWho was the president in 2010 of the country with Santo Domingo as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0fthl .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leonel Fernández"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVancouver Canucks: m.0jnnx | film.film_location : featured_in_films | location.location : contains, people_born_here | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.sports_team_roster : player, team | type.object : type | sports.sports_championship_event : championship, runner_up | sports.sports_team_coach : teams_coached | sports.sports_team_coach_tenure : coach, team | sports.sports_team : team_mascot, roster, coaches | media_common.netflix_genre : titles | sports.pro_sports_played : sport | people.person : height_meters, nationality, gender | government.political_district : representatives | government.government_position_held : office_holder | organization.organization : leadership | organization.leadership : person | common.topic : notable_types | tv.tv_location : tv_shows_filmed_here | award.award_nominee : award_nominations | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nWho is the coach of Vancouver Canucks who started his pro athlete career the earliest?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jnnx ns:sports.sports_team.coaches ?y .\n?y ns:sports.sports_team_coach_tenure.coach ?x .\n?x ns:sports.pro_athlete.career_start ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "John Tortorella"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2004 presidential election: m.04qwhs | george bush: m.09b6zr | government.politician : government_positions_held, party | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.election : campaigns | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start | type.object : type | time.event : included_in_event | american_football.football_player : position_s | kg.object_profile : prominent_type | film.film : edited_by | government.government_position_held : to, from, jurisdiction_of_office | government.election_campaign : candidate | location.location : containedby | people.deceased_person : date_of_death | government.political_party_tenure : party\n\n\nquestion:\n\nWho did George W. Bush run against his second term that held his governmental position the earliest?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04qwhs ns:government.election.campaigns ?y .\n?y ns:government.election_campaign.candidate ?x .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "John Kerry"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBoston Celtics: m.0bwjj | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.sports_team_roster : to, team, position | people.person : height_meters, profession, nationality, gender | type.object : type | sports.pro_sports_played : sport, career_start | time.event : start_date | sports.sports_championship_event : championship, runner_up | basketball.basketball_player : position_s | people.deceased_person : date_of_death | kg.object_profile : prominent_type | sports.sports_facility : teams, home_venue_for | sports.team_venue_relationship : team | location.location : people_born_here\n\n\nquestion:\n\nWhat pro athlete started his career earliest and is on the current Boston Celtics' roster?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0bwjj ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.pro_athlete.career_start ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Gerald Wallace"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLiozna: m.0h28sb | common.topic : notable_types | type.object : type | architecture.structure : opened | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | visual_art.visual_artist : associated_periods_or_movements | architecture.building : floors\n\n\nquestion:\n\nThe person who once lived in Liozna did what type of paintings?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.0h28sb .\n?c ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Modern art, Fauvism, Surrealism, Cubism, Expressionism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBaltic Sea: m.01522 | Country: m.01mp | location.location : adjoin_s, contains, people_born_here | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : capital, second_level_divisions, administrative_divisions | location.statistical_region : population, size_of_armed_forces, consumer_price_index, cpi_inflation_rate | measurement_unit.dated_integer : number | measurement_unit.dated_percentage : rate | film.film_location : featured_in_films | location.adjoining_relationship : adjoins | type.object : name, type\n\n\nquestion:\n\nWhich country that once emitted 1961 per metric ton per capita Co2 border the Baltic Sea?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01522 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"1961\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sweden"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited/Reform Coalition: m.0h3xnz5 | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, office_position_or_title, jurisdiction_of_office, appointed_by, to | people.person : profession, nationality, place_of_birth, gender | type.object : type | kg.object_profile : prominent_type | language.human_language : main_country | time.event : start_date, included_in_event | common.topic : notable_types | people.deceased_person : date_of_death, place_of_death | sports.sports_team : location, colors | location.location : contains | film.film : country | government.government_office_category : officeholders\n\n\nquestion:\n\nWhich countries does the country that named United/Reform Coalition to a governmental role send exports?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0h3xnz5 .\n?c ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Japan, Kiribati, Tuvalu, United Kingdom, United States of America, Australia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDmitry Medvedev: m.08wdkk | people.person : religion, profession, nationality, parents, height_meters, place_of_birth, gender | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | government.politician : government_positions_held, party | government.government_position_held : governmental_body | government.political_party_tenure : party | music.group_member : instruments_played | people.deceased_person : place_of_death | baseball.baseball_player : position_s | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhere does the country that Dmity Medvedev was a government official import from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.08wdkk .\n?c ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Uzbekistan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRay: m.01ct0j | Persian Language: m.032f6 | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title, governmental_body | language.human_language : main_country, countries_spoken_in | location.country : capital, currency_used, languages_spoken, form_of_government | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | kg.object_profile : prominent_type | location.location : people_born_here, events, contains, containedby | biology.breed_origin : breeds_originating_here | media_common.netflix_genre : titles | type.object : type\n\n\nquestion:\n\nWhat country speaks Farsi and has a capital called Ray?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.032f6 ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.country.capital ns:m.01ct0j .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Seljuk Empire"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nT-Rac: m.09p_1v | sports.sports_championship_event : champion | people.person : profession | type.object : type | location.location : contains, nearby_airports, people_born_here | award.award_nominee : award_nominations | award.award_nomination : award | travel.travel_destination : tourist_attractions | film.film_subject : films | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | time.event : end_date, locations | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : governmental_body | sports.sports_league : teams | sports.sports_league_participation : team | location.citytown : postal_codes | american_football.football_team : current_head_coach | sports.sports_team : team_mascot\n\n\nquestion:\n\nWho is the head coach of the team with mascot named T-Rac?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.09p_1v .\n?c ns:american_football.football_team.current_head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ken Whisenhunt"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDrayton McLane, Jr.: m.0fmgq5 | Nolan Ryan: m.0hctb | location.location : contains, people_born_here | sports.pro_athlete : teams | sports.sports_team_roster : player, team | sports.professional_sports_team : owner_s | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | sports.sports_team_owner : teams_owned | sports.sports_team : roster | book.book_subject : works | location.statistical_region : cpi_inflation_rate, gdp_real | measurement_unit.dated_percentage : rate | measurement_unit.adjusted_money_value : adjusted_value\n\n\nquestion:\n\nWhat sports team owned by Drayton McLane, Jr. did Nolan Ryan play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hctb ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.professional_sports_team.owner_s ns:m.0fmgq5 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Houston Astros"
    }
]