[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRihanna: m.06mt91 | Christ Church Parish: m.058632 | music.artist : label, origin, track, genre, album | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.person : profession, height_meters | location.location : time_zones, containedby, contains, people_born_here | location.country : iso3166_1_alpha2, administrative_divisions, capital, languages_spoken | film.actor : film | film.performance : film | kg.object_profile : prominent_type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich nation that has Christ Church Parish located in it is the place where Rihanna hails from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mt91 ns:music.artist.origin ?x .\n?x ns:location.country.administrative_divisions ns:m.058632 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barbados"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | Margaret Hoover: m.03m6921 | Bi-Co News: m.02xh7kr | education.educational_institution : students_graduates, sports_teams, newspaper, colors | people.person : education, nationality, gender | education.education : institution, student | type.object : type | common.topic : notable_types | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | kg.object_profile : prominent_type | location.location : events, containedby | organization.organization : date_founded | fictional_universe.school_in_fiction : students_graduates\n\n\nquestion:\n\nWhat educational institution with the Bi-Co News newspaper did Margaret Hoover go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03m6921 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.newspaper ns:m.02xh7kr .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bryn Mawr College"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHIStory World Tour: m.09x1nf | media_common.netflix_genre : titles | language.human_language : countries_spoken_in | common.topic : notable_types | type.object : type | music.artist : genre, origin, concert_tours | award.award_category : date_established | people.person : date_of_birth, children, profession, religion | film.film : language, story_by, edited_by, featured_film_locations, initial_release_date, genre, starring | film.performance : actor, film | fictional_universe.fictional_character : occupation | music.composition : composer | music.genre : albums | kg.object_profile : prominent_type | film.film_character : portrayed_in_films | people.ethnicity : geographic_distribution | time.event : end_date | law.invention : inventor | influence.influence_node : influenced_by, influenced | film.film_job : films_with_this_crew_job | film.film_crew_gig : crewmember | film.producer : film\n\n\nquestion:\n\nWhere did the artist that went on History World Tour come from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.09x1nf .\n?c ns:music.artist.origin ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Gary"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Country: m.01mp | location.country : administrative_divisions, national_anthem, official_language, second_level_divisions, form_of_government | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | government.national_anthem_of_a_country : anthem | location.statistical_region : gdp_real | measurement_unit.adjusted_money_value : adjusted_value | type.object : name | government.political_district : representatives | common.topic : notable_types | film.film_location : featured_in_films\n\n\nquestion:\n\nWith a CPI inflation rate once of 0.59 percent, which country borders the US?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.cpi_inflation_rate ?c .\n?c ns:measurement_unit.dated_percentage.rate \"0.59\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPhillie Phanatic: m.035sw4 | Grover Cleveland Alexander: m.01zt27 | baseball.baseball_player : batting_stats, position_s | baseball.batting_statistics : team | sports.sports_team : arena_stadium, founded, colors, location, team_mascot, sport, championships, roster | sports.professional_sports_team : owner_s | sports.sports_team_roster : position | common.topic : notable_types | type.object : type | baseball.baseball_team : current_manager | people.person : nationality, gender | kg.object_profile : prominent_type | base.schemastaging.sports_team_extra : training_ground\n\n\nquestion:\n\nWhat team did Grover Cleveland Alxander play in that has the mascot named Philie Phanatic?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01zt27 ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.team ?x .\n?x ns:sports.sports_team.team_mascot ns:m.035sw4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Philadelphia Phillies"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl XLI: m.04k5qm | Hank Baskett: m.0d81yf | sports.sports_team : founded, league, colors, team_mascot, location, sport, championships, roster | kg.object_profile : prominent_type | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start, career_end | sports.sports_team_roster : player, team, position | type.object : type | people.person : ethnicity, profession, nationality, gender | american_football.football_team : historical_coaching_staff, current_head_coach, division | american_football.football_historical_coach_position : coach | sports.sports_championship_event : championship, champion, runner_up | time.event : end_date, instance_of_recurring_event | sports.sports_league_participation : league | common.topic : image, notable_types | sports.professional_sports_team : draft_picks, owner_s | sports.sports_league_draft_pick : player | award.award_nominee : award_nominations | award.award_nomination : award\n\n\nquestion:\n\nWhat team that won the Super Bowl XLI championship did Hank Baskett play for in 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d81yf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.championships ns:m.04k5qm .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Indianapolis Colts"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTaylor Lautner: m.07ldhs | film.film : language, produced_by, cinematography, release_date_s, runtime, music, production_companies, film_casting_director, country, gross_revenue, starring, prequel, genre, directed_by | film.performance : character, actor, film | award.award_nominee : award_nominations | award.award_nomination : nominated_for | film.film_regional_release_date : film_regional_debut_venue, release_date, film_release_distribution_medium | film.film_character : portrayed_in_films | people.person : profession | film.actor : film | type.object : type | film.film_cut : runtime | common.topic : image | measurement_unit.dated_money_value : currency | media_common.netflix_title : netflix_genres | fictional_universe.fictional_character : place_of_birth | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat films with a character named Jane did Taylor Lautner star in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ldhs ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:g.120n34qq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "The Twilight Saga: New Moon, Eclipse, The Twilight Saga: Breaking Dawn - Part 1, The Twilight Saga: Breaking Dawn - Part 2"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States Dollar: m.09nqf | Country: m.01mp | Central America: m.01tzh | location.location : containedby, adjoin_s, people_born_here, contains, partially_contains | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | common.topic : notable_types | measurement_unit.dated_integer : number | type.object : name, type | kg.object_profile : prominent_type | location.country : currency_used, administrative_divisions, form_of_government | measurement_unit.dated_percentage : rate | meteorology.cyclone_affected_area : cyclones | book.book_subject : works | location.adjoining_relationship : adjoins | finance.currency : countries_used\n\n\nquestion:\n\nWhich of the seven nations of Central America use the United States Dollar currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01tzh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.09nqf .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "El Salvador, Panama"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | Central America: m.01tzh | Alta Verapaz Department: m.0146np | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.location : people_born_here, events, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | food.beer_country_region : beers_from_here | location.country : capital, administrative_divisions | type.object : name, type | common.topic : notable_types\n\n\nquestion:\n\nWhich of the seven nations of Central America contains the Alta Verapaz Department?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01tzh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.administrative_divisions ns:m.0146np .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Guatemala"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSteelers Polka: m.0j_8yp9 | american_football.football_team : historical_coaching_staff | american_football.football_historical_coach_position : coach, to, from | sports.sports_championship_event : championship, champion, runner_up | sports.sports_team : fight_song, championships | american_football.football_coach : coaching_history | people.person : profession, nationality, ethnicity, date_of_birth, gender | type.object : type | common.topic : notable_types | people.deceased_person : place_of_burial, place_of_death | people.family : members | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | location.location : people_born_here, events, contains, containedby | american_football.football_player : position_s | time.event : end_date, locations | award.award_category : date_established\n\n\nquestion:\n\nWhat years did the team with fight song Steelers Polka win the Superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.0j_8yp9 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XL, Super Bowl XLIII, Super Bowl IX, Super Bowl X, Super Bowl XIII, Super Bowl XIV, 2011 AFC Championship Game, 2009 AFC Championship Game, 2006 AFC Championship Game, 1996 AFC Championship Game"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNicolas Sarkozy: m.02ps9k | type.object : type | people.person : religion, profession, nationality, ethnicity, height_meters, place_of_birth, gender | military.military_person : participated_in_conflicts | law.judge : courts | law.judicial_tenure : from_date | government.politician : government_positions_held, party | government.government_position_held : basic_title, office_position_or_title, from, governmental_body | location.country : currency_used | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : cause_of_death | kg.object_profile : prominent_type | government.political_party_tenure : party | american_football.football_player : position_s\n\n\nquestion:\n\nWhat currency is used in the country that has Nicolas Sarkozy as a government official?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.02ps9k .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "CFP franc, Euro"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nkurdistan region: m.0329by | language.human_language : iso_639_1_code, countries_spoken_in | location.country : official_language, calling_code, administrative_divisions, languages_spoken | government.form_of_government : countries | government.government_office_category : officeholders | government.government_position_held : office_holder, from | location.mailing_address : state_province_region | type.object : name | location.location : contains, containedby | government.politician : government_positions_held | people.person : profession | time.time_zone : locations_in_this_time_zone\n\n\nquestion:\n\nWhich language is used for verbal communication in the country in which Iraqi Kurdistan is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0329by .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkmen Language, Persian Language, South Azeri language, Assyrian Neo-Aramaic Language, Kurdish languages, Syriac language, Arabic Language, Armenian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRooney family: m.03nrwfz | type.object : type | american_football.football_player : position_s | organization.organization_founder : organizations_founded | sports.sports_championship_event : champion, runner_up | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | time.event : end_date, start_date, instance_of_recurring_event | sports.sports_team : arena_stadium, colors | people.person : height_meters, nationality, place_of_birth, gender | government.politician : government_positions_held | government.government_position_held : office_holder, from, to | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from, to | people.family : members | sports.sports_facility : home_venue_for | sports.team_venue_relationship : team | people.deceased_person : date_of_death | government.political_appointer : appointees | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | military.military_person : participated_in_conflicts | award.award_category : date_established | sports.professional_sports_team : owner_s | common.topic : notable_types\n\n\nquestion:\n\nTeam owner Rooney Family's team has what colors?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.03nrwfz .\n?c ns:sports.sports_team.colors ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Black, Gold, White"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRecep Tayyip Erdoğan: m.021275 | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.person : profession, nationality, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | government.government_position_held : legislative_sessions, to, jurisdiction_of_office | location.country : currency_used | type.object : type | people.deceased_person : cause_of_death, place_of_death, place_of_burial | film.actor : film | film.performance : film | common.topic : notable_types | government.political_party_tenure : from\n\n\nquestion:\n\nWhat currency is used in the country that appointed Recep Tayyip ErdoÄan to government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.021275 .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkish lira"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWestern European Time Zone: m.02q_y6 | french republic: m.0f8l9c | Country: m.01mp | location.location : time_zones, containedby, contains, people_born_here | media_common.netflix_genre : titles | type.object : name, type | common.topic : notable_types | location.country : administrative_divisions, form_of_government | measurement_unit.dated_percentage : rate | time.time_zone : locations_in_this_time_zone | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.administrative_division : country | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat country bordering France is in the Western European Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f8l9c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.time_zones ns:m.02q_y6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Spain"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRoger Eaton: m.05zjbcs | people.person : religion, profession, nationality, parents, ethnicity, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | type.object : type | people.deceased_person : cause_of_death, date_of_death | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.government_position_held : appointed_by, jurisdiction_of_office | kg.object_profile : prominent_type | government.political_party_tenure : party | organization.organization : founders | american_football.football_player : position_s\n\n\nquestion:\n\nWho was the owner of the organization with Roger Eaton?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.05zjbcs .\n?c ns:organization.organization.founders ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Colonel Sanders"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | West Africa: m.0hqjh | location.location : people_born_here, adjoin_s, contains, containedby | location.adjoining_relationship : adjoins | location.statistical_region : population, size_of_armed_forces | measurement_unit.dated_integer : number | book.book_subject : works | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | common.topic : notable_types | location.country : official_language, capital, administrative_divisions, form_of_government | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat countries in West Africa once had CO2 emiisions per capita of 2010 metric tons?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hqjh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2010\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Benin, Burkina Faso, Ghana, Guinea, Guinea-Bissau, Liberia, Mali, Mauritania, Nigeria, Sierra Leone, Senegal, Togo, Ivory Coast, Gambia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\npeoples republic of china: m.0d05w3 | Yekaterinburg Time Zone: m.03nmg3d | location.location : time_zones, contains, nearby_airports | military.military_combatant : casualties | military.casualties : military_conflict | location.country : administrative_divisions | time.time_zone : locations_in_this_time_zone | government.governmental_jurisdiction : governing_officials | government.government_position_held : governmental_body\n\n\nquestion:\n\nWhat country borders China in the Yekaterinburg Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d05w3 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:location.location.time_zones ns:m.03nmg3d .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Russia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nchicago, illinois: m.01_d4 | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | type.object : type | government.politician : government_positions_held, party | government.political_party_tenure : party | location.location : containedby | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport | common.topic : notable_types | government.government_position_held : office_position_or_title | kg.object_profile : prominent_type | travel.travel_destination : tourist_attractions | fictional_universe.fictional_character : gender | architecture.structure : opened\n\n\nquestion:\n\nWhat zoo which opened before May 30, 1030 is a good Chicago hangout?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lincoln Park Zoo"
    }
]