[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVietnam War: m.07_nf | Kevin Rudd: m.021l9k | location.location : events, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, to, from, appointed_by | type.object : type | military.military_conflict : combatants | military.military_combatant_group : combatants | government.political_appointer : appointees | location.statistical_region : places_imported_from, major_exports | location.imports_exports_by_industry : industry | location.imports_and_exports : imported_from | location.country : languages_spoken\n\n\nquestion:\n\nWhich nation has Kevin Rudd as a member of their government and was a participant in the Vietnam war?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07_nf ns:military.military_conflict.combatants ?y .\n?y ns:military.military_combatant_group.combatants ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.021l9k .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Australia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\njohn kennedy: m.0d3k14 | Marriage: m.04ztj | people.person : religion, children, profession, nationality, date_of_birth, place_of_birth, gender | government.politician : government_positions_held, party | government.political_party_tenure : party | book.written_work : author | location.location : containedby | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.government_position_held : district_represented, from, jurisdiction_of_office, to, governmental_body | kg.object_profile : prominent_type | type.object : type | people.deceased_person : cause_of_death, date_of_death, place_of_death | base.activism.activist : area_of_activism | symbols.name_source : namesakes\n\n\nquestion:\n\nWho held his governmental position from 1934 and was John F. Kennedy's family?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\n# Parents\nns:m.0d3k14 ns:people.person.parents ?x .\n}\nUNION\n{\n# Children\nns:m.0d3k14 ns:people.person.children ?x .\n}\nUNION\n{\n# Siblings\nns:m.0d3k14 ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n}\nUNION\n{\n# Spouse\nns:m.0d3k14 ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\n}?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1934\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Joseph P. Kennedy, Sr."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1974 NBA Finals: m.0cs1gb | sports.sports_championship_event : championship, champion | base.culturalevent.event : entity_involved | government.politician : government_positions_held | type.object : type | film.film : language | people.deceased_person : cause_of_death, date_of_death, place_of_death | people.person : religion, profession, place_of_birth | time.event : start_date, locations, instance_of_recurring_event, included_in_event | location.location : contains, people_born_here | organization.organization_sector : organizations_in_this_sector | government.government_position_held : basic_title, office_holder | language.language_writing_system : languages | sports.sports_team : championships | base.activism.activist : area_of_activism | location.country : calling_code | biology.animal_breed : place_of_origin | government.governmental_jurisdiction : governing_officials | influence.influence_node : influenced | language.human_language : countries_spoken_in\n\n\nquestion:\n\nWhen did the sports team that won the 1974 NBA Finals championship win their first championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0cs1gb .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1957 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\npeoples republic of china: m.0d05w3 | Malagasy ariary: m.04hx_7 | location.country : currency_used, iso_alpha_3, calling_code, official_language, second_level_divisions, languages_spoken, form_of_government | location.location : time_zones, containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | type.object : type | location.statistical_region : co2_emissions_per_capita | kg.object_profile : prominent_type | finance.currency : countries_used\n\n\nquestion:\n\nWhat country using the Malagasy Ariary currency is China's trading partner?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0d05w3 ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.0d05w3 ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.country.currency_used ns:m.04hx_7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Madagascar"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCharlotte County Courthouse: m.06_d_fx | people.person : profession | type.object : type | location.location : time_zones, people_born_here, contains, containedby | kg.object_profile : prominent_type | architecture.structure : opened | common.topic : notable_types | architecture.architect : structures_designed\n\n\nquestion:\n\nWhat role in the Declaration of Independence did the architect that designed Charlotte Country Courthouse play?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:architecture.architect.structures_designed ns:m.06_d_fx .\n?c ns:people.person.profession ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Statesman, Teacher, Philosopher, Archaeologist, Inventor, Lawyer, Writer, Farmer, Author, Architect"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCity of Brussels: m.02rnbv | kg.object_profile : prominent_type | location.country : capital, languages_spoken | location.location : time_zones, containedby | type.object : type | architecture.building : floors | architecture.structure : opened | common.topic : notable_types | location.administrative_division : country\n\n\nquestion:\n\nWhat language is spoken where the capital city is Brussels?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.02rnbv .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dutch Language, Picard Language, West Flemish, German Language, French"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBaguio: m.015l1_ | Puerto Galera, Oriental Mindoro: m.01pn1_ | location.location : events, time_zones, people_born_here, contains, containedby | government.governmental_jurisdiction : government, governing_officials | government.government_position_held : office_holder, office_position_or_title, appointed_by | time.time_zone : locations_in_this_time_zone | location.country : official_language, languages_spoken, administrative_divisions, form_of_government | sports.sports_team_location : teams | kg.object_profile : prominent_type | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | type.object : type\n\n\nquestion:\n\nWhat country is home to both Baguio and Puerto Galera?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01pn1_ ns:location.location.containedby ?x .\n?x ns:location.country.administrative_divisions ns:m.015l1_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Philippines"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSan Pedro de Macorís Province: m.03xyyk | location.location : area, time_zones, people_born_here, partially_containedby, containedby | type.object : type | architecture.building : floors | kg.object_profile : prominent_type | architecture.structure : height_meters | common.topic : notable_types | location.country : currency_used, administrative_divisions\n\n\nquestion:\n\nWhat currency is used in the country with San Pedo de Marocris Province?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03xyyk .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Girlie Show World Tour: m.08c8b5 | time.event : end_date, instance_of_recurring_event, included_in_event | influence.influence_node : influenced_by, peers, influenced | people.person : religion, profession, nationality, place_of_birth | type.object : type | location.location : containedby, events, contains, people_born_here | book.author : works_written | influence.peer_relationship : peers | film.film_story_contributor : film_story_credits | kg.object_profile : prominent_type | film.film_genre : films_in_this_genre | finance.currency : countries_used | common.topic : notable_types | government.political_district : representatives | government.government_position_held : office_holder, office_position_or_title, governmental_body | government.politician : government_positions_held | organization.organization : founders | people.deceased_person : cause_of_death, place_of_death | government.political_appointer : appointees | base.culturalevent.event : entity_involved | book.book_subject : works | music.artist : concert_tours | music.genre : albums | government.governmental_jurisdiction : governing_officials\n\n\nquestion:\n\nWhat religions does the artist who went on The Girlie Show World Tour follow?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.08c8b5 .\n?c ns:people.person.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jewish Renewal, Catholicism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMadrid: m.056_y | type.object : type | people.deceased_person : cause_of_death, place_of_burial, place_of_death | people.person : religion, children, profession, nationality, height_meters, place_of_birth, gender | location.location : containedby | travel.travel_destination : tourist_attractions | film.film : release_date_s | film.film_regional_release_date : release_date | kg.object_profile : prominent_type | influence.influence_node : influenced_by | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | architecture.structure : construction_started | award.award_nominee : award_nominations | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | common.topic : notable_types | government.government_office_category : officeholders\n\n\nquestion:\n\nWhich sights are their to see in Madrid, where the structure was construction started the latest?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.056_y ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:architecture.structure.construction_started ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Royal Palace of Madrid"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKen Kendrick: m.0d_khh | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | government.politician : government_positions_held, party | government.government_position_held : jurisdiction_of_office, governmental_body | kg.object_profile : prominent_type | government.political_party_tenure : party | film.film_character : portrayed_in_films | sports.pro_athlete : sports_played_professionally, career_end | sports.pro_sports_played : sport | type.object : type | people.deceased_person : date_of_death | sports.professional_sports_team : owner_s | film.writer : film | sports.sports_team : championships\n\n\nquestion:\n\nIn what year did team owner Ken Kendrick's sports team with the World Series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.0d_khh .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2001 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMasjid Hamza, Valley Stream: m.0pc5qwj | type.object : type | location.mailing_address : country | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, contains, containedby | religion.religion : types_of_places_of_worship, holidays | common.topic : notable_types | architecture.structure : construction_started\n\n\nquestion:\n\nWhich holidays are the important ones in the religion with places of worship Masjid Hamza and Valley Stream?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.types_of_places_of_worship ns:m.0pc5qwj .\n?c ns:religion.religion.holidays ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lailat al Mi'raj, Nuzul Al-Quran, Eid al-Fitr, Eid al-Adha, Day of Arafat, Day of Ashura, Mourning of Muharram, Laylat al-Qadr, Barat Night, Mawlid, Ramadan, Islamic New Year, Eid al-Fitr Eve, Eid-Ul-Adha Eve, Night of Wishes"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHungarian forint: m.01hfll | Maria Theresa: m.0czh6 | location.location : contains | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | finance.currency : countries_used | location.country : currency_used, administrative_divisions | people.person : children | royalty.monarch : kingdom\n\n\nquestion:\n\nWhich country that uses the Hungarian forint did Maria Theresa rule?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0czh6 ns:royalty.monarch.kingdom ?x .\n?x ns:location.country.currency_used ns:m.01hfll .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hungary"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPanama City: m.0fr_b | common.topic : notable_types | location.location : time_zones, contains, containedby | travel.tourist_attraction : near_travel_destination | architecture.building : building_complex | type.object : type | kg.object_profile : prominent_type | location.country : capital | architecture.structure : height_meters\n\n\nquestion:\n\nWhat continent does Panama City located in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0fr_b .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "North America"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nunion of soviet socialist republics: m.05vz3zq | World War II: m.081pw | common.topic : notable_types | time.event : locations, start_date, includes_event, end_date, included_in_event | type.object : type | base.culturalevent.event : entity_involved | military.military_person : participated_in_conflicts | location.location : events, contains | people.person : religion\n\n\nquestion:\n\nWho was the Soviet Leader during WWII that held his governmental position after September 14, 1953?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05vz3zq ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?x ns:military.military_person.participated_in_conflicts ns:m.081pw .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leonid Brezhnev"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPorque el amor manda: m.0lqfswc | Frida Kahlo: m.015k04 | location.location : adjoin_s, contains, people_born_here | location.statistical_region : population, consumer_price_index, cpi_inflation_rate, gdp_real, size_of_armed_forces, co2_emissions_per_capita | measurement_unit.adjusted_money_value : adjusted_value | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | measurement_unit.dated_percentage : rate | measurement_unit.dated_integer : number | food.beer_country_region : beers_from_here | location.adjoining_relationship : adjoins | tv.tv_location : tv_shows_filmed_here | symbols.coat_of_arms_bearer : coat_of_arms_used | symbols.armorial_grant : coat_of_arms | meteorology.cyclone_affected_area : cyclones | film.film_subject : films | type.object : type\n\n\nquestion:\n\nWhere was the tv program Porque el amor manda recorded and is now the place of residence of Frida Kahlo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.015k04 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\nEXISTS {?y ns:people.place_lived.end_date ?sk1 .\nEXISTS {?y ns:people.place_lived.start_date ?sk3 .\n?x ns:tv.tv_location.tv_shows_filmed_here ns:m.0lqfswc .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNiger River: m.05csx | Country: m.01mp | Sahel: m.0l5_l | Abuja: m.0fnxw | type.object : name, type | location.country : administrative_divisions, capital, languages_spoken | location.location : events, time_zones, people_born_here, partially_containedby, contains, partially_contains | location.statistical_region : major_exports, size_of_armed_forces | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | common.topic : notable_types | geography.river : cities | location.imports_exports_by_industry : industry | book.book_subject : works\n\n\nquestion:\n\nAbuja is capital of which country of the Sahel where the Niger River flows through?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05csx ns:location.location.partially_containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.partially_contains ns:m.0l5_l .\n?x ns:location.country.capital ns:m.0fnxw .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nigeria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUTC±00:00: m.0frmgl | city of liverpool: m.04lh6 | periodicals.newspaper_circulation_area : newspapers | location.location : time_zones, containedby, people_born_here | time.time_zone : locations_in_this_time_zone | type.object : type | travel.travel_destination : tourist_attractions | amusement_parks.park : opened, rides\n\n\nquestion:\n\nWhat has a location time zone of UTC +-00:00 an dis part of Liverpool England?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04lh6 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.0frmgl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Pleasureland Southport"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMae Hong Son Province: m.01jb47 | location.location : time_zones, containedby | location.hud_county_place : county | organization.organization : date_founded | type.object : type | architecture.structure : opened, height_meters | location.country : languages_spoken, currency_used, administrative_divisions | education.educational_institution : students_graduates | education.education : student | kg.object_profile : prominent_type | common.topic : notable_types | location.mailing_address : country\n\n\nquestion:\n\nWhich type of currency would one be advised to bring if visiting that has Mae Hong Son Province within its borders?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01jb47 .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thai baht"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRenegade: m.06c78r | american_football.football_player : position_s | type.object : type | film.film_subject : films | location.location : events, people_born_here | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : to, from | sports.sports_championship_event : championship, champion, runner_up | people.person : profession, nationality, parents, height_meters, gender | people.deceased_person : place_of_death | time.event : end_date, locations | architecture.structure : opened | common.topic : notable_types | award.award_category : date_established | people.family : members | military.military_person : participated_in_conflicts | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : career_start | sports.sports_team : fight_song | award.award_nominee : award_nominations | award.award_nomination : award\n\n\nquestion:\n\nWhat is the home stadium of the sports team whose fight song is \"Renegade\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.06c78r .\n?c ns:sports.sports_team.venue ?y .\n?y ns:sports.team_venue_relationship.venue ?x .\nEXISTS {?y ns:sports.team_venue_relationship.from ?sk1 .\nEXISTS {?y ns:sports.team_venue_relationship.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Heinz Field"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAgusan del Sur: m.01nk2j | location.location : nearby_airports, time_zones, people_born_here, partially_containedby, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | sports.sports_team_location : teams | location.country : administrative_divisions | type.object : type | architecture.structure : height_meters | geography.river : basin_countries\n\n\nquestion:\n\nWhich sports are played in the nation where Agusan del Sur can be found?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01nk2j .\n?c ns:sports.sports_team_location.teams ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Philippines national football team, Philippines men's national volleyball team, Laos FC"
    }
]