[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBoston Celtics: m.0bwjj | sports.sports_team : colors, championships, roster | sports.sports_team_roster : to, player, team, position | sports.pro_athlete : teams, sports_played_professionally, career_start, career_end | sports.pro_sports_played : sport, career_start | people.person : gender, nationality, place_of_birth, ethnicity | basketball.basketball_player : position_s | type.object : type | common.topic : notable_types\n\n\nquestion:\n\nWhich palyed began their career in 2005 and currently is on the Celtics roster?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0bwjj ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.pro_athlete.sports_played_professionally ?c .\n?c ns:sports.pro_sports_played.career_start \"2005\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brandon Bass"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n\n\n\nquestion:\n\nWhich country partially containing Georgia has the largest area of land?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:base.locations.continents.countries_within ?x .\n?x ns:location.location.area ?y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Russia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWallonia: m.0pfrr | location.location : time_zones, people_born_here, containedby | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : height_meters | location.country : capital, administrative_divisions | education.educational_institution : colors\n\n\nquestion:\n\nWhat cities are in the country where Wallonia is?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0pfrr .\n?c ns:location.country.capital ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brussels"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nconnecticutt: m.01x73 | United States Senator: m.02_7l8y | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | government.politician : government_positions_held, party | government.political_district : representatives | people.person : religion, profession, nationality, gender | government.governmental_body : members | type.object : type | location.location : contains | book.author : works_written | government.political_party_tenure : party | government.government_office_or_title : office_holders\n\n\nquestion:\n\nWho held his governmental position from January 5, 1983 and was the 2010 senator of Connecticut?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01x73 ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:m.02_7l8y .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Joe Lieberman"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVirginia: m.07z1m | United States Senate: m.07t58 | people.person : date_of_birth, profession | government.politician : government_positions_held | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | location.location : contains | government.political_district : representatives | type.object : type | military.military_person : participated_in_conflicts | government.government_office_category : officeholders\n\n\nquestion:\n\nWhat 2013 Virginia Senators held their governmental position from after January 14, 2006?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07z1m ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.governmental_body ns:m.07t58 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mark Warner, Tim Kaine, Jim Webb"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAbraham Lincoln: m.0gzh | location.location : people_born_here, contains, containedby | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, to, office_position_or_title, from, appointed_by | government.government_office_or_title : office_holders | type.object : type | people.person : spouse_s, religion, profession, nationality | military.military_conflict : commanders | military.military_command : military_commander | influence.influence_node : influenced_by, influenced | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | government.governmental_body : members | event.speech_topic : speeches_or_presentations_on_this_topic | event.speech_or_presentation : speaker_s | kg.object_profile : prominent_type | film.film : language, country | time.event : locations, instance_of_recurring_event | government.government_office_category : officeholders | symbols.namesake : named_after | location.statistical_region : co2_emissions_industrial | people.marriage : spouse | people.deceased_person : cause_of_death | book.book_subject : works\n\n\nquestion:\n\nWho influenced Abraham Lincoln to become the president?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0gzh ns:influence.influence_node.influenced_by ?x .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Henry Clay"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEl Seibo Province: m.03xplf | people.person : profession, nationality, parents, place_of_birth, gender | government.government_position_held : office_holder, office_position_or_title, from, jurisdiction_of_office, to | time.time_zone : locations_in_this_time_zone | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.politician : government_positions_held | organization.organization : founders | type.object : name, type | kg.object_profile : prominent_type | meteorology.tropical_cyclone : affected_areas | time.event : start_date | language.human_language : countries_spoken_in | location.country : administrative_divisions | architecture.building : floors\n\n\nquestion:\n\nWho lead the country where the El Seibo Province is located in 2011?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.03xplf .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.office_position_or_title ns:g.120vz7rb .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Leonel Fernández"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nProgressive Dawoodi Bohra: m.09sxls | government.politician : government_positions_held | government.government_position_held : basic_title, jurisdiction_of_office | religion.religion : beliefs, organizations | kg.object_profile : prominent_type | location.location : containedby | people.person : date_of_birth, profession, religion, gender | organization.organization : date_founded | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | type.object : type | education.educational_institution : school_type | tv.tv_location : tv_shows_filmed_here | sports.sports_team : sport, championships | common.topic : notable_types | government.political_appointer : appointees\n\n\nquestion:\n\nThe religious organization Progressive Dawoodi Bohra has what basic religious beliefs.?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.organizations ns:m.09sxls .\n?c ns:religion.religion.beliefs ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mahdi, Tawhid, Prophets in Islam, Predestination in Islam, Entering Heaven alive, Monotheism, Islamic view of angels, Qiyamah, Sharia, Masih ad-Dajjal, Islamic holy books, God in Islam, Ṭūbā"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWhite House: m.081sq | bachelor of arts degree: m.014mlp | people.person : education, profession, nationality, place_of_birth | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, appointed_by, governmental_body | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | influence.influence_node : influenced_by, influenced | location.location : people_born_here | government.politician : government_positions_held | type.object : type | government.government_office_category : officeholders | time.event : start_date | government.political_appointer : appointees | education.education : institution, degree | people.ethnicity : languages_spoken | organization.organization : date_founded | government.governmental_body : members | kg.object_profile : prominent_type | film.film_story_contributor : film_story_credits | religion.religion : founding_figures\n\n\nquestion:\n\nThe person who once lived in the White House graduated from what college?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.081sq .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?y ns:education.education.degree ns:m.014mlp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Columbia University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSkol, Vikings: m.095v49 | periodicals.newspaper_circulation_area : newspapers | type.object : type | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : to, from | location.location : events, containedby, contains, people_born_here | american_football.football_player : position_s | people.person : height_meters, profession, nationality, gender | sports.sports_championship_event : champion, runner_up | sports.pro_athlete : teams, sports_played_professionally | sports.pro_sports_played : sport, career_start | film.producer : films_executive_produced | film.film_subject : films | sports.sports_team : location, fight_song | kg.object_profile : prominent_type | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | sports.sports_team_roster : team | common.topic : notable_types\n\n\nquestion:\n\nWhich coaches headed the team the uses the fight song Skol Vikings?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.095v49 .\n?c ns:american_football.football_team.historical_coaching_staff ?y .\n?y ns:american_football.football_historical_coach_position.coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bud Grant, Mike Zimmer, Norm Van Brocklin, Mike Tice, Dennis Green, Les Steckel, Jerry Burns, Leslie Frazier, Brad Childress, Joe Woods, Mike Tomlin"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nChase Lane Primary School: m.04dyl8y | type.object : type | government.political_party : ideology, politicians_in_this_party | government.political_party_tenure : politician | kg.object_profile : prominent_type | location.location : nearby_airports, containedby | education.educational_institution : mascot, school_type, students_graduates | education.education : student | sports.sports_team : sport, founded | common.topic : notable_types | organization.organization : date_founded, parent | organization.organization_relationship : parent | education.university : number_of_undergraduates | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat sport is played by the individual who attended Chase Lane Primary School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.04dyl8y .\n?c ns:sports.pro_athlete.sports_played_professionally ?y .\n?y ns:sports.pro_sports_played.sport ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMark Zuckerberg: m.086dny | Mercy Mavericks: m.0htgby5 | people.person : religion, profession, nationality, education, height_meters, place_of_birth, gender | education.education : institution, student, major_field_of_study | type.object : type | organization.organization : headquarters, date_founded | organization.organization_founder : organizations_founded | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | internet.website_owner : websites_owned | influence.influence_node : influenced | education.educational_institution : mascot, school_type, students_graduates, colors | common.topic : notable_types | kg.object_profile : prominent_type | film.film_subject : films | location.location : containedby\n\n\nquestion:\n\nWhat educational institution that has a mascot named Mercy Mavericks did Mark Zuckerberg attend?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.086dny ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.mascot ns:m.0htgby5 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mercy College"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRio de Janeiro: m.01hd4s | location.location : time_zones, partially_containedby, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | people.person : profession, nationality, gender | type.object : type | geography.river : basin_countries | government.politician : government_positions_held | government.government_position_held : from, jurisdiction_of_office | location.country : currency_used, administrative_divisions | geography.mountain : mountain_type | organization.organization : place_founded | people.deceased_person : cause_of_death\n\n\nquestion:\n\nWhat's the name of the currency in the country, that includes the location of Rio de Janeiro?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hd4s .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brazilian real"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBelieve Tour: m.0j_3p6t | award.award_category : date_established | film.film : language, starring, production_companies, release_date_s | film.film_regional_release_date : release_date | location.location : contains, people_born_here | type.object : type | time.event : end_date, start_date | government.politician : government_positions_held | government.government_position_held : jurisdiction_of_office, governmental_body | location.statistical_region : size_of_armed_forces, part_time_employment_percent | measurement_unit.dated_integer : number | music.artist : concert_tours | music.genre : albums | people.person : date_of_birth, place_of_birth, gender | film.film_character : portrayed_in_films | film.performance : actor | measurement_unit.dated_percentage : rate | organization.organization : date_founded | music.composition : composer | media_common.netflix_genre : titles | music.album : release_date | people.deceased_person : cause_of_death, date_of_death\n\n\nquestion:\n\nWhat did the lead artist that went on the Believe Tour do?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0j_3p6t .\n?c ns:music.artist.track_contributions ?y .\n?y ns:music.track_contribution.role ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Vocals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGreenpeace Deutschland: m.05c936f | organization.organization : place_founded, child, date_founded, founders | education.educational_institution : school_type | type.object : type | sports.sports_team : founded, team_mascot, location, sport, roster | kg.object_profile : prominent_type | organization.organization_relationship : child | location.location : containedby | sports.sports_team_roster : player | common.topic : notable_types\n\n\nquestion:\n\nIn which city was the Greenpeace Deutschland an international environmental organization started?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.05c936f .\n?c ns:organization.organization.place_founded ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Vancouver"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBurundi Bwacu: m.01l8dc | type.object : name, type | people.person : religion, profession, nationality, ethnicity, place_of_birth, gender | location.location : time_zones, contains, containedby | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, to | government.government_office_category : officeholders | time.time_zone : locations_in_this_time_zone | language.human_language : main_country | location.country : administrative_divisions | finance.currency : countries_used | media_common.netflix_genre : titles | government.form_of_government : countries\n\n\nquestion:\n\nWhere is the location of the country whose national anthem is \"Burundi Bwacu\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01l8dc .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Africa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWilliam Morris: m.0_h07sd | UK constituent country: m.0hzjlmp | United Kingdom: m.07ssc | location.location : events, contains, people_born_here | location.country : second_level_divisions, administrative_divisions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | people.person : profession\n\n\nquestion:\n\nWhich country is a British Territory,  where the religious leader is William Morris?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:base.aareas.schema.administrative_area.administrative_children ?x .\n?x ns:base.aareas.schema.administrative_area.administrative_area_type ns:m.0hzjlmp .\n?x ns:religion.religious_leadership_jurisdiction.leader ?c .\n?c ns:religion.religious_organization_leadership.leader ns:m.0_h07sd .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wales"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2010 NFC Championship Game: m.0_gv207 | sports.sports_championship_event : championship, champion, runner_up | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : from, to | award.award_nominee : award_nominations | award.award_nomination : nominated_for | award.award_category : date_established | type.object : type | american_football.football_player : position_s | people.person : profession, nationality, place_of_birth, gender | film.film : starring | film.performance : actor | common.topic : notable_types | location.mailing_address : citytown | time.event : end_date, start_date, locations | sports.pro_athlete : teams | sports.sports_team_roster : team | government.government_office_category : officeholders | government.government_position_held : office_holder | kg.object_profile : prominent_type | location.location : containedby, events, people_born_here | film.film_subject : films | sports.sports_team : arena_stadium, championships | american_football.football_team : current_head_coach\n\n\nquestion:\n\nWho was the head coach of the champion of hte 2010 NFC Championship game?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0_gv207 .\n?c ns:american_football.football_team.current_head_coach ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sean Payton"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTerrell Owens: m.027ddp | Billy Buffalo: m.09pvqh | type.object : type | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.sports_team_roster : player, team, position | sports.sports_team : arena_stadium, founded, team_mascot, location, sport, championships, roster | people.person : profession, nationality, ethnicity, height_meters, gender | american_football.football_team : current_head_coach | symbols.namesake : named_after | book.author : book_editions_published | sports.pro_sports_played : sport, career_start | kg.object_profile : prominent_type | sports.professional_sports_team : owner_s | american_football.football_player : position_s | common.topic : notable_types\n\n\nquestion:\n\nWhich football organization with a mascot called Billy Buffalo had Terrell Owens as a player in 2010?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027ddp ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.team_mascot ns:m.09pvqh .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Buffalo Bills"
    }
]