[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAustralian external territory: m.02_8yfs | Australian Territory: m.02xhc4k | Australian State: m.02xhc47 | \n\n\nquestion:\n\nHow many locations and territories are in the Central Western Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\n?c ns:location.country.administrative_divisions ?x .\n?x ns:common.topic.notable_types ns:m.02xhc47 .  #australian state\n}\nUNION\n{\n?c ns:location.country.administrative_divisions ?x .\n?x ns:common.topic.notable_types ns:m.02_8yfs .  #australian external territory\n}\nUNION\n{\n?c ns:location.country.administrative_divisions ?x .\n?x ns:common.topic.notable_types ns:m.02xhc4k .  #australian territory\n}\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Australian Antarctic Territory, Coral Sea Islands, Northern Territory, New South Wales, South Australia, Tasmania, Western Australia, Victoria, Queensland, Ashmore and Cartier Islands, Jervis Bay Territory, Australian Capital Territory"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPoplar Forest: m.02kpf3 | Montesquieu: m.0f9wd | government.political_appointer : appointees | government.government_position_held : basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | influence.influence_node : peers, influenced_by, influenced | architecture.architect : structures_designed | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : event | common.topic : image | symbols.namesake : named_after | architecture.structure : opened | organization.organization_founder : organizations_founded | people.person : gender, profession, nationality, ethnicity | symbols.name_source : namesakes | government.politician : government_positions_held | type.object : type | book.author : book_editions_published | government.us_president : vice_president | influence.peer_relationship : peers | music.composer : compositions\n\n\nquestion:\n\nAlso the architect that designed Poplar Forest, who did Baron de Montesquie influence?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f9wd ns:influence.influence_node.influenced ?x .\n?x ns:architecture.architect.structures_designed ns:m.02kpf3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Thomas Jefferson"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nKim Kardashian: m.0261x8t | location.location : containedby, contains, people_born_here | people.marriage : spouse | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film : subjects | tv.tv_regular_personal_appearance : appearance_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.person : education, spouse_s, profession | american_football.football_player : receiving | american_football.player_receiving_statistics : touchdowns | film.film_subject : films | kg.object_profile : prominent_type | people.ethnicity : languages_spoken | film.actor : film | film.performance : film | education.education : institution | religion.religion : places_of_worship\n\n\nquestion:\n\nWho did Kim Karsashian date that started his athletic career after 2004?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0261x8t ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n?x ns:sports.pro_athlete.sports_played_professionally ?c .\n?c ns:sports.pro_sports_played.career_start ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Reggie Bush"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArise, O Compatriots: m.020fjg | location.country : official_language | location.location : time_zones, containedby | kg.object_profile : prominent_type | type.object : name, type | people.person : religion, profession, nationality, place_of_birth, gender | common.topic : notable_types | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : career_start | music.group_member : instruments_played | government.government_office_category : officeholders | government.government_position_held : office_holder | language.human_language : countries_spoken_in\n\n\nquestion:\n\nWhich languages are used the the country with the Anthem titled \"Arise, O Compatriots\"?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.020fjg .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "English Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAmazon.com.nvdc Inc: m.09m9__z | type.object : type | common.topic : notable_types | sports.sports_team : sport, founded, roster | kg.object_profile : prominent_type | organization.organization : headquarters, date_founded | sports.sports_team_roster : player | location.location : containedby | education.educational_institution : school_type, students_graduates, colors | government.governmental_body : members | government.government_position_held : office_holder | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | education.education : student\n\n\nquestion:\n\nWHat city is the branch organization of amazon.com based out of?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.09m9__z .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Seattle"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Country: m.01mp | location.location : partially_contains, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, governmental_body | location.statistical_region : cpi_inflation_rate, co2_emissions_per_capita, gdp_real | type.object : name, type | measurement_unit.adjusted_money_value : adjusted_value | location.country : administrative_divisions, form_of_government | measurement_unit.dated_percentage : rate | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat US bordering country's merchandise trade percent gdp was 10.78?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.merchandise_trade_percent_of_gdp ?c .\n?c ns:measurement_unit.dated_percentage.rate \"10.78\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVirginia: m.07z1m | United States Senate: m.07t58 | government.political_district : representatives | government.politician : government_positions_held, party | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | people.person : profession, place_of_birth, gender | government.governmental_body : members | government.political_party_tenure : party | type.object : type | government.government_office_category : officeholders | people.deceased_person : place_of_burial\n\n\nquestion:\n\nWhat senator of Virginia in 2013 held his governmental position before January 14, 2006?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07z1m ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.governmental_body ns:m.07t58 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jim Webb"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNorth Atlantic Treaty Organization (NATO): m.059dn | Kleve (district): m.01b98m | location.location : nearby_airports, partially_contains, adjoin_s, people_born_here, contains, containedby | location.adjoining_relationship : adjoins | location.country : form_of_government | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | organization.organization : founders | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | government.political_district : representatives | organization.membership_organization : members | organization.organization_membership : member\n\n\nquestion:\n\nWhich nation that has an airport that serves Kleve (district) is in NATO?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.059dn ns:organization.membership_organization.members ?y .\n?y ns:organization.organization_membership.member ?x .\n?x ns:location.location.contains ?c .\n?c ns:aviation.airport.serves ns:m.01b98m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Germany"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGreen Run High School: m.09l69j | kg.object_profile : prominent_type | type.object : type | location.location : time_zones, contains, containedby | organization.organization : date_founded | common.topic : notable_types | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | sports.sports_team : sport, founded | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | education.educational_institution : school_type, students_graduates | government.governmental_body : members | government.government_position_held : office_holder | business.business_operation : industry | education.education : student\n\n\nquestion:\n\nWhich team did the player who the player who attended Green Run High Schoool sign with in 2012?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.09l69j .\n?c ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Pittsburgh Steelers"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMarco Rubio: m.0dpr5f | College/University: m.01y2hnl | Albert and Alberta Gator: m.02z3bxp | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | education.educational_institution : mascot, school_type, colors, sports_teams, students_graduates | education.education : institution, student, degree | common.topic : notable_types | type.object : type | location.location : containedby | people.person : religion, profession, nationality, education, height_meters | organization.organization : date_founded | government.politician : government_positions_held | government.government_position_held : legislative_sessions, governmental_body | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhich Univesity has the mascots Albert and Alberta Gator and includes Marco Rubio as an Alumni?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0dpr5f ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.mascot ns:m.02z3bxp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Florida"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Chile: m.01p52 | biology.animal_breed : place_of_origin | film.film : country | type.object : type | government.form_of_government : countries | government.government_office_category : officeholders | government.government_position_held : office_holder, jurisdiction_of_office, governmental_body | kg.object_profile : prominent_type | finance.currency : countries_used, countries_formerly_used | common.topic : notable_types | location.country : currency_used | location.location : partially_containedby, containedby | people.deceased_person : cause_of_death | law.court : jurisdiction | people.person : profession, nationality, date_of_birth, place_of_birth, gender | geography.river : basin_countries | location.administrative_division : country | government.politician : government_positions_held | language.human_language : countries_spoken_in | government.political_district : representatives | government.government_office_or_title : office_holders\n\n\nquestion:\n\nWhat is the currency used by the country with the national anthem National Anthem of Chile?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01p52 .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Chilean peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJames Madison: m.0424m | government.government_office_or_title : office_holders | government.government_position_held : office_holder, basic_title, from, appointed_by, legislative_sessions, to | government.politician : government_positions_held | type.object : type | influence.influence_node : peers, influenced_by | government.political_appointer : appointees | law.litigant : party_to_cases | law.legal_case_party_relationship : case | influence.peer_relationship : peers | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhat office was held by James Madison from April 30, 1789?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0424m ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.office_position_or_title ?x .\n?x ns:government.government_office_or_title.office_holders ?c .\n?c ns:government.government_position_held.from \"1789-04-30\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "President of the United States"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSuper Bowl XVIII: m.076s5 | sports.professional_sports_team : owner_s | time.recurring_event : instances | sports.sports_team : founded, colors, location, previously_known_as, championships, roster | sports.sports_team_roster : player, position | sports.sports_championship : events | sports.sports_championship_event : championship, runner_up | organization.organization : leadership | organization.leadership : person | common.topic : notable_types | type.object : type | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat other years did the champion of Superowl XVIII win the Superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.076s5 .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1967 American Football League Championship Game, Super Bowl XI, Super Bowl XV, Super Bowl XVIII, 2003 AFC Championship Game"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAlta Verapaz Department: m.0146np | type.object : type | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | location.country : currency_used, administrative_divisions | symbols.namesake : named_after | architecture.structure : opened, height_meters | geography.river : mouth\n\n\nquestion:\n\nWhat type of currency is used in the country that has the Alta Verapaz Department?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.0146np .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Guatemalan quetzal"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNijmegen: m.05g2b | North Atlantic Treaty Organization (NATO): m.059dn | aviation.airport : serves | location.location : time_zones, people_born_here, contains, containedby | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | organization.organization : date_founded, founders | geography.river : mouth\n\n\nquestion:\n\nWhat location contains the airport that serves Nijmegen and is a country in NATO?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.059dn ns:organization.membership_organization.members ?y .\n?y ns:organization.organization_membership.member ?x .\n?x ns:location.location.contains ?c .\n?c ns:aviation.airport.serves ns:m.05g2b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Germany"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSeybourn Harris Lynne: m.05p13m1 | kg.object_profile : prominent_type | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | location.location : containedby | government.politician : government_positions_held | type.object : type | government.government_position_held : basic_title, from, jurisdiction_of_office, appointed_by, to | government.political_appointer : appointees | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | influence.influence_node : influenced | people.deceased_person : date_of_death\n\n\nquestion:\n\nGrad student Seybourn Harris Lynne attended educaitonal institutions located where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.students_graduates ?k .\n?k ns:education.education.student ns:m.05p13m1 .\n?c ns:location.location.containedby ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Auburn University Historic District, United States of America, Alabama, Auburn"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWoman to Woman Tour: m.0r8kcn8 | Marriage: m.04ztj | location.location : containedby, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | people.marriage : type_of_union, spouse, location_of_ceremony | fictional_universe.fictional_language : where_spoken | music.artist : origin, concert_tours | people.person : spouse_s | music.genre : albums | book.book_subject : works | organization.organization_founder : organizations_founded | language.human_language : countries_spoken_in | type.object : type | media_common.netflix_genre : titles | location.statistical_region : part_time_employment_percent | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nThe artist who had the Woman to Woman concert to is married to whom?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0r8kcn8 .\n?c ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\nEXISTS {?y ns:people.marriage.from ?sk1 .\nEXISTS {?y ns:people.marriage.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Daniel Gibson"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Country: m.01mp | Ukrainian Greek Catholic Church: m.02cd38 | location.location : partially_contains, adjoin_s, people_born_here, contains, containedby | location.adjoining_relationship : adjoins | type.object : name, type | location.country : capital | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | common.topic : notable_types\n\n\nquestion:\n\nName the country next to Russia with the religious affiliation of the Ukrainian Greek Catholic Church.?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:religion.religious_leadership_jurisdiction.leader ?c .\n?c ns:religion.religious_organization_leadership.organization ns:m.02cd38 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ukraine"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMV Agusta USA LLC: m.09m_80k | location.location : containedby | organization.organization : headquarters, founders, date_founded, leadership, companies_acquired | organization.leadership : person | common.topic : notable_types | type.object : type | education.educational_institution : school_type, students_graduates | kg.object_profile : prominent_type | business.acquisition : company_acquired | government.government_office_or_title : office_holders | government.government_position_held : office_holder | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | sports.sports_team : sport, founded, roster | american_football.football_team : current_head_coach | location.mailing_address : citytown | sports.sports_team_roster : position | education.education : student | education.university : number_of_undergraduates | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhere is the headquarters of MV Agusta USA LLC?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.09m_80k .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Milwaukee"
    }
]