[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nToronto Maple Leafs: m.0j6tr | Testicular cancer: m.01rt5h | sports.sports_team : founded, championships, roster | sports.sports_team_roster : player, position | people.cause_of_death : parent_cause_of_death | sports.pro_athlete : teams, career_start | ice_hockey.hockey_team : coach, captain | medicine.notable_person_with_medical_condition : condition | people.person : nationality | type.object : type | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nWhich player on the Toronto Maple Leafs has testicular cancer?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0j6tr ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:medicine.notable_person_with_medical_condition.condition ns:m.01rt5h .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Phil Kessel"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUS State: m.0kpys4 | Tallahassee: m.0ftvz | common.topic : notable_types | location.location : time_zones, people_born_here, containedby | government.politician : government_positions_held | government.government_position_held : basic_title, office_position_or_title, from, jurisdiction_of_office, to | people.person : profession, nationality, place_of_birth, gender | kg.object_profile : prominent_type | type.object : type | people.deceased_person : cause_of_death, place_of_burial, place_of_death | location.us_state : capital | military.military_person : participated_in_conflicts\n\n\nquestion:\n\nWhat states bordering the US states with the capital named Tallahassee?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.us_state.capital ns:m.0ftvz .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Georgia, Alabama"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGloria al Bravo Pueblo: m.01kvg4 | government.form_of_government : countries | government.government_office_category : officeholders | government.government_position_held : office_holder, office_position_or_title, from, jurisdiction_of_office, to | architecture.structure : opened, height_meters | common.topic : notable_types | location.location : events, partially_containedby, contains, containedby | government.governmental_jurisdiction : governing_officials | geography.river : basin_countries | type.object : name, type | people.person : religion, profession, nationality, date_of_birth, gender | sports.sports_team : founded | government.politician : government_positions_held | time.event : includes_event, start_date | people.deceased_person : date_of_death, place_of_death | language.human_language : countries_spoken_in | base.culturalevent.event : entity_involved\n\n\nquestion:\n\nWhat are major events that happened in the country with national anthem Gloria al Bravo Pueblo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01kvg4 .\n?c ns:location.location.events ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": ", Battle of Santa Inés, 2014 Caribbean Earthquake, 2014 Festival Internacional de Cine Infantil y Juvenil, Dutch–Venezuelan crisis of 1908, Venezuelan War of Independence, Battle of La Victoria, Machurucuto Incident, 2007 RCTV protests, 2002 Venezuelan coup d'état attempt, Los Maniceros massacre, 2014–15 Venezuelan protests, 2014 NACAM Rally Championship, 12th G-15 summit, Dutch–Venezuela War, Venezuelan crisis of 1902–03, Bombardment of Fort San Carlos, 2011 ALBA Games, 2013 Venezuela Transaereo 5074 Britten-Norman Islander crash"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNina Dobrev: m.027nwk2 | location.country : official_language | location.statistical_region : population, consumer_price_index, gdp_real, foreign_direct_investment_net_inflows, long_term_unemployment_rate, size_of_armed_forces, gdp_growth_rate | measurement_unit.adjusted_money_value : adjusted_value | measurement_unit.dated_integer : number | location.location : contains, partially_contains | kg.object_profile : prominent_type | people.person : languages, nationality | government.governmental_jurisdiction : government_bodies, governing_officials | government.government_position_held : basic_title, office_holder | measurement_unit.dated_money_value : amount | measurement_unit.dated_percentage : rate | film.actor : film | film.performance : character | type.object : type | military.military_combatant : belongs_to_combatant_group\n\n\nquestion:\n\nWhat nation with a part time employment percentage of 1.6 is Nina Dobrev from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.027nwk2 ns:people.person.nationality ?x .\n?x ns:location.statistical_region.part_time_employment_percent ?c .\n?c ns:measurement_unit.dated_percentage.rate \"1.6\" .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Bulgaria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nState Elementary School Menteng 01: m.0280qps | location.location : time_zones, area, contains, containedby | type.object : type | common.topic : notable_types | people.person : education | kg.object_profile : prominent_type | education.education : degree | location.mailing_address : state_province_region | architecture.structure : height_meters\n\n\nquestion:\n\nThe individual who attended State Elementary School earned which higher education degrees?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0280qps .\n?c ns:people.person.education ?y .\n?y ns:education.education.degree ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Juris Doctor, Bachelor of Arts"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCleveland Cavaliers: m.0jm7n | location.location : contains, people_born_here | sports.sports_team_roster : player | music.artist : genre, track | sports.pro_athlete : teams, sports_played_professionally | people.person : religion, profession, nationality, education, place_of_birth, gender | influence.influence_node : influenced_by | film.actor : film | film.performance : film | music.lyricist : lyrics_written | award.award_nominee : award_nominations | award.award_nomination : nominated_for | media_common.netflix_genre : titles | basketball.basketball_player : player_statistics, position_s | basketball.basketball_player_stats : team | film.film_subject : films | education.education : institution | sports.pro_sports_played : sport, career_start | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : draft, team | periodicals.newspaper_circulation_area : newspapers | sports.sports_team : roster | film.film_location : featured_in_films | type.object : type\n\n\nquestion:\n\nWho did the Cleveland Cavaliers draft, which is the pro athlete who started his sports career on, or after the year of 2003?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jm7n ns:sports.professional_sports_team.draft_picks ?y .\n?y ns:sports.sports_league_draft_pick.player ?x .\n?x ns:sports.pro_athlete.career_start ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "JJ Hickson, Luke Jackson, Shannon Brown"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBilady, Bilady, Bilady: m.0d9nj_ | type.object : type | common.topic : notable_types | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | location.location : contains, containedby | people.person : profession, nationality, place_of_birth | kg.object_profile : prominent_type | fictional_universe.fictional_language : found_in_fictional_universe | location.country : official_language | architecture.structure : opened | government.politician : government_positions_held | government.government_position_held : basic_title, office_position_or_title | organization.organization : date_founded\n\n\nquestion:\n\nPeople from the country of the national anthem Bilady, Bilady, Bilady speak what language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.0d9nj_ .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Modern Standard Arabic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRed Sea Governorate: m.02d5mf | common.topic : notable_types | location.location : area, time_zones, people_born_here, partially_containedby, contains, containedby | aviation.airport : serves | architecture.building : floors | type.object : type | architecture.structure : opened, height_meters | kg.object_profile : prominent_type | location.country : currency_used, administrative_divisions | education.educational_institution : students_graduates | education.education : student\n\n\nquestion:\n\nWhat currency is used in the country with Red Sea Governorate?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02d5mf .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Egyptian pound"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBasketball: m.018w8 | Whammer: m.026nqqr | Shaquille O'Neal: m.012xdf | sports.sports_team : team_mascot, sport, championships, roster | sports.sports_team_roster : player, team, position | sports.pro_athlete : teams | basketball.basketball_team : head_coach | sports.professional_sports_team : owner_s | common.topic : notable_types | film.film_subject : films | media_common.netflix_title : netflix_genres | film.actor : film | film.performance : character, film | music.featured_artist : recordings | media_common.netflix_genre : titles | type.object : type | film.film : starring, music, subjects | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : team\n\n\nquestion:\n\nWhat basketball team did Shaq play for that has a team mascot named Whammer?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.sport ns:m.018w8 .\n?x ns:sports.sports_team.team_mascot ns:m.026nqqr .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Cleveland Cavaliers"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUTC−05:00: m.02_37z | Miami: m.0f2v0 | location.location : time_zones, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | time.time_zone : locations_in_this_time_zone | fictional_universe.fictional_setting : universe | periodicals.newspaper_circulation_area : newspapers | travel.tourist_attraction : near_travel_destination | kg.object_profile : prominent_type | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat is there to do and see in Miami, Florida, where the location time zone is UTCâ05:00?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f2v0 ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.02_37z .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Venetian Pool"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSpeaker of the United States House of Representatives: m.0cgqx | government.government_office_or_title : office_holders | government.government_position_held : office_holder, office_position_or_title, from, legislative_sessions, to, governmental_body | people.person : religion, height_meters, parents, nationality | government.politician : government_positions_held\n\n\nquestion:\n\nWhat is the name of the speaker of the house of representatives now through 2011, and held his govermental position from 1987-06-02?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0cgqx ns:government.government_office_or_title.office_holders ?y .\n?y ns:government.government_position_held.office_holder ?x .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from \"1987-06-02\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Nancy Pelosi"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMarriage: m.04ztj | El Rodeo School: m.04f1d50 | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.location : containedby, area, people_born_here, contains, partially_contains | location.country : official_language | type.object : type | people.marriage : type_of_union, spouse | people.person : spouse_s | geography.river : cities | common.topic : notable_types | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | organization.organization : founders | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | book.book_subject : works | film.film_subject : films\n\n\nquestion:\n\nWho is the husband of the famous person who went to El Rodeo School?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.04f1d50 .\n?c ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\nEXISTS {?y ns:people.marriage.from ?sk1 .\nEXISTS {?y ns:people.marriage.to ?sk3 .\n?y ns:people.marriage.from ?sk4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brad Pitt"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnwar Sadat: m.0d58h | type.object : type | fictional_universe.fictional_character : gender | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | kg.object_profile : prominent_type | government.politician : government_positions_held, party | government.political_party_tenure : party | government.government_position_held : basic_title, to, district_represented | people.deceased_person : place_of_burial, date_of_death | location.country : official_language\n\n\nquestion:\n\nWhat is the language people use for communication in the region where a governmental post was given to Anwar Sadat?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0d58h .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Modern Standard Arabic"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDmitry Medvedev: m.08wdkk | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, office_position_or_title, from | location.location : contains | government.government_office_category : officeholders | type.object : type | location.country : administrative_divisions | government.government_office_or_title : office_holders\n\n\nquestion:\n\nThe location that appointed Dmitry Medvedev to governmental position has what religions?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.08wdkk .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Russian Orthodox Church, Islam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrazilian real: m.03385m | time.time_zone : locations_in_this_time_zone | type.object : name, type | kg.object_profile : prominent_type | people.deceased_person : cause_of_death, date_of_death, place_of_death | government.government_office_category : officeholders | government.government_position_held : office_holder, basic_title, office_position_or_title, from, to | architecture.structure : opened, height_meters | symbols.name_source : namesakes | people.person : religion, profession, nationality, place_of_birth, gender | location.location : contains, containedby | government.politician : government_positions_held | location.country : currency_used, languages_spoken | biology.animal_breed : place_of_origin | geography.river : discharge, basin_countries | government.form_of_government : countries\n\n\nquestion:\n\nWhat languages are used in the country that uses Brazilian real as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.03385m .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Brazilian Portuguese, Portuguese Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMichael Oher: m.0h7q7b | Forward Rebels: m.03w9vh6 | people.person : profession, nationality, ethnicity, place_of_birth, gender | type.object : type | sports.sports_team : fight_song, sport, colors, roster | sports.sports_team_roster : player, team, position | common.topic : notable_types | american_football.football_team : current_head_coach, division | sports.pro_athlete : teams, sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start | sports.school_sports_team : school | kg.object_profile : prominent_type | american_football.football_player : position_s\n\n\nquestion:\n\nWhat team with fight song Forward Rebels that Michael Oher played for in 2009?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0h7q7b ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n?x ns:sports.sports_team.fight_song ns:m.03w9vh6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ole Miss Rebels football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nChrist Covenant Church: m.0_fm__m | James K. Polk: m.042f1 | government.political_appointer : appointees | government.government_position_held : basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | government.politician : government_positions_held, party | people.person : religion, profession, nationality, ethnicity, gender | type.object : type | religion.religion : deities, organizations, is_part_of | government.political_party_tenure : party | people.deceased_person : place_of_burial, date_of_death, place_of_death | symbols.name_source : namesakes | government.us_president : presidency_number, vice_president | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat religion did James K Polk follow and has a worship place at Christ Covenant Church?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.042f1 ns:people.person.religion ?x .\n?x ns:religion.religion.organizations ns:m.0_fm__m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Presbyterianism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nIsla de la Juventud: m.01rj40 | President: m.060c4 | government.governmental_jurisdiction : governing_officials | kg.object_profile : prominent_type | common.topic : notable_types | government.government_position_held : basic_title, office_holder | location.location : events, time_zones, people_born_here, contains, containedby | type.object : type | architecture.structure : opened | location.country : administrative_divisions\n\n\nquestion:\n\nWho was the 2012 leader of the country where Isal de la Juventud is?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01rj40 .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Raúl Castro"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nher majesty the queen: m.0d1_f | Central Time Zone: m.02fqwt | time.time_zone : locations_in_this_time_zone | location.statistical_region : consumer_price_index, co2_emissions_per_capita, gdp_real | location.location : time_zones, contains, people_born_here | measurement_unit.adjusted_money_value : adjusted_value | government.politician : government_positions_held | government.government_position_held : from | government.political_appointer : appointees | royalty.monarch : kingdom\n\n\nquestion:\n\nThe location of Central Time Zone is in what country ruled by Queen Elizabeth II?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0d1_f ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.jurisdiction_of_office ?x .\n?x ns:location.location.time_zones ns:m.02fqwt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belize, Canada"
    }
]