[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSony Overseas S.A.: m.072r9lb | location.location : containedby | type.object : type | common.topic : notable_types | kg.object_profile : prominent_type | organization.organization : place_founded, headquarters, date_founded | education.educational_institution : mascot, students_graduates | education.education : student | architecture.architect : structures_designed | sports.sports_team : founded, roster | sports.sports_team_roster : position | education.university : number_of_undergraduates | measurement_unit.dated_integer : number | travel.tourist_attraction : near_travel_destination | government.political_party : politicians_in_this_party | government.political_party_tenure : politician\n\n\nquestion:\n\nSony Overseas S.A. headquarters is a child organization located where?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.072r9lb .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Minato"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBenjamin Netanyahu: m.0fm2h | President: m.060c4 | sports.pro_athlete : sports_played_professionally, career_end | sports.pro_sports_played : sport | government.governmental_jurisdiction : governing_officials | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, jurisdiction_of_office, to, governmental_body | people.deceased_person : cause_of_death | people.person : religion, profession, nationality, education, date_of_birth, height_meters, place_of_birth, gender | type.object : type | government.political_appointer : appointees | kg.object_profile : prominent_type | education.education : institution\n\n\nquestion:\n\nWhose the president of the region, that appointed Benjamin Netanyahu to a governmental position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0fm2h .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Reuven Rivlin"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLyon: m.0dprg | Gulf War: m.018w0j | location.location : partially_contains, adjoin_s, events, people_born_here, partially_containedby, contains, containedby | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title, appointed_by | location.country : currency_formerly_used, second_level_divisions, administrative_divisions | base.culturalevent.event : entity_involved | location.adjoining_relationship : adjoins | time.event : end_date | food.beer_country_region : beers_from_here | media_common.netflix_genre : titles | common.topic : notable_types\n\n\nquestion:\n\nThe city/town of Lyon is locatedin what country we were fighting in the Gulf War?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.018w0j ns:military.military_conflict.combatants ?y .\n?y ns:military.military_combatant_group.combatants ?x .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0dprg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | Kennebunkport: m.01m78r | type.object : type | kg.object_profile : prominent_type | people.person : children, profession, height_meters | organization.organization : date_founded | common.topic : notable_types | location.location : containedby, contains, people_born_here | education.educational_institution : mascot, school_type, colors | film.film : release_date_s | film.film_regional_release_date : release_date | location.place_with_neighborhoods : neighborhoods | time.time_zone : locations_in_this_time_zone | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | book.book_subject : works | location.mailing_address : state_province_region | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : team\n\n\nquestion:\n\nWhere did the famous person who once lived in Kennebunkport attend college?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.01m78r .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University Yale"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1970 NBA Finals: m.0cs1x4 | type.object : type | sports.sports_team : championships | kg.object_profile : prominent_type | government.political_appointer : appointees | government.government_position_held : office_holder, to, from | government.political_district : representatives | location.location : time_zones, people_born_here, partially_containedby, contains, containedby | time.event : includes_event, end_date, start_date, instance_of_recurring_event | people.person : religion, profession, nationality, spouse_s, gender | architecture.structure : opened | military.military_person : service | military.military_service : unit | location.country : calling_code, languages_spoken | people.marriage : spouse | influence.influence_node : influenced_by, influenced | common.topic : notable_types | film.film_genre : films_in_this_genre | biology.animal_breed : place_of_origin | language.human_language : countries_spoken_in | government.governmental_jurisdiction : governing_officials\n\n\nquestion:\n\nWhen was the last time the team that won the 1970 NBA Finals win a championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.0cs1x4 .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.start_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1973 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMatt Barnes: m.07dr3v | 2009 NBA Finals: m.04gg8b0 | people.person : profession, nationality, ethnicity, height_meters, place_of_birth, gender | sports.sports_team : arena_stadium, colors, championships, roster | sports.sports_team_roster : player, team, position | award.award_nominee : award_nominations | award.award_nomination : award | time.event : start_date | common.topic : image, notable_types | basketball.basketball_team : head_coach | type.object : type | sports.professional_sports_team : owner_s | sports.sports_championship_event : champion, runner_up | sports.pro_athlete : teams, career_start | organization.organization : leadership | organization.leadership : person, role | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat team did Matt Barnes play on that won the 2009 NBA Finals?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07dr3v ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.championships ns:m.04gg8b0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Los Angeles Lakers"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCharlton Heston: m.0chsq | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally, career_start | people.deceased_person : cause_of_death, date_of_death | architecture.structure : opened, height_meters | government.politician : government_positions_held, party | government.political_party_tenure : party | type.object : type | location.location : containedby | film.film : release_date_s | film.film_regional_release_date : release_date | kg.object_profile : prominent_type | sports.pro_sports_played : sport | government.government_position_held : office_position_or_title, legislative_sessions, to\n\n\nquestion:\n\nWhat city was the birthplace of CHarlton Heston and a famous pro athelte who started their career in 2007?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0chsq ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:location.location.people_born_here ?c .\n?c ns:sports.pro_athlete.career_start \"2007\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Los Angeles"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSwiss Psalm: m.01jhkt | location.country : languages_spoken | people.person : religion, profession, nationality, date_of_birth, place_of_birth | type.object : type | location.location : time_zones, area, partially_containedby, containedby | geography.river : discharge, basin_countries | government.form_of_government : countries | kg.object_profile : prominent_type | influence.influence_node : influenced | government.government_office_category : officeholders | government.government_position_held : office_holder, jurisdiction_of_office | government.government_office_or_title : office_holders | film.film : written_by, film_art_direction_by | government.politician : government_positions_held | people.deceased_person : cause_of_death | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nWhich languages are spoken in the country whose national anthem is Swiss Psalm?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01jhkt .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, German Language, French, Romansh language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBristol Palin: m.04jg1kh | Bald eagle: m.01dx8 | education.educational_institution : mascot, school_type, students_graduates, colors | organization.organization : date_founded | people.person : profession, nationality, parents, education, gender | education.education : institution, student | type.object : type | education.school : nces_school_id, highest_grade_taught | common.topic : notable_types | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat educational institution with mascot named Bald Eagle did Briston Palin go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.04jg1kh ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.mascot ns:m.01dx8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "West Anchorage High School"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDeltaform Mountain: m.0300h5 | type.object : type | common.topic : notable_types | time.event : included_in_event | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, containedby | location.country : languages_spoken | architecture.structure : height_meters\n\n\nquestion:\n\nWhat location contains a portion of the Deltaform Mountain?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.partiallycontains ?k .\n?k ns:location.partial_containment_relationship.partially_contains ns:m.0300h5 .\n?c ns:base.aareas.schema.administrative_area.administrative_area_type ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Canadian province"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1960 Summer Olympics: m.0lbd9 | kg.object_profile : prominent_type | people.person : religion, quotations, profession, nationality, date_of_birth, place_of_birth, gender | people.deceased_person : cause_of_death, place_of_burial, place_of_death | film.film_genre : films_in_this_genre | location.location : time_zones, containedby, contains, people_born_here | common.topic : notable_types | film.film_subject : films | time.event : start_date, included_in_event | influence.influence_node : influenced_by, influenced | type.object : type | location.country : second_level_divisions | government.politician : government_positions_held | government.government_position_held : to | film.film_story_contributor : film_story_credits | medicine.disease : parent_disease | symbols.namesake : named_after | sports.sports_championship_event : runner_up | travel.transportation : transport_terminus | olympics.olympic_host_city : olympics_hosted\n\n\nquestion:\n\nWhat is the meaning of the name of the city that hosted the 1960 Summer Olympics?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:olympics.olympic_host_city.olympics_hosted ns:m.0lbd9 .\n?c ns:symbols.namesake.named_after ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Romulus and Remus"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nShaquille O'Neal: m.012xdf | Micky Arison: m.027f6w | location.location : contains, people_born_here | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.statistical_region : consumer_price_index, cpi_inflation_rate, population | location.country : second_level_divisions, administrative_divisions | measurement_unit.dated_integer : number | sports.pro_athlete : teams | sports.sports_team_roster : team | sports.professional_sports_team : owner_s | people.person : gender | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nWhat team owned by Micky Arison did Shaq play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.027f6w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Miami Heat"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUS State: m.0kpys4 | Pierre: m.0fw08 | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type | people.person : religion, children, profession, nationality, gender | location.location : people_born_here, containedby | government.politician : government_positions_held, party | government.political_party_tenure : party | government.government_position_held : basic_title, jurisdiction_of_office, to, governmental_body | people.deceased_person : place_of_death | education.university : number_of_postgraduates | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich 6 states border the location whose capital is known as Pierre?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.administrative_division.capital ?k .\n?k ns:location.administrative_division_capital_relationship.capital ns:m.0fw08 .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Iowa, Minnesota, Montana, Nebraska, North Dakota, Wyoming"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBirmingham: m.0k33p | travel.tourist_attraction : near_travel_destination | location.location : containedby, contains, people_born_here | zoos.zoo : opened | periodicals.newspaper_circulation_area : newspapers | government.governmental_jurisdiction : government | type.object : type | film.film_location : featured_in_films | travel.travel_destination : tourist_attractions\n\n\nquestion:\n\nWhat zoo in Birmingham, UK that opened in 1974?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0k33p ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:zoos.zoo.opened \"1974\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Birmingham Wildlife Conservation Park"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLaurentian Library: m.06hthb | location.location : time_zones, partially_containedby, containedby | type.object : type | influence.influence_node : influenced_by | common.topic : notable_types | kg.object_profile : prominent_type | architecture.architect : structures_designed\n\n\nquestion:\n\nWho inspired the architect who designed Laurentian Library?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:architecture.architect.structures_designed ns:m.06hthb .\n?c ns:influence.influence_node.influenced_by ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Giovanni Pico della Mirandola, Domenico Ghirlandaio, Lorenzo de' Medici, Melozzo da Forlì, Girolamo Savonarola, Donatello"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCalvinist college of Sárospatak: m.0k1bfwz | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | type.object : type | organization.organization : date_founded | common.topic : notable_types | location.location : containedby | sports.sports_team : sport, founded, roster | sports.sports_team_roster : position | people.person : profession | government.political_party : ideology, politicians_in_this_party | government.political_party_tenure : politician | government.governmental_body : members | government.government_position_held : office_holder | education.educational_institution : colors\n\n\nquestion:\n\nWhat did the famous person who went to Calvinist College of Sarospatak do?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0k1bfwz .\n?c ns:people.person.profession ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Lawyer, Politician"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSteely McBeam: m.02x0cyj | sports.sports_championship_event : championship, champion, runner_up | type.object : type | common.topic : notable_types | sports.sports_team : team_mascot, arena_stadium, championships | film.film_subject : films | kg.object_profile : prominent_type | american_football.football_coach : coaching_history | american_football.football_historical_coach_position : to, from | people.deceased_person : date_of_death, cause_of_death, place_of_burial, place_of_death | people.person : nationality | people.family : members | sports.sports_facility : teams | award.award_category : date_established | time.event : end_date, start_date, locations, instance_of_recurring_event | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | american_football.football_player : passing | american_football.player_passing_statistics : completions | architecture.structure : opened | location.location : events, people_born_here\n\n\nquestion:\n\nWhich years was the Superbowl won by the team whose mascot is Steely McBeam?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.02x0cyj .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XL, Super Bowl XLIII, Super Bowl IX, Super Bowl X, Super Bowl XIII, Super Bowl XIV, 2011 AFC Championship Game, 2009 AFC Championship Game, 2006 AFC Championship Game, 1996 AFC Championship Game"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEdward Devotion School: m.0ccg42 | type.object : type | kg.object_profile : prominent_type | location.location : containedby | organization.organization : date_founded, founders | education.educational_institution : students_graduates, colors | sports.sports_team : team_mascot, sport, founded, location | symbols.name_source : namesakes | symbols.namesake : named_after | people.deceased_person : place_of_burial | government.government_office_or_title : office_holders | government.government_position_held : basic_title, office_holder | common.topic : notable_types | education.university : number_of_postgraduates | measurement_unit.dated_integer : number | government.governmental_body : members | education.education : student | travel.tourist_attraction : near_travel_destination\n\n\nquestion:\n\nWhat is the burial place of the famous person who went to Edward Devotion school?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0ccg42 .\n?c ns:people.deceased_person.place_of_burial ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Arlington National Cemetery"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDarth Vader: m.0f2y0 | Senator Bana Breemu: m.0gzk5tq | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | music.artist : origin | film.film_genre : films_in_this_genre | location.location : contains, people_born_here | fictional_universe.fictional_character : character_created_by | location.statistical_region : population, cpi_inflation_rate | measurement_unit.dated_integer : number | film.film : starring, genre | film.performance : character, actor, film | media_common.netflix_genre : titles | location.country : second_level_divisions, administrative_divisions | film.film_character : portrayed_in_films | common.topic : notable_types | people.person : places_lived, children, nationality, gender | type.object : type | language.human_language : dialects, countries_spoken_in | film.actor : film | people.place_lived : location | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nWho played Darth Vadar in the film with a character named Bana Breemu?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.0gzk5tq .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0f2y0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hayden Christensen"
    }
]