[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPernambuco: m.01hdpp | common.topic : notable_types | location.location : time_zones, contains, containedby | type.object : type | people.person : gender | kg.object_profile : prominent_type | geography.river : origin | location.country : languages_spoken, administrative_divisions | music.artist : genre | film.film_subject : films\n\n\nquestion:\n\nPeople from the country that contains Pernambuco  speak what languages?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hdpp .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italian Language, Brazilian Portuguese, Portuguese Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSanto Domingo: m.0fthl | common.topic : notable_types | location.location : time_zones, people_born_here, partially_containedby, contains, containedby | kg.object_profile : prominent_type | type.object : type | film.film_location : featured_in_films | location.country : capital, currency_used | location.mailing_address : state_province_region\n\n\nquestion:\n\nWhat currency do they use in the country where the capital is Santo Domingo?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0fthl .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dominican peso"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLake Victoria: m.0jmt7 | Nairobi: m.05d49 | Country: m.01mp | location.country : official_language, capital, administrative_divisions, form_of_government | location.location : adjoin_s, contains, people_born_here | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | measurement_unit.dated_integer : number | type.object : name, type | biology.breed_origin : breeds_originating_here | location.adjoining_relationship : adjoins | kg.object_profile : prominent_type | common.topic : notable_types | sports.sport_country : athletic_performances | sports.competitor_competition_relationship : competitors\n\n\nquestion:\n\nWhat country bordering Lake Victoria has a capital called Nairobi?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jmt7 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.05d49 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kenya"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPearl Street Station: m.05rsh5 | location.location : events, time_zones, people_born_here, partially_containedby, contains, containedby | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | law.inventor : inventions | architecture.structure : opened | architecture.architect : structures_designed\n\n\nquestion:\n\nWhat work did the architect who designed Pearl Street Station do to contribute to the greater good?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:architecture.architect.structures_designed ns:m.05rsh5 .\n?c ns:law.inventor.inventions ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Movie camera, Quadruplex telegraph, Electric Power Distribution, Mimeograph, Phonograph, Incandescent light bulb, Carbon microphone, Phonograph cylinder"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSupreme leader: m.0h7p97k | Pyongyang: m.0cw5k | people.person : children, profession, height_meters, place_of_birth, gender | government.governmental_jurisdiction : government, governing_officials | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | common.topic : notable_types | government.government_office_category : officeholders | government.government_position_held : office_holder, office_position_or_title, from, jurisdiction_of_office | location.country : capital, currency_formerly_used, national_anthem, administrative_divisions | type.object : type | location.location : adjoin_s, time_zones, people_born_here, contains, containedby | government.politician : government_positions_held | location.adjoining_relationship : adjoins | government.national_anthem_of_a_country : anthem | kg.object_profile : prominent_type\n\n\nquestion:\n\nPyongyan is the capital of the country with what political leader?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0cw5k .\n?c ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.0h7p97k .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kim Jong-un"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUkrainian Orthodox Church of the Kyivan Patriarchate: m.05cx56 | location.location : containedby | type.object : type | education.educational_institution : school_type, students_graduates, colors | education.education : student | organization.organization : child, date_founded | common.topic : notable_types | kg.object_profile : prominent_type | architecture.structure : height_meters | location.country : capital | government.politician : government_positions_held | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | organization.organization_relationship : child | aviation.airline : airports_served | aviation.airline_airport_presence : cities_served | time.event : end_date\n\n\nquestion:\n\nWhat major cities are in the religious organization whose leadership is the Ukranian Orthodox Church of the Kyvian Patriarchate?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religious_leadership_jurisdiction.leader ?k .\n?k ns:religion.religious_organization_leadership.organization ns:m.05cx56 .\n?c ns:location.country.capital ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kiev"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLast Girl on Earth: m.09ghb6b | music.album : release_date | type.object : type | kg.object_profile : prominent_type | music.genre : albums | music.artist : album, concert_tours | film.film_character : portrayed_in_films | film.performance : actor, film | time.event : start_date | film.film : produced_by, starring | location.location : contains | people.deceased_person : date_of_death\n\n\nquestion:\n\nWhat was the new album called in 2012 of the artist who had a concert tour named Last Girl on Earth?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.09ghb6b .\n?c ns:music.artist.album ?x .\nEXISTS {?x ns:music.album.release_date ?sk1 .\nEXISTS {?x ns:music.album.release_date ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jump (Club Cheval Rap Remix), , , , Rockstar 101: The Remixes, Towards the Sun, Unapologetic, Loud Tour Live at the O2, Diamonds, Cockiness (Love It) Remix, Diamonds (remix), Talk That Talk, Birthday Cake, Devil in a Blue Dress"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCentral Division, Fiji: m.06xb9f | type.object : type | location.location : time_zones, events, containedby | kg.object_profile : prominent_type | common.topic : notable_types | architecture.building : floors | location.country : official_language, administrative_divisions | architecture.structure : opened | aviation.airport : serves\n\n\nquestion:\n\nPeople from the country that contains Central Division, Fiji speak what language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.06xb9f .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Fijian Language, English Language, Fiji Hindi"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNoelani Elementary School: m.0265r_n | location.location : containedby | kg.object_profile : prominent_type | type.object : type | award.award_category : date_established | common.topic : notable_types | organization.organization : place_founded, child, date_founded, parent | government.politician : government_positions_held | base.culturalevent.event : entity_involved | government.government_position_held : office_position_or_title, to | sports.sports_team : founded | organization.organization_relationship : child, parent | education.educational_institution : students_graduates | education.education : student | people.person : date_of_birth\n\n\nquestion:\n\nWhat other government offices did the person who went to Neolani Elementary School hold?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.0265r_n .\n?c ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.office_position_or_title ?x ;\nns:government.government_position_held.to ?d .  # the position has ended; not the current position\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United States Senator, Illinois State Senator"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | White House: m.081sq | location.location : people_born_here, contains, containedby | film.film_location : featured_in_films | education.educational_institution : school_type, colors | people.deceased_person : place_of_death | common.topic : notable_types | organization.organization : date_founded | kg.object_profile : prominent_type | type.object : type | education.education : institution | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, from | travel.travel_destination : tourist_attractions | people.person : education, date_of_birth, ethnicity | basketball.basketball_player : position_s | government.politician : government_positions_held | sports.sports_team_location : teams\n\n\nquestion:\n\nThe person who once lived in the White House attended what Universities?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.081sq .\n?c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Harvard Law School, Columbia University, Occidental College"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPrime minister: m.060bp | Japan: m.03_3d | people.person : religion, profession, gender | type.object : type | government.government_position_held : basic_title, from, to, jurisdiction_of_office | government.governmental_jurisdiction : governing_officials | government.politician : government_positions_held, party | government.political_party_tenure : party | location.statistical_region : cpi_inflation_rate | measurement_unit.dated_percentage : rate | people.deceased_person : cause_of_death, place_of_death\n\n\nquestion:\n\nWho was the prime minister in Japan in 2012 and held the position after 9-2-11?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03_3d ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.060bp .\nEXISTS {?y ns:government.government_position_held.from ?sk1 .\nEXISTS {?y ns:government.government_position_held.to ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Shinzō Abe"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThailand: m.07f1x | Kushinagar: m.01h0lq | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.country : languages_spoken, administrative_divisions, form_of_government | location.location : events, containedby, contains, people_born_here | religion.religion : deities, places_of_worship, types_of_places_of_worship, organizations, sacred_sites, beliefs | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita, places_exported_to | location.imports_and_exports : exported_to | kg.object_profile : prominent_type | book.book_subject : works | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhat religion with a sacred site of Kushinagar is in Thailand?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07f1x ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.sacred_sites ns:m.01h0lq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Buddhism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSwiss franc: m.01_h4b | french republic: m.0f8l9c | Country: m.01mp | location.administrative_division : country | location.location : containedby, events, people_born_here, contains, partially_contains | location.country : currency_used, form_of_government | kg.object_profile : prominent_type | type.object : name, type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, office_position_or_title | media_common.netflix_genre : titles | common.topic : notable_types | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | biology.breed_origin : breeds_originating_here | finance.currency : countries_used\n\n\nquestion:\n\nWhat country beside France uses the Swiss Franc currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0f8l9c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.01_h4b .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Switzerland"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGary Destefano: m.03wrs3k | government.politician : government_positions_held, party | government.government_position_held : jurisdiction_of_office, to, governmental_body | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.political_party_tenure : party | kg.object_profile : prominent_type | people.deceased_person : date_of_death | american_football.football_player : position_s | organization.organization : headquarters\n\n\nquestion:\n\nGary Destefano is a person in the organization operating in what country?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.03wrs3k .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.country ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "United States of America"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArmenia: m.0jgx | location.location : partially_containedby, contains, partially_contains | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | type.object : type | location.country : capital, languages_spoken, form_of_government | common.topic : notable_types | food.beer_country_region : beers_from_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, appointed_by | periodicals.newspaper_circulation_area : newspapers | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWhich nation had a CO2 emissions per capita at one time of 1961 metric tons and borders Armenia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jgx ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"1961\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkey"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLiberal Government of New Zealand: m.027ns_m | Japan: m.03_3d | government.political_appointer : appointees | government.government_position_held : office_holder, jurisdiction_of_office | government.governmental_jurisdiction : governing_officials | location.location : events, contains, people_born_here | sports.sports_team_location : teams | organization.organization_founder : organizations_founded | location.statistical_region : places_exported_to | location.imports_and_exports : exported_to | fictional_universe.fictional_setting : fictional_characters_born_here | location.country : languages_spoken, form_of_government\n\n\nquestion:\n\nWho does Japan import from who has a governmental position called the Liberal Government of New Zealand?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03_3d ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n?x ns:government.governmental_jurisdiction.governing_officials ?c .\n?c ns:government.government_position_held.appointed_by ns:m.027ns_m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Zealand"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\npeoples republic of china: m.0d05w3 | Central European Time Zone: m.02llzg | location.location : time_zones, containedby | kg.object_profile : prominent_type | common.topic : notable_types | type.object : type\n\n\nquestion:\n\nWhat country trades with China that is in Central European Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n{\nns:m.0d05w3 ns:location.statistical_region.places_exported_to ?y .\n?y ns:location.imports_and_exports.exported_to ?x .\n}\nUNION\n{\nns:m.0d05w3 ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Algeria"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nShwesandaw Pagoda, Pyay: m.02rr8c7 | type.object : type | common.topic : notable_types | religion.religion : places_of_worship, texts | location.location : time_zones, events, area, containedby | kg.object_profile : prominent_type | architecture.structure : height_meters | symbols.name_source : namesakes\n\n\nquestion:\n\nWhat is the holy book of the Pyay religion practiced at placed worship of Shwesandaw Pagoda?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.places_of_worship ns:m.02rr8c7 .\n?c ns:religion.religion.texts ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Pāli Canon, Dhammapada, Mahāyāna sūtras, Vimalakirti Sutra, Tibetan Buddhist canon, Chinese Buddhist canon, Śrīmālādevī Siṃhanāda Sūtra, Mahāvastu, Amitabha Sutra, Āgama, Gangōji Garan Engi, Uṣṇīṣa Vijaya Dhāraṇī Sūtra, Longchen Nyingthig, Nīlakaṇṭha Dhāraṇī"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPernambuco: m.01hdpp | kg.object_profile : prominent_type | type.object : type | location.location : time_zones, people_born_here, containedby | location.country : currency_used, administrative_divisions | common.topic : notable_types | architecture.structure : opened, height_meters | film.film : executive_produced_by\n\n\nquestion:\n\nThe country that contains Pernambuco uses what type of dollar?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.01hdpp .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brazilian real"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVietnam: m.01crd5 | Country: m.01mp | Renminbi: m.0hn4_ | location.location : contains, people_born_here | finance.currency : countries_used | location.statistical_region : size_of_armed_forces, places_exported_to | measurement_unit.dated_integer : number | location.imports_and_exports : exported_to | common.topic : notable_types | location.country : currency_used | type.object : name\n\n\nquestion:\n\nWhat country bordering Vietnam uses the Renminbi as its currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01crd5 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.currency_used ns:m.0hn4_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | West Africa: m.0hqjh | Enugu: m.02ttyh | location.location : events, contains, people_born_here | location.country : currency_formerly_used, currency_used, administrative_divisions, capital, languages_spoken, form_of_government | kg.object_profile : prominent_type | location.statistical_region : size_of_armed_forces, net_migration | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | type.object : name, type | common.topic : notable_types\n\n\nquestion:\n\nWhat West African country has a capital called Enugu?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hqjh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.02ttyh .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Biafra"
    }
]