[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGod in Islam: m.09kb_2 | people.person : religion, profession, nationality, place_of_birth, gender | government.politician : government_positions_held | government.government_position_held : basic_title, to, from, jurisdiction_of_office | type.object : type | government.political_appointer : appointees | people.deceased_person : cause_of_death, place_of_death | architecture.structure : opened | common.topic : notable_types | religion.religion : deities, beliefs | film.film_location : featured_in_films | influence.influence_node : influenced_by\n\n\nquestion:\n\nThe Islam people with religious beliefs in God pray to who?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.beliefs ns:m.09kb_2 .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ramdev Pir, God, Allah"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBeatrix of the Netherlands: m.0ktnm | government.politician : government_positions_held, party | type.object : type | government.government_position_held : office_holder, district_represented, basic_title, office_position_or_title, from, jurisdiction_of_office, to, governmental_body | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | military.military_person : participated_in_conflicts | location.country : currency_used | award.award_nominee : award_nominations | people.deceased_person : cause_of_death, place_of_death | government.political_appointer : appointees | government.political_party_tenure : party | organization.organization : date_founded | location.location : partially_containedby\n\n\nquestion:\n\nWhat is the money used in the area where Beatrix of the Netherlands holds a government position?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0ktnm .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Aruban florin"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nnfl super bowl: m.06x5s | Super Bowl XLII: m.04myq1 | sports.sports_championship : events | time.recurring_event : date_of_first_occurance, instances | time.event : start_date | sports.sports_championship_event : championship, champion\n\n\nquestion:\n\nWhich Super Bowls were won by the football organization that claimed victory in the Super Bowl XLII championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.04myq1 .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.championship ns:m.06x5s .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XLVI, Super Bowl XLII, Super Bowl XXI, Super Bowl XXV"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Cornell Progressive: m.080vmq | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | common.topic : notable_types | organization.organization : headquarters, date_founded, child, founders, leadership | organization.organization_relationship : child | sports.sports_team_location : teams | education.educational_institution : mascot, school_type, colors, newspaper, sports_teams, students_graduates | education.education : student | fictional_universe.school_in_fiction : students_graduates | periodicals.newspaper_circulation_area : newspapers | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, office_position_or_title | type.object : type | location.location : nearby_airports, time_zones, people_born_here, contains, containedby | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | organization.leadership : person, role | kg.object_profile : prominent_type | symbols.namesake : named_after\n\n\nquestion:\n\nWhat city is the university which publishes the Cornell Progressive located in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.newspaper ns:m.080vmq .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ithaca"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLast Girl on Earth: m.09ghb6b | music.album : release_date | music.artist : album, concert_tours | people.person : nationality, place_of_birth, gender | award.award_category : date_established | film.film_character : portrayed_in_films | film.performance : film | type.object : type | people.ethnicity : languages_spoken | film.film : executive_produced_by | people.deceased_person : place_of_death | time.event : start_date | music.genre : albums | organization.organization : founders\n\n\nquestion:\n\nWhere was the artist born and raised who had the concert tour named Last Girl on Earth?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.09ghb6b .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Saint Michael Parish"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGrambling Tiger: m.0jsmgg8 | Doug Williams: m.0443ql | type.object : type | people.person : children, profession, nationality, ethnicity, gender | sports.sports_team : team_mascot, sport, colors, roster | sports.sports_team_roster : player, team, position | american_football.football_team : division | sports.school_sports_team : school | sports.pro_athlete : teams, sports_played_professionally | american_football.football_player : position_s | common.topic : notable_types | sports.pro_sports_played : sport | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat team with then Grambling Tiger mascot did Doug Williams play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0443ql ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.team_mascot ns:m.0jsmgg8 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Grambling State Tigers football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nrussian: m.06bnz | Umar: m.0kw7v | location.location : contains | people.deceased_person : place_of_burial | religion.religion : notable_figures, beliefs | location.country : form_of_government\n\n\nquestion:\n\nWhat religion in Russia has Umar as a figure?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06bnz ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n?x ns:religion.religion.notable_figures ns:m.0kw7v .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Islam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCountry: m.01mp | West Africa: m.0hqjh | location.location : partially_contains, adjoin_s, people_born_here, contains, containedby | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder | location.country : languages_spoken, form_of_government | common.topic : notable_types | type.object : type | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat West African countries once had CO2 emissions per capita  of 2009 metric ton?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hqjh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.statistical_region.co2_emissions_per_capita ?c .\n?c ns:measurement_unit.dated_metric_ton.date \"2009\"^^xsd:dateTime .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Benin, Burkina Faso, Ghana, Guinea, Guinea-Bissau, Liberia, Mali, Mauritania, Nigeria, Sierra Leone, Senegal, Togo, Ivory Coast, Gambia"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAl Sharqia Governorate: m.02d5r_ | common.topic : notable_types | type.object : type | location.country : administrative_divisions, languages_spoken, form_of_government | location.location : time_zones, people_born_here, containedby | kg.object_profile : prominent_type | architecture.structure : height_meters\n\n\nquestion:\n\nPeople from the country that includes Al Sharqia Governorate speak what language?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02d5r_ .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Siwi Language, Modern Standard Arabic, Egyptian Arabic, Sa'idi Arabic, Arabic, Sudanese Spoken Language, Bedawi Arabic, Nobiin Language, Domari Language, Arabic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHouston: m.03l2n | Central Time Zone: m.02fqwt | location.country : second_level_divisions, administrative_divisions | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.location : time_zones, people_born_here, contains, containedby | time.time_zone : locations_in_this_time_zone | location.statistical_region : population | measurement_unit.dated_integer : number | type.object : type | travel.travel_destination : tourist_attractions | amusement_parks.park : opened, rides | common.topic : notable_types\n\n\nquestion:\n\nName two tourist attractions in the central time zone which are also in Houston, Texas.?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03l2n ns:travel.travel_destination.tourist_attractions ?x .\n?x ns:location.location.time_zones ns:m.02fqwt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kemah Boardwalk, Wet'n'Wild SplashTown"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUK constituent country: m.0hzjlmp | Cardiff: m.01s3v | United Kingdom: m.07ssc | people.person : religion, profession, nationality, place_of_birth, gender | location.location : partially_contains, contains, people_born_here | people.deceased_person : date_of_death | government.politician : government_positions_held | government.government_position_held : basic_title, from, governmental_body | time.time_zone : locations_in_this_time_zone | type.object : type | music.artist : genre | kg.object_profile : prominent_type | location.country : capital, administrative_divisions | common.topic : notable_types | government.governmental_jurisdiction : government | biology.breed_origin : breeds_originating_here\n\n\nquestion:\n\nWhat country in the UK has the capital Cardiff?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:base.aareas.schema.administrative_area.administrative_children ?x .\n?x ns:base.aareas.schema.administrative_area.administrative_area_type ns:m.0hzjlmp .\n?x ns:location.country.capital ns:m.01s3v .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wales"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMichael Jordan: m.054c1 | North Carolina Tar Heels men's basketball: m.026xxv_ | people.person : profession, nationality, ethnicity, education, spouse_s, place_of_birth, gender | type.object : type | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | people.marriage : spouse, location_of_ceremony | education.education : institution | education.educational_institution : mascot, school_type, colors, newspaper, sports_teams | film.actor : film | film.performance : film | location.location : containedby | sports.drafted_athlete : drafted | sports.sports_league_draft_pick : school, team | film.film_subject : films | sports.pro_athlete : teams, career_start, career_end | sports.sports_team_roster : team | organization.organization : date_founded | common.topic : notable_types | business.sponsored_recipient : sponsorship | business.sponsorship : sponsored_by | kg.object_profile : prominent_type | sports.sports_team : sport, colors | sports.sports_team_owner : teams_owned\n\n\nquestion:\n\nWhat school Michael Jordan attended is the educational institution that has a sports team called North Carolina Tar Heels men's basketball?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.054c1 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.026xxv_ .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of North Carolina at Chapel Hill"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Vintage Tour: m.03d7q30 | kg.object_profile : prominent_type | people.person : profession, nationality, ethnicity, height_meters, place_of_birth, gender | architecture.structure : opened, height_meters | book.book_edition : publication_date | type.object : type | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport, career_start | location.location : time_zones, containedby | people.deceased_person : date_of_death | music.artist : concert_tours | government.politician : government_positions_held | government.government_position_held : office_holder, office_position_or_title, to | film.film : written_by, genre | common.topic : notable_types\n\n\nquestion:\n\nThe artist of The Vintage Tour grew up in what location?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.03d7q30 .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Sevierville"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Country: m.01mp | Colorado River: m.018qjq | location.location : events, contains, people_born_here | measurement_unit.dated_percentage : rate | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | government.governmental_jurisdiction : governing_officials, official_symbols | government.government_position_held : office_holder | location.place_with_neighborhoods : neighborhoods | location.location_symbol_relationship : Kind_of_symbol | symbols.namesake : named_after | location.country : official_language, calling_code, administrative_divisions | time.time_zone : locations_in_this_time_zone | geography.river : basin_countries | food.beer_country_region : beers_from_here | common.topic : notable_types | type.object : name\n\n\nquestion:\n\nWhich country partially containing the Colorado River border the US?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.09c7w0 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.partiallycontains ?c .\n?c ns:location.partial_containment_relationship.partially_contains ns:m.018qjq .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mexico"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDivision I (NCAA): m.031fsz | American football team: m.01xljyt | sports.sports_team : founded, league, colors, team_mascot, sport, roster | american_football.football_team : current_head_coach, division | type.object : type | common.topic : notable_types | sports.school_sports_team : school | award.award_nominee : award_nominations | sports.sports_league_participation : league | film.film_subject : films | sports.sports_team_roster : player\n\n\nquestion:\n\nDivision I (NCAA) football organization has how many teams?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.child ?k .\n?k ns:organization.organization_relationship.child ns:m.031fsz .\n?c ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n?x ns:common.topic.notable_types ns:m.01xljyt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Stanford Cardinal football, USC Trojans football, Miami Hurricanes football, Auburn Tigers football, Nebraska Cornhuskers football, Oregon Ducks football, LSU Tigers football, Ohio State Buckeyes football, Penn State Nittany Lions football, Michigan Wolverines football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnkara: m.0jyw | kg.object_profile : prominent_type | location.location : time_zones, contains, containedby | architecture.structure : opened | type.object : type | location.country : currency_used, capital | common.topic : notable_types | people.person : profession\n\n\nquestion:\n\nThe capital of Ankara is part of the country with what currency?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.0jyw .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Turkish lira"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nManny Ramirez: m.06tjlc | Stomper: m.038kfp | sports.sports_team : arena_stadium, founded, league, colors, team_mascot, location, sport, previously_known_as, championships, roster | sports.sports_league_participation : league | common.topic : notable_types | sports.pro_athlete : teams, career_start | sports.sports_team_roster : player, team, position | type.object : type | people.person : profession, nationality, place_of_birth, gender | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat team did Manny Ramirez play for that has a mascot named Stomper?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06tjlc ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.team_mascot ns:m.038kfp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Oakland Athletics"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHanoi: m.0fnff | Country: m.01mp | Cambodia: m.01xbgx | location.country : currency_used, official_language, capital, languages_spoken, form_of_government | location.statistical_region : size_of_armed_forces, co2_emissions_per_capita | measurement_unit.dated_integer : number | location.location : people_born_here, events, contains, containedby | common.topic : notable_types | time.time_zone : locations_in_this_time_zone | media_common.netflix_genre : titles | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title | military.military_combatant : casualties | military.casualties : military_conflict | type.object : name\n\n\nquestion:\n\nWhat country bordering Cambodia has Hanoi as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01xbgx ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.country.capital ns:m.0fnff .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Vietnam"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of Russia: m.01ptxd | Country: m.01mp | location.location : containedby | kg.object_profile : prominent_type | common.topic : notable_types | people.person : place_of_birth, gender | architecture.structure : height_meters | education.educational_institution : school_type | geography.river : mouth, basin_countries | type.object : type | people.ethnicity : geographic_distribution | aviation.airport : serves\n\n\nquestion:\n\nWhat are bordering countries of the country that has National Anthem of Russia?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.01ptxd .\n?c ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Belarus, Estonia, Finland, Kazakhstan, Latvia, Lithuania, Mongolia, Norway, North Korea, Poland, Ukraine, China, Georgia, Azerbaijan"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSecretary of State: m.0789n | Andrew Jackson: m.0rlz | government.politician : government_positions_held | type.object : type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, basic_title, office_position_or_title, from, to | people.person : nationality, gender | location.location : contains, people_born_here | government.political_appointer : appointees | location.country : second_level_divisions | government.government_office_category : officeholders | people.deceased_person : cause_of_death, place_of_burial\n\n\nquestion:\n\nWho was the Secretary of State when Andrew Jackson was the president?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0rlz ns:government.political_appointer.appointees ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.0789n .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Edward Livingston"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLyon: m.0dprg | Gulf War: m.018w0j | location.location : partially_contains, events, contains, people_born_here | location.country : second_level_divisions, administrative_divisions | type.object : type | government.governmental_jurisdiction : government_bodies, governing_officials | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | government.government_position_held : basic_title, office_holder | media_common.netflix_genre : titles | book.book_subject : works | military.military_conflict : casualties | military.casualties : lower_estimate | organization.organization_founder : organizations_founded | common.topic : image\n\n\nquestion:\n\nLyon is the city/town of which location which fought in the Gulf War in 1991?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.018w0j ns:military.military_conflict.combatants ?y .\n?y ns:military.military_combatant_group.combatants ?x .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0dprg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    }
]