[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSugimoto: m.010bq87w | Omar Epps: m.02_tv5 | film.film : produced_by, language, release_date_s, written_by, country, initial_release_date, starring, genre, directed_by | film.actor : film | film.performance : character, actor, film | people.person : profession, nationality, ethnicity, place_of_birth, gender | film.film_regional_release_date : film_regional_debut_venue, release_date | media_common.netflix_title : netflix_genres | type.object : type | film.film_character : portrayed_in_films | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhat movie with a character named Sugimoto was Omar Epps in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02_tv5 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.010bq87w .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brother"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational Anthem of the Islamic Republic of Iran: m.02lwm6 | time.event : locations | language.human_language : language_family, main_country, countries_spoken_in | people.person : religion, profession, nationality, place_of_birth, gender | biology.animal_breed : place_of_origin | people.deceased_person : cause_of_death, date_of_death, place_of_death | location.country : official_language | government.governmental_body : members | government.government_position_held : basic_title, office_holder, governmental_body | government.politician : government_positions_held | base.culturalevent.event : entity_involved | type.object : name, type | government.form_of_government : countries | finance.currency : countries_used | government.government_office_category : officeholders | common.topic : notable_types | location.location : contains | geography.river : basin_countries\n\n\nquestion:\n\nWhat is that national language of the country with National Anthem of the Islamic Republic of Iran?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.02lwm6 .\n?c ns:location.country.official_language ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Persian Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSwitzerland: m.06mzp | Country: m.01mp | the eternal city: m.06c62 | location.country : capital | time.time_zone : locations_in_this_time_zone | type.object : name, type | location.location : time_zones, containedby, contains, people_born_here | common.topic : notable_types | people.person : profession | fictional_universe.fictional_setting : languages | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | film.film : country | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number\n\n\nquestion:\n\nOf the 5 countries bordering Switzerland, which one contains the Rome?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06mzp ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.06c62 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Italy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1994 NBA Finals: m.08x9cq | people.person : profession, nationality, place_of_birth | type.object : type | location.location : containedby, time_zones, people_born_here, contains, partially_contains | finance.currency : countries_used | book.book_subject : works | time.event : locations, start_date, end_date, includes_event, included_in_event | government.form_of_government : countries | sports.sports_team : team_mascot, championships | kg.object_profile : prominent_type | government.governmental_body : members | government.government_position_held : office_holder, from | people.deceased_person : cause_of_death, date_of_death | sports.sports_championship_event : championship | government.governmental_jurisdiction : governing_officials | location.administrative_division : country | government.political_appointer : appointees | government.government_office_category : officeholders | base.culturalevent.event : entity_involved | location.country : official_language\n\n\nquestion:\n\nThe 1994 NBA Finals championship winning team has what as its mascot?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.08x9cq .\n?c ns:sports.sports_team.team_mascot ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Clutch"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNational anthem of South Africa: m.07lzg | people.person : profession, nationality, place_of_birth, gender | music.group_member : instruments_played | type.object : type | architecture.structure : opened, height_meters | government.politician : government_positions_held | people.deceased_person : date_of_death, place_of_death | government.government_position_held : office_holder, basic_title, from, jurisdiction_of_office, appointed_by, governmental_body | location.statistical_region : co2_emissions_per_capita | measurement_unit.dated_metric_ton : number | location.location : containedby | fictional_universe.fictional_language : found_in_fictional_universe | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | kg.object_profile : prominent_type | government.governmental_body : members | sports.sports_championship_event : champion | film.film : genre\n\n\nquestion:\n\nWhat continent is in the country that has national anthem of South Africa?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.07lzg .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Africa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nRed Sea Governorate: m.02d5mf | location.location : time_zones, people_born_here, containedby | travel.tourist_attraction : near_travel_destination | common.topic : notable_types | location.country : administrative_divisions, form_of_government | kg.object_profile : prominent_type | zoos.zoo : opened | type.object : type | architecture.building : floors | architecture.structure : opened, height_meters\n\n\nquestion:\n\nThe nation with Red Sea Governorate located in it has which kind of government?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.02d5mf .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Semi-presidential system, Provisional government"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLibra Tour: m.0gvqybt | location.location : people_born_here, contains, containedby | media_common.netflix_genre : titles | film.film_character : portrayed_in_films | film.performance : actor | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | type.object : type | music.genre : albums | kg.object_profile : prominent_type | organization.organization : date_founded | film.film_job : films_with_this_crew_job | film.film_crew_gig : crewmember | music.instrument : family | people.person : profession, place_of_birth | music.artist : genre, concert_tours | location.statistical_region : religions | location.religion_percentage : religion | book.book_subject : works | time.event : end_date\n\n\nquestion:\n\nWhere was the artist born and raised that had a concert tour named Libra Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.0gvqybt .\n?c ns:people.person.place_of_birth ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Severn"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLao kip: m.04k4j1 | Vietnam War: m.07_nf | film.film_subject : films | base.culturalevent.event : entity_involved | military.military_conflict : casualties, combatants | military.military_combatant_group : combatants | location.statistical_region : places_imported_from, major_exports, size_of_armed_forces | location.imports_and_exports : imported_from | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.country : languages_spoken, currency_used, administrative_divisions | military.casualties : lower_estimate | measurement_unit.dated_integer : number | common.topic : notable_types | time.event : locations | type.object : type | location.location : adjoin_s, contains, partially_contains | location.imports_exports_by_industry : industry | location.adjoining_relationship : adjoins | finance.currency : countries_used\n\n\nquestion:\n\nWhere was the location of the Vietnam War where the currency used is the Lao kip?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07_nf ns:time.event.locations ?x .\n?x ns:location.country.currency_used ns:m.04k4j1 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Laos"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAl-Masjid an-Nabawi: m.024902 | Marriage: m.04ztj | people.person : spouse_s | people.marriage : type_of_union, spouse | type.object : type | location.location : events, containedby, contains, people_born_here | kg.object_profile : prominent_type | location.country : capital, form_of_government | architecture.architect : structures_designed | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder\n\n\nquestion:\n\nWho was the first wife of the architect who designed Al0Masjid an-Nabawi?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:architecture.architect.structures_designed ns:m.024902 .\n?c ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\n?y ns:people.marriage.from ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Khadīja bint Khuwaylid"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLand der Berge, Land am Strome: m.019vwj | people.person : religion, profession, nationality, parents, place_of_birth, gender | location.location : time_zones, partially_containedby, containedby | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, jurisdiction_of_office | language.human_language : iso_639_1_code, countries_spoken_in | common.topic : notable_types | people.deceased_person : cause_of_death, place_of_death | music.artist : genre | influence.influence_node : influenced_by | government.governmental_jurisdiction : governing_officials | music.group_member : instruments_played | location.country : capital | finance.currency : countries_formerly_used | geography.river : basin_countries | military.military_person : participated_in_conflicts | law.invention : inventor\n\n\nquestion:\n\nWhat is the capital of the country whose national anthem is Land der Berge, Land am Strome?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.019vwj .\n?c ns:location.country.capital ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Vienna"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTyler Crowley: m.05m1x3_ | Bella Swan: m.027b7y9 | film.film_character : portrayed_in_films | film.performance : character, actor, film | film.film_genre : films_in_this_genre | tv.tv_character : appeared_in_tv_program | tv.regular_tv_appearance : actor | type.object : type | media_common.netflix_genre : titles | location.location : contains, people_born_here | people.person : religion, profession, nationality | film.film : starring, subjects, release_date_s | award.award_nominee : award_nominations | award.award_nomination : nominated_for | fictional_universe.fictional_character : character_created_by, gender | film.film_story_contributor : film_story_credits | book.book_character : appears_in_book | language.human_language : main_country | common.topic : notable_types | film.music_contributor : film | kg.object_profile : prominent_type | film.film_regional_release_date : release_date | book.book_subject : works | film.producer : film | government.politician : government_positions_held | religion.religion : sacred_sites | film.actor : film\n\n\nquestion:\n\nWho plays the character Bella in the movie where Typr Crowley is a character?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:film.film.starring ?k .\n?k ns:film.performance.character ns:m.05m1x3_ .\n?c ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.027b7y9 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Kristen Stewart, Catherine Grimme"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAndrew Cuomo: m.02pjpd | Fordham Rams men's basketball: m.05ghxxz | type.object : type | education.educational_institution : school_type, students_graduates, sports_teams | education.education : institution, student, degree | people.person : religion, profession, nationality, parents, education, place_of_birth, gender | location.location : containedby | government.politician : government_positions_held, party | government.political_party_tenure : party | government.political_appointer : appointees | government.government_position_held : basic_title, to, office_position_or_title, from, jurisdiction_of_office, appointed_by, governmental_body | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | organization.organization : headquarters, founders, date_founded | film.film_location : featured_in_films | kg.object_profile : prominent_type | basketball.basketball_team : head_coach | sports.school_sports_team : school | sports.sports_team : sport, colors | common.topic : notable_types\n\n\nquestion:\n\nWhat college did Chris Cuomo attend that has a sports team named Fordham Rams Men's Basketball?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02pjpd ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.05ghxxz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Fordham University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nLyon: m.0dprg | Country: m.01mp | Tomtom Nv: m.03p3m2y | location.location : time_zones, contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder, appointed_by | location.statistical_region : population, cpi_inflation_rate | measurement_unit.dated_integer : number | common.topic : notable_types | measurement_unit.dated_percentage : rate | organization.organization_founder : organizations_founded | type.object : name | base.schemastaging.organization_extra : phone_number | base.schemastaging.phone_sandbox : service_location\n\n\nquestion:\n\nThe city/town of Lyon is in what country containing Tomtom Western Europe?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.03p3m2y ns:base.schemastaging.organization_extra.phone_number ?y .\n?y ns:base.schemastaging.phone_sandbox.service_location ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.contains ?c .\n?c ns:location.mailing_address.citytown ns:m.0dprg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "France"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHeard and McDonald Islands Time Zone: m.0y49btq | type.object : type | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | influence.influence_node : influenced_by | location.location : time_zones, containedby | architecture.structure : opened | government.politician : government_positions_held | government.government_position_held : from, jurisdiction_of_office | government.form_of_government : countries | time.event : locations | common.topic : notable_types | people.deceased_person : date_of_death\n\n\nquestion:\n\nWhat are the religions in the location in Heard and McDonald Islands Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.location.time_zones ns:m.0y49btq .\n?c ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Buddhism, Catholicism, Islam, Anglicanism"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nUnited States of America: m.09c7w0 | Honolulu County: m.03fb3t | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, containedby | type.object : type | government.political_district : representatives | base.culturalevent.event : entity_involved | government.government_position_held : office_holder, from, jurisdiction_of_office | people.person : profession, height_meters, place_of_birth, gender | common.topic : notable_types | film.film : genre | american_football.football_player : position_s | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.politician : government_positions_held | location.us_state : capital\n\n\nquestion:\n\nWho are the senators in 2012 of the US state that has Honolulu as its capital?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.us_state.capital ns:m.03fb3t .\n?c ns:government.political_district.representatives ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.jurisdiction_of_office ns:m.09c7w0 .\n?y ns:government.government_position_held.from ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mazie Hirono"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nNobel Peace Prize: m.05f3q | people.person : religion, profession, nationality, places_lived, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | award.award_winner : awards_won | award.award_honor : award | organization.organization : date_founded, founders | type.object : type | government.politician : government_positions_held | government.government_position_held : basic_title, to, from | base.activism.activist : area_of_activism | media_common.dedicator : dedications | media_common.dedication : work_dedicated | government.political_appointer : appointees | people.deceased_person : place_of_death | people.place_lived : location\n\n\nquestion:\n\nWho won the noble peace prize in 2007 and held his governmental position from 1-3-1977?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05f3q ns:award.award_category.winners ?y .\n?y ns:award.award_honor.award_winner ?x .\nEXISTS {?y ns:award.award_honor.year ?sk1 .\nEXISTS {?y ns:award.award_honor.year ?sk3 .\n?x ns:government.politician.government_positions_held ?c .\n?c ns:government.government_position_held.from ?num .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Al Gore"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nOxford University Ice Hockey Club: m.027jjlh | Theodore Lesieg: m.02g3w | book.author : works_written | education.educational_institution : school_type, students_graduates, sports_teams, newspaper | education.education : institution, student | people.person : education, profession, place_of_birth | common.topic : notable_types | sports.sports_team : sport | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | location.location : nearby_airports | type.object : type | sports.school_sports_team : school | film.film_story_contributor : film_story_credits | book.illustrator : books_illustrated | award.award_nominee : award_nominations | award.award_nomination : nominated_for | influence.influence_node : influenced | military.military_person : participated_in_conflicts\n\n\nquestion:\n\nWhat educational institution that has a sports team named Oxford University Ice Hockey Club did Dr. Seuss go to?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02g3w ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.027jjlh .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "University of Oxford"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFreddie Falcon: m.09qbbm | Placekicker: m.047g8h | sports.pro_athlete : teams, sports_played_professionally | sports.sports_team : team_mascot, roster | sports.sports_team_roster : player, position, from, team, to | people.person : profession | type.object : type | american_football.football_player : passing, position_s | common.topic : image | kg.object_profile : prominent_type | sports.pro_sports_played : sport | time.event : instance_of_recurring_event | sports.sports_championship_event : champion | location.location : people_born_here | american_football.player_passing_statistics : completions\n\n\nquestion:\n\nWho is the kicker for the team whose mascot is Freddie Falcon?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.team_mascot ns:m.09qbbm .\n?c ns:sports.sports_team.roster ?y .\n?y ns:sports.sports_team_roster.player ?x .\n?y ns:sports.sports_team_roster.position ns:m.047g8h .\nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 .\nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Matt Bryant"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBill Richardson: m.020z31 | Santa Fe: m.0f25y | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.location : contains, people_born_here | people.person : religion | location.statistical_region : size_of_armed_forces, part_time_employment_percent | measurement_unit.dated_integer : number | measurement_unit.dated_percentage : rate | location.us_state : capital\n\n\nquestion:\n\nWhat US State with a capital named Santa Fe does Bill Richardson live in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.020z31 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:location.us_state.capital ns:m.0f25y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Mexico"
    }
]