[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGeorge Washington Colonials men's basketball: m.03d0l76 | sports.school_sports_team : school | type.object : type | sports.sports_team : arena_stadium, founded, colors, location, sport, roster | education.educational_institution : sports_teams | sports.pro_athlete : teams, career_start | sports.sports_team_roster : player, team, position | people.person : gender | common.topic : notable_types | basketball.basketball_team : head_coach | sports.defunct_sports_team : later_known_as | kg.object_profile : prominent_type | film.film_subject : films | organization.organization : headquarters, date_founded | location.location : containedby\n\n\nquestion:\n\nWhat state is home to the university that is represented in sports by George Washington Colonials men's basketball?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.03d0l76 .\n?c ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.state_province_region ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Washington, D.C."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nnfl super bowl: m.06x5s | The Baltimore Fight Song: m.0hn47qp | type.object : type | sports.sports_team : fight_song, team_mascot, championships, roster | sports.sports_championship_event : championship | location.location : containedby, contains, people_born_here | sports.sports_championship : events | time.recurring_event : instances | film.film_subject : films | location.citytown : postal_codes | american_football.football_player : position_s | periodicals.newspaper_circulation_area : newspapers | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.person : profession\n\n\nquestion:\n\nWhat year did the team with Baltimore Fight Song win the Superbowl?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.fight_song ns:m.0hn47qp .\n?c ns:sports.sports_team.championships ?x .\n?x ns:sports.sports_championship_event.championship ns:m.06x5s .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Super Bowl XLVII, Super Bowl XXXV"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEmmitt Smith: m.01480y | The Orange and Blue: m.04f__h7 | american_football.football_team : current_head_coach, division | type.object : type | people.person : profession, nationality, ethnicity, height_meters, gender | film.actor : film | film.performance : film | sports.pro_athlete : teams, sports_played_professionally | sports.sports_team_roster : player, team, position | sports.pro_sports_played : sport, career_start, career_end | sports.sports_team : colors, location, team_mascot, sport, fight_song, roster | american_football.football_player : position_s | common.topic : notable_types | kg.object_profile : prominent_type | sports.school_sports_team : school\n\n\nquestion:\n\nWhich school with the fight song \"The Orange and Blue\" did Emmitt Smith play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.01480y ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.fight_song ns:m.04f__h7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Florida Gators football"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMr. Woodson: m.0dl7n6y | Tupac Shakur: m.07pzc | film.film_subject : films | people.person : profession, nationality, ethnicity, education, places_lived, gender | music.composer : compositions | music.featured_artist : recordings | music.artist : album, origin, label, track | type.object : type | film.film : produced_by, language, film_production_design_by, release_date_s, film_art_direction_by, music, country, costume_design_by, genre, starring | music.lyricist : lyrics_written | education.education : institution | film.actor : film | film.performance : character, actor, film | people.place_lived : location | book.author : book_editions_published | common.topic : image, notable_types | award.award_nominee : award_nominations | award.award_nomination : nominated_for | people.deceased_person : cause_of_death | music.producer : releases_produced | film.film_character : portrayed_in_films | film.film_regional_release_date : film_release_distribution_medium, release_date | media_common.netflix_title : netflix_genres\n\n\nquestion:\n\nWhat movie with film character named Mr. Woodson did Tupac star in?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07pzc ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:m.0dl7n6y .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Gridlock'd"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJerry Jones: m.016b9c | people.person : religion, profession, nationality, date_of_birth, height_meters, place_of_birth, gender | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : cause_of_death | kg.object_profile : prominent_type | type.object : type | government.politician : government_positions_held | government.government_position_held : legislative_sessions, governmental_body | film.film : genre | music.group_member : instruments_played | american_football.football_player : position_s | location.location : containedby | sports.professional_sports_team : owner_s\n\n\nquestion:\n\nWho was the 1996 coach of the team owned by Jerry Jones?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.016b9c .\n?c ns:american_football.football_team.historical_coaching_staff ?y .\n?y ns:american_football.football_historical_coach_position.coach ?x .\nEXISTS {?y ns:american_football.football_historical_coach_position.from ?sk1 .\nEXISTS {?y ns:american_football.football_historical_coach_position.to ?sk3 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Barry Switzer"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDemi World Tour: m.010pzj9k | language.human_language : countries_spoken_in | location.location : contains, people_born_here | type.object : type | celebrities.celebrity : sexual_relationships | celebrities.romantic_relationship : end_date, start_date | common.topic : notable_types | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.ethnicity : languages_spoken | tv.tv_personality : tv_regular_appearances | tv.tv_regular_personal_appearance : to | music.genre : albums | location.country : second_level_divisions | location.statistical_region : cpi_inflation_rate | measurement_unit.dated_percentage : rate | media_common.netflix_genre : titles | people.person : nationality | music.artist : concert_tours | kg.object_profile : prominent_type\n\n\nquestion:\n\nWho dated the performer who headlined the concert tour called Demi World Tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.010pzj9k .\n?c ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Nicholas Braun, Joe Jonas, Cody Linley"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTim Howard: m.026s3n | Malcolm Glazer: m.043cq6 | location.location : contains, people_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | people.person : nationality, ethnicity | location.statistical_region : population, consumer_price_index, gdp_real, religions, co2_emissions_per_capita | location.religion_percentage : religion | sports.professional_sports_team : owner_s | location.country : second_level_divisions | measurement_unit.adjusted_money_value : adjusted_value | sports.sports_team : championships | measurement_unit.dated_integer : number\n\n\nquestion:\n\nWhich team owned by Malcolm Glazer has Tim Howard playing for it?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.026s3n ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.professional_sports_team.owner_s ns:m.043cq6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Manchester United F.C."
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nZac Efron: m.06wm0z | film.actor : film | film.performance : character, actor, film | type.object : type | people.person : religion, profession, gender | film.film : language, film_art_direction_by, story_by, release_date_s, written_by, executive_produced_by, initial_release_date, genre, starring | celebrities.celebrity : sexual_relationships | celebrities.romantic_relationship : end_date, celebrity | award.award_nominee : award_nominations | award.award_nomination : nominated_for | film.film_character : portrayed_in_films | film.producer : films_executive_produced | kg.object_profile : prominent_type | film.film_regional_release_date : release_date | fictional_universe.fictional_character : occupation, gender\n\n\nquestion:\n\nWhat movie starring Zac Efron that has a character named Owen Lars?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.06wm0z ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.starring ?c .\n?c ns:film.performance.character ns:g.11b62w3281 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Robot Chicken: Star Wars Episode III"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDetroit Business Institute: m.09ggd7n | type.object : type | common.topic : notable_types | organization.organization : headquarters, date_founded | kg.object_profile : prominent_type | sports.sports_team : location, sport, founded, roster | location.location : containedby | sports.sports_team_roster : player | people.person : profession | education.educational_institution : school_type | business.business_operation : industry | business.sponsored_recipient : sponsorship | business.sponsorship : sponsored_by\n\n\nquestion:\n\nWhat business titles was the most famous alumni of Detroit Business Institute best known for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.09ggd7n .\n?c ns:people.person.profession ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Businessperson, Business magnate, Industrialist, Inventor, Engineer, Entrepreneur"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nThe Wiz: m.027fwmt | HIStory World Tour: m.09x1nf | organization.organization : headquarters | music.genre : albums | music.album : release_date | music.composition : composer | people.person : sibling_s, date_of_birth, profession, place_of_birth | type.object : type | common.topic : notable_types | education.educational_institution : students_graduates | education.education : student | film.film_character : portrayed_in_films | film.performance : character, actor, film | location.statistical_region : co2_emissions_per_capita | music.artist : genre, concert_tours | award.award_category : date_established | film.film : starring, country | time.event : end_date | fictional_universe.fictional_language : found_in_fictional_universe | influence.influence_node : influenced | kg.object_profile : prominent_type | media_common.netflix_genre : titles | film.actor : film | people.sibling_relationship : sibling\n\n\nquestion:\n\nThe artist from the HIStory World Tour concert tour played what character on the Wiz?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.09x1nf .\n?c ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.027fwmt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Scarecrow"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nChamp: m.0kh6jz4 | Tyson Chandler: m.05j8c8 | award.award_nominee : award_nominations | award.award_nomination : award | sports.pro_athlete : teams, career_start | common.topic : notable_types | sports.professional_sports_team : owner_s | sports.sports_team : arena_stadium, founded, colors, team_mascot, location, sport, championships, roster | sports.sports_team_roster : player, team, position | basketball.basketball_player : position_s | type.object : type | people.person : ethnicity, profession, nationality, gender | kg.object_profile : prominent_type | basketball.basketball_team : head_coach\n\n\nquestion:\n\nWhat team with mascot named Champ did Tyson Chandler play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.05j8c8 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:sports.sports_team.team_mascot ns:m.0kh6jz4 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Dallas Mavericks"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nParkinson's disease: m.0g02vk | Communist Party of China: m.02189 | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | influence.influence_node : influenced_by, influenced | organization.organization : founders | government.politician : government_positions_held, party | government.government_position_held : basic_title, office_position_or_title, from, jurisdiction_of_office, to | common.topic : notable_types | kg.object_profile : prominent_type | people.deceased_person : date_of_death, place_of_death | type.object : type | people.person : religion, quotations, profession, nationality, height_meters, place_of_birth, gender | government.political_party_tenure : party | medicine.notable_person_with_medical_condition : condition | organization.organization_founder : organizations_founded\n\n\nquestion:\n\nWho was the creator of the communist party that had Parkinson's disease?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02189 ns:organization.organization.founders ?x .\n?x ns:medicine.notable_person_with_medical_condition.condition ns:m.0g02vk .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mao Zedong"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCollege/University: m.01y2hnl | Newt Gingrich: m.018fzs | Riptide the Pelican: m.05g1yr7 | education.educational_institution : mascot, school_type, students_graduates, sports_teams | government.politician : government_positions_held | type.object : type | people.person : education, spouse_s, profession, religion | film.actor : film | film.performance : character | people.marriage : spouse | education.education : institution, student, major_field_of_study, degree | location.location : containedby | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | book.author : book_editions_published | government.government_position_held : basic_title, office_position_or_title, from, legislative_sessions, to, governmental_body | symbols.namesake : named_after | book.periodical_publisher : periodicals_published | book.periodical_publisher_period : periodical | common.topic : notable_types | organization.organization : date_founded\n\n\nquestion:\n\nWhich college featured Riptide the pelican as a mascot and includes Newt Gincrich as an alumni?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.018fzs ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n?x ns:education.educational_institution.mascot ns:m.05g1yr7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Tulane University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTerry Collins: m.0bz4qr | type.object : type | american_football.football_player : position_s | location.location : contains, containedby | military.military_person : participated_in_conflicts | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | government.politician : government_positions_held | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | people.deceased_person : cause_of_death, date_of_death, place_of_death | base.culturalevent.event : entity_involved | government.government_position_held : to | common.topic : notable_types | media_common.netflix_title : netflix_genres | sports.sports_team : championships\n\n\nquestion:\n\nWhen did the team who has Terry Collins in leadership last win the world series?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:organization.organization.leadership ?k .\n?k ns:organization.leadership.person ns:m.0bz4qr .\n?c ns:sports.sports_team.championships ?x .\n?x ns:time.event.end_date ?sk0 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1986 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArabic Language: m.0jzc | Central Time Zone: m.02fqwt | location.statistical_region : cpi_inflation_rate, long_term_unemployment_rate, net_migration, co2_emissions_per_capita, part_time_employment_percent | measurement_unit.dated_integer : number | location.location : time_zones, adjoin_s, contains, people_born_here | location.adjoining_relationship : adjoins | time.time_zone : locations_in_this_time_zone | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | language.human_language : countries_spoken_in | location.country : languages_spoken | measurement_unit.dated_percentage : rate\n\n\nquestion:\n\nWhat country speaks Arabic in the Central Time Zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0jzc ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.location.time_zones ns:m.02fqwt .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Canada"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSouthern Peninsula: m.08kmfj | type.object : type | location.location : time_zones, containedby, contains, people_born_here | common.topic : notable_types | geography.river : mouth | travel.tourist_attraction : near_travel_destination | kg.object_profile : prominent_type | education.educational_institution : colors | location.country : languages_spoken, administrative_divisions\n\n\nquestion:\n\nWhat language is spoken in the country that has Southern Peninsular?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.08kmfj .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Icelandic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nEngland: m.02jx1 | Noddfa, Treorchy: m.0_gw15p | location.location : contains, people_born_here | biology.breed_origin : breeds_originating_here | book.book_subject : works | type.object : type | kg.object_profile : prominent_type | common.topic : notable_types | location.country : second_level_divisions\n\n\nquestion:\n\nWhich country with religious organization leadership Noddfa, Treorchy borders England?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02jx1 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\n?x ns:religion.religious_leadership_jurisdiction.leader ?c .\n?c ns:religion.religious_organization_leadership.organization ns:m.0_gw15p .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Wales"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n1948 Stanley Cup Finals: m.03cjpsk | common.topic : notable_types | people.person : profession, nationality, ethnicity, education, gender | location.country : internet_tld, capital, form_of_government | type.object : type | book.book : genre | people.deceased_person : cause_of_death, place_of_burial | influence.influence_node : influenced_by | time.event : end_date, start_date | government.political_party : politicians_in_this_party | government.political_party_tenure : politician | organization.organization : leadership | organization.leadership : person | music.genre : albums | language.human_language : language_family | education.education : major_field_of_study | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : career_start | religion.religion : texts | film.film_subject : films | book.book_subject : works | sports.sports_team : championships | architecture.building_function : buildings | sports.sports_championship_event : champion | location.location : contains, people_born_here | kg.object_profile : prominent_type | film.actor : film | film.performance : film | book.author : school_or_movement | government.election_campaign : candidate | time.recurring_event : instances\n\n\nquestion:\n\nWhat sport was played by the winners of the 1948 Stanley Cup?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.03cjpsk .\n?c ns:base.events.event_presenting_organisation.event_feed ?y .\n?y ns:base.events.event_feed.type_of_event ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Ice Hockey"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nPurdue Boilermakers men's basketball: m.026w398 | media_common.netflix_genre : titles | education.educational_institution : mascot, school_type, colors, sports_teams, students_graduates | location.location : time_zones, people_born_here, street_address, contains, containedby | law.invention : inventor | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | type.object : type | interests.hobby : people_with_this_hobby | film.film_subject : films | education.education : student | sports.sports_team : team_mascot, sport, colors | periodicals.newspaper_circulation_area : newspapers | kg.object_profile : prominent_type | common.topic : notable_types\n\n\nquestion:\n\nWhich city is home to the University that is known for Purdue Boilermakers men's basketball?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:education.educational_institution.sports_teams ns:m.026w398 .\n?c ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "West Lafayette"
    }
]