[
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nI'm Your Baby Tonight World Tour: m.047bc2r | location.location : containedby | music.artist : label, concert_tours | people.deceased_person : cause_of_death, date_of_death | type.object : type | government.politician : government_positions_held | government.government_position_held : office_holder, basic_title, office_position_or_title, from, to | government.political_district : representatives | film.film : country, initial_release_date | common.topic : notable_types | people.person : profession, nationality, ethnicity, place_of_birth, gender | architecture.structure : opened, height_meters | organization.organization : founders | music.composer : compositions | sports.pro_athlete : sports_played_professionally, career_start, career_end | education.educational_institution : school_type | american_football.football_player : position_s | government.government_office_or_title : office_holders | music.album : release_date | award.award_category : winners | award.award_honor : award_winner | film.film_character : portrayed_in_films | film.performance : actor | sports.pro_sports_played : sport | people.ethnicity : languages_spoken | time.event : start_date\n\n\nquestion:\n\nWhat was the cause of death for the artist who headlined the \"I'm your baby tonight\" world tour?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:music.artist.concert_tours ns:m.047bc2r .\n?c ns:people.deceased_person.cause_of_death ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Drowning, Coronary artery disease, Cocaine overdose"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nWestern European Time Zone: m.02q_y6 | basque: m.017k6 | location.location : time_zones, contains | time.time_zone : locations_in_this_time_zone | language.human_language : countries_spoken_in | location.country : administrative_divisions\n\n\nquestion:\n\nIn what Western European Time Zone do they speak Basque?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.017k6 ns:language.human_language.countries_spoken_in ?x .\n?x ns:location.location.time_zones ns:m.02q_y6 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Spain"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nColumbia Lions Softball: m.0vx41sj | Barack Obama: m.02mjmr | government.political_appointer : appointees | government.government_position_held : from, office_position_or_title, to | government.politician : government_positions_held | education.university : number_of_undergraduates, number_of_postgraduates | measurement_unit.dated_integer : number | award.award_winner : awards_won | award.award_honor : award | people.person : religion, profession, education, places_lived, height_meters | type.object : type | people.place_lived : location | organization.organization : date_founded | education.educational_institution : students_graduates, sports_teams | event.public_speaker : speeches_or_presentations | event.speech_or_presentation : speech_topic | education.education : student | sports.school_sports_team : school\n\n\nquestion:\n\nWhich university has a sports team called Columbia Lions Softball, and was attended by Barack Obama?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:education.educational_institution.sports_teams ns:m.0vx41sj .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": true,
        "task_name": "compwebq",
        "answer": "Columbia University"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nHawke's Bay: m.0125s7 | United Kingdom: m.07ssc | location.location : contains, people_born_here | location.country : iso3166_1_alpha2, administrative_divisions | fictional_universe.fictional_setting : fictional_characters_born_here | government.governmental_jurisdiction : governing_officials | government.government_position_held : basic_title, office_holder, governmental_body | sports.sports_team_location : teams | kg.object_profile : prominent_type | type.object : type | location.statistical_region : places_imported_from | location.imports_and_exports : imported_from | food.beer_country_region : beers_from_here\n\n\nquestion:\n\nWhat country feature Hawke's bay as a body of water and has the UK importing from it?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.07ssc ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n?x ns:location.country.administrative_divisions ns:m.0125s7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New Zealand"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nQunu, Eastern Cape: m.0b3jmh | City/Town/Village: m.01m9 | type.object : type | kg.object_profile : prominent_type | location.location : time_zones, people_born_here, area, containedby | architecture.structure : height_meters | common.topic : notable_types | travel.tourist_attraction : near_travel_destination | people.person : place_of_birth | architecture.building : floors\n\n\nquestion:\n\nThe person who once lived in Qunu, Eastern Cape was born in what City?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.places_lived ?k .\n?k ns:people.place_lived.location ns:m.0b3jmh .\n?c ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Mvezo"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nTurkish people: m.0hb7h_z | Kleve (district): m.01b98m | location.location : containedby, events, adjoin_s, people_born_here, contains, partially_contains | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | people.ethnicity : includes_groups, geographic_distribution | type.object : type | government.political_district : representatives | government.government_position_held : office_holder | government.governmental_jurisdiction : governing_officials | location.country : calling_code, languages_spoken | location.adjoining_relationship : adjoins\n\n\nquestion:\n\nWhat location with an airport that serves Kleve (district) do Turkish people originate from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0hb7h_z ns:people.ethnicity.geographic_distribution ?x .\n?x ns:location.location.contains ?c .\n?c ns:aviation.airport.serves ns:m.01b98m .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Germany"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\n2004 NBA Finals: m.07p0zz | sports.sports_championship : events | time.recurring_event : current_frequency, date_of_first_occurance | award.award_nominee : award_nominations | award.award_nomination : award | type.object : type | organization.organization : leadership, date_founded | sports.sports_team : founded, colors, team_mascot, championships, roster | basketball.basketball_team : head_coach | sports.sports_team_roster : player | organization.leadership : person | kg.object_profile : prominent_type | sports.sports_championship_event : runner_up\n\n\nquestion:\n\nIn what years did the 2004 NBA Finals winners win the championship?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.sports_team.championships ns:m.07p0zz .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "2004 NBA Finals, 1990 NBA Finals, 1989 NBA Finals"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nFred Wilpon: m.07v42m | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | type.object : type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport | government.politician : government_positions_held | government.government_position_held : office_position_or_title, from, governmental_body | people.deceased_person : cause_of_death, date_of_death, place_of_death | media_common.dedicator : dedications | media_common.dedication : work_dedicated | sports.professional_sports_team : owner_s | sports.sports_team : championships | location.location : containedby | kg.object_profile : prominent_type\n\n\nquestion:\n\nWhen did owner Fred Wilpon's sports team win the pennant?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:sports.professional_sports_team.owner_s ns:m.07v42m .\n?c ns:sports.sports_team.championships ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "1986 World Series, 1969 World Series"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nJames T. Kirk: m.0crtw | Hyperactivity: m.04txf7 | film.film_character : portrayed_in_films | film.performance : character, actor, film | influence.influence_node : influenced_by, influenced | type.object : type | tv.tv_character : appeared_in_tv_program | tv.regular_tv_appearance : actor | medicine.notable_person_with_medical_condition : condition | people.person : religion, profession, nationality, gender | film.actor : film | celebrities.celebrity : sexual_relationships | celebrities.romantic_relationship : end_date, celebrity | fictional_universe.fictional_character : children, character_created_by, place_of_birth, gender | film.writer : film | kg.object_profile : prominent_type | food.diet_follower : follows_diet | film.producer : film\n\n\nquestion:\n\nWho played Captain Kirk in \"Star Trek\" and is known for his hyperactivity?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0crtw ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n?x ns:medicine.notable_person_with_medical_condition.condition ns:m.04txf7 .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Jim Carrey"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nAnwar Sadat: m.0d58h | location.country : languages_spoken | people.deceased_person : place_of_death | people.person : religion, children, profession, nationality, height_meters, place_of_birth, gender | military.military_person : participated_in_conflicts | government.politician : government_positions_held | type.object : type | government.government_position_held : governmental_body, basic_title, jurisdiction_of_office | kg.object_profile : prominent_type | sports.pro_athlete : sports_played_professionally | sports.pro_sports_played : sport, career_start | american_football.football_player : position_s | influence.influence_node : influenced_by\n\n\nquestion:\n\nWhich language is spoken at the location that appointed Anwar Sadat to a governmental position utilize?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.0d58h .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Siwi Language, Modern Standard Arabic, Egyptian Arabic, Sa'idi Arabic, Arabic, Sudanese Spoken Language, Bedawi Arabic, Nobiin Language, Domari Language, Arabic Language"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nCook Islands: m.020p1 | location.location : time_zones, containedby | common.topic : notable_types | kg.object_profile : prominent_type | type.object : type | government.government_office_category : officeholders | government.government_position_held : office_holder | location.country : administrative_divisions | architecture.structure : height_meters | travel.tourist_attraction : near_travel_destination | film.film : country | people.person : profession\n\n\nquestion:\n\nWhere does the country who contains the Cook Islands import from?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.020p1 .\n?c ns:location.statistical_region.places_imported_from ?y .\n?y ns:location.imports_and_exports.imported_from ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "China"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nShwesandaw Pagoda, Pyay: m.02rr8c7 | type.object : type | location.location : time_zones, area, contains, containedby | religion.religion : deities, places_of_worship | kg.object_profile : prominent_type | common.topic : notable_types | architecture.structure : opened\n\n\nquestion:\n\nWhat are the gods of the religion that worships at Shewesandaw Pagoda Pyay?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:religion.religion.places_of_worship ns:m.02rr8c7 .\n?c ns:religion.religion.deities ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Hariti, Acala, Yaksha, Nāga, Yama, Asura"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nGreece: m.035qy | Central European Time Zone: m.02llzg | Country: m.01mp | location.location : time_zones, contains, people_born_here | time.time_zone : locations_in_this_time_zone | location.country : official_language, second_level_divisions, administrative_divisions | common.topic : notable_types | travel.travel_destination : tourist_attractions | kg.object_profile : prominent_type | location.statistical_region : consumer_price_index | broadcast.radio_station_owner : radio_stations | type.object : name, type | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_position_or_title\n\n\nquestion:\n\nWhat countries in the Central European Time Zone share a border with Greece?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.035qy ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n?x ns:location.location.time_zones ns:m.02llzg .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Republic of Macedonia, Albania"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDanny Jones Middle School: m.076ftz0 | kg.object_profile : prominent_type | organization.organization : headquarters, date_founded | type.object : type | location.location : containedby | education.school : highest_grade_taught | common.topic : notable_types | education.educational_institution : school_type, students_graduates, colors | education.education : student | sports.sports_team : sport, founded | organization.membership_organization : members | organization.organization_membership : member\n\n\nquestion:\n\nWhere does the person live who attended the Danny Jones Middle School education institution?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:people.person.education ?k .\n?k ns:education.education.institution ns:m.076ftz0 .\n?c ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "New York City"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nArdabil Province: m.029mt3 | location.location : time_zones, containedby | type.object : type | kg.object_profile : prominent_type | location.country : administrative_divisions, form_of_government | common.topic : notable_types | architecture.structure : height_meters | government.government_position_held : office_holder, to | government.politician : government_positions_held\n\n\nquestion:\n\nWhat is the governmental type in the country where Ardabil Province is located?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.administrative_divisions ns:m.029mt3 .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Parliamentary system, Presidential system, Islamic republic, Unitary state, Theocracy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nBrasília: m.01hy_ | type.object : type | location.location : time_zones, contains, containedby | kg.object_profile : prominent_type | common.topic : notable_types | location.country : capital, currency_used | organization.organization : date_founded | architecture.structure : opened\n\n\nquestion:\n\nThe country with the capital of Brasilia uses what type of money?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.capital ns:m.01hy_ .\n?c ns:location.country.currency_used ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Brazilian real"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nShaquille O'Neal: m.012xdf | Johnny Jones: m.026kcmz | government.governmental_jurisdiction : governing_officials | government.government_position_held : office_holder | location.location : contains, people_born_here | basketball.basketball_team : head_coach | people.person : nationality | sports.sports_team : roster | location.statistical_region : population, net_migration, gdp_real | measurement_unit.adjusted_money_value : adjusted_value | measurement_unit.dated_integer : number | sports.pro_athlete : teams | sports.sports_team_roster : position\n\n\nquestion:\n\nWhat team with basketball head coach Johnny Jones did Shaq play for?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n?x ns:basketball.basketball_team.head_coach ns:m.026kcmz .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "LSU Tigers men's basketball"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nSaudi riyal: m.02d1cm | location.location : containedby, partially_containedby, contains, people_born_here | type.object : name, type | architecture.structure : opened, height_meters | language.human_language : countries_spoken_in | location.country : official_language, currency_used, form_of_government | people.person : religion, children, profession, nationality, parents, places_lived, date_of_birth, height_meters, place_of_birth, gender | people.place_lived : location | government.politician : government_positions_held | government.government_office_category : officeholders | government.government_position_held : basic_title, office_holder, from, governmental_body | organization.organization : founders | government.governmental_jurisdiction : governing_officials | military.military_conflict : combatants | military.military_combatant_group : combatants | government.political_district : representatives | common.topic : notable_types | government.form_of_government : countries | time.time_zone : locations_in_this_time_zone | finance.currency : countries_used\n\n\nquestion:\n\nThe country that uses the currency the Saudi Riyal has what type of government system?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.02d1cm .\n?c ns:location.country.form_of_government ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Unitary state, Islamic state, Absolute monarchy"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nDu gamla, Du fria: m.0m6w8 | location.location : time_zones, containedby, contains, people_born_here | type.object : type | government.government_office_or_title : office_holders | government.government_position_held : office_holder, governmental_body | people.person : religion, profession, nationality, height_meters, place_of_birth, gender | kg.object_profile : prominent_type | royalty.monarch : kingdom | music.group_member : instruments_played | location.administrative_division : country | people.deceased_person : place_of_death | common.topic : notable_types | government.governmental_body : members\n\n\nquestion:\n\nThe country with the national anthem Du gamla, Du fria is part of what time zone?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.national_anthem ?k .\n?k ns:government.national_anthem_of_a_country.anthem ns:m.0m6w8 .\n?c ns:location.location.time_zones ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Central European Time Zone"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nMozambican metical: m.05yxqw | location.location : time_zones, contains, containedby | time.time_zone : locations_in_this_time_zone | people.person : profession, nationality, place_of_birth, gender | finance.currency : countries_used, countries_formerly_used | government.politician : government_positions_held | government.government_position_held : basic_title, office_holder, from | government.form_of_government : countries | location.country : currency_used, second_level_divisions | government.government_office_or_title : office_holders | government.government_office_category : officeholders | common.topic : notable_types | kg.object_profile : prominent_type | location.administrative_division : country | geography.river : mouth | type.object : name, type | government.governmental_jurisdiction : governing_officials | location.statistical_region : size_of_armed_forces | measurement_unit.dated_integer : number | language.human_language : countries_spoken_in\n\n\nquestion:\n\nWhere is the currency used in the country with Mozambican metical?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:location.country.currency_used ns:m.05yxqw .\n?c ns:base.locations.countries.continent ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Africa"
    },
    {
        "instruction": "Given the list of schema items, write an SPARQL query that can be used to find the answer to the following question. schema:\n\nVáclav Klaus: m.01s4th | military.military_person : participated_in_conflicts | type.object : type | people.deceased_person : cause_of_death, date_of_death, place_of_death | people.person : religion, profession, nationality, date_of_birth, place_of_birth, gender | government.government_position_held : to, jurisdiction_of_office | sports.pro_athlete : sports_played_professionally, career_start | sports.pro_sports_played : sport | government.politician : government_positions_held | kg.object_profile : prominent_type | location.country : languages_spoken | american_football.football_player : position_s\n\n\nquestion:\n\nWhat languages are used by individuals in the region where a governmental post is occupied by Vaclav Klaus?",
        "input": "",
        "output": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n?c ns:government.governmental_jurisdiction.governing_officials ?k .\n?k ns:government.government_position_held.appointed_by ns:m.01s4th .\n?c ns:location.country.languages_spoken ?x .\n}",
        "system": "You are an AI assistant that specializes in analyzing and reasoning over structured information. You will be given a task, optionally with some structured knowledge input. Your answer must strictly adhere to the output format, if specified.",
        "is_truncated": false,
        "task_name": "compwebq",
        "answer": "Romani language, Rusyn Language, Bulgarian Language, Czech Language, Hungarian, Greek Language, German Language, Polish Language, Russian Language, Slovak Language, Ukrainian Language, Serbian language, Croatian language"
    }
]